000100**   Copyright (c) Shell Stream Software LLC, All Rights Reserved.
000200**
000300**
000400**   File:       editwin.wcb
000500**
000600**   Project:    WISP/SAMPLE
000700**
000800**   Purpose:    Test VWANG edit window.
000900**
001000**   Example:
001100**
001200 IDENTIFICATION DIVISION.
001300 PROGRAM-ID. EDITWIN.
001400 
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
       FIGURATIVE-CONSTANTS.
           HEX-80 IS "80"
           HEX-FC IS "FC"
           HEX-FD IS "FD"
           HEX-FF IS "FF".

001700 INPUT-OUTPUT SECTION.
001800
       FILE-CONTROL.

           SELECT CRT
               ASSIGN TO "CRT",      "DISPLAY",
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS RANDOM
               RELATIVE KEY    IS LINENUM
               PFKEY           IS PF-KEY
               CURSOR POSITION IS CURSOR-POS
               FILE STATUS     IS FILSTAT.
      
001900 DATA DIVISION.
002000 FILE SECTION.

       FD  CRT
           LABEL RECORDS ARE OMITTED.
       01  CRTREC.
           03  CRTREC-OA.
               05  CRT-OA-1             PIC X.
               05  CRT-OA-2             PIC X.
               05  CRT-OA-3             PIC X.
               05  CRT-OA-4             PIC X.
           03  CRTREC-MAPPING-AREA          PIC X(1920).

002100 WORKING-STORAGE SECTION.
002200
       77  LINENUM                        PIC 9(02) VALUE 1.
       77  PF-KEY                         PIC X(02) VALUE ZERO.

       01  CURSOR-POS.
           03  MOD-COL                    BINARY.
           03  MOD-ROW                    BINARY.

       01  FILSTAT.
           03  ERR-FLAG                   PIC X(01).
           03  PFK-BYTE                   PIC X(01).

       01  afield1 pic x(20) value "a field".

       01 s0 usage is display-ws.
	   05 filler   pic x(30) row 1 column 25
	       value "Vwang Edit Window Test".
	   05 filler   pic x(30) row 6 column 30
	       value "(1) DISPLAY AND READ".
	   05 filler   pic x(30) row 8 column 30
	       value "(2) REWRITE and READ".
	   05 filler   pic x(20) row 24 column 30
	       value "(16) EXIT".

       01 s1 usage is display-ws.
	   05 filler   pic x(30) row 1 column 25
	       value "Vwang Edit Window Test".
	   05 filler pic x(20) row 4 column 10
	       value "A Regular field".
	   05 filler pic x(20) row 4 column 32
	       source afield1 object afield1.
	   05 filler   pic x  row 8 column 30
	       value HEX-FC.
	   05 filler   pic x  row 16 column 50
	       value HEX-FF.
	   05 filler   pic x(40) row 24 column 20
	       value "(1) REPEAT (16) EXIT".
      
002300 PROCEDURE DIVISION.
002400 0000-MAIN SECTION.
002500
	   Perform until PF-KEY = 16
      
	       DISPLAY AND READ S0 ON CRT
	       ONLY PFKEY 1, 2, 16

	       if pf-key = "01" then 
		   perform 0001-DNR
		   move "01" to pf-key
	       end-if
	       if pf-key = "02" then 
		   perform 0001-RNR
		   move "02" to pf-key
	       end-if

	   end-perform.


       0001-RNR.

	   Perform until PF-KEY = 16

               MOVE 1 TO LINENUM
	       MOVE HEX-80 TO CRT-OA-2
	       move hex-fc to crtrec(434:1)
	       move hex-ff to crtrec(854:1)

	       rewrite crtrec
	       read crt modifiable

	       move crtrec(434:20) to crtrec(1234:20)

	   end-perform.
       
       0001-DNR.
	   Perform until PF-KEY = 16
      
	       DISPLAY AND READ S1 ON CRT
	       ONLY PFKEY 1, 16

	   end-perform.
      
002600 9999-END SECTION.
002700 9999-EXIT.
002800     EXIT PROGRAM.
002900 9999-STOP.
003000     STOP RUN.
006500**
006600**   End of EDITWIN.wcb
006700**
