000100**   Copyright (c) 1997 NeoMedia Migrations, All rights reserved.
000200**
000300**
000400**   File:       MAINMENU.wcb
000500**
000600**   Project:    WISP/SAMPLE
000700**
000800**   Purpose:    
000900**
001000**   Example:
001100**
001200 IDENTIFICATION DIVISION.
001300 PROGRAM-ID. MAINMENU.
001400 
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
       FIGURATIVE-CONSTANTS.
           FAC-BOLD  IS "84"
	   FAC-BLANK IS "98".

001700 INPUT-OUTPUT SECTION.
001800
       FILE-CONTROL.
       	   SELECT THE-WORKSTATION
	       ASSIGN TO "SCREEN" "DISPLAY"
	       ORGANIZATION IS SEQUENTIAL
	       ACCESS MODE IS RANDOM
               PFKEY IS PF-KEY.
	       
001900 DATA DIVISION.
002000 FILE SECTION.

       FD  THE-WORKSTATION
       	   LABEL RECORDS ARE OMITTED
	   RECORD CONTAINS 1924 CHARACTERS.
       01  CRTREC  PIC X(1924).
       
002100 WORKING-STORAGE SECTION.
002200
       77  PF-KEY                         PIC X(02) VALUE "00".

       01  MAIN-MENU-SCREEN USAGE IS DISPLAY-WS.
       	   05  FILLER  PIC X(40) ROW  1 COLUMN 20
	       VALUE "    *** THE ACME WIDGET COMPANY ***    ".
	   05  FILLER  PIC X(10) ROW  2 COLUMN 35
	       VALUE "MAIN MENU".
	   05  FILLER  PIC X(04) ROW  4 COLUMN  2 
       	       VALUE "User".
       	   05  S-USER  PIC X(24) ROW  4 COLUMN 20 
       	       SOURCE IS X-USER.
	   05  FILLER  PIC X(16) ROW  6 COLUMN  2
	       VALUE "Enter Division:".
	   05  FILLER  PIC X(20) ROW  6 COLUMN 20
	       SOURCE IS W-DIVISION OBJECT IS W-DIVISION.
	   05  FILLER  PIC X(16) ROW  8 COLUMN  2
	       VALUE "Enter PASSWORD:".
	   05  S-PASSWORD  PIC X(20) ROW  8 COLUMN 20
	       OBJECT IS W-PASSWORD.
	   05  FILLER PIC X(60)  ROW 24 COLUMN 10
	       VALUE "(1) Change user  (2) Lookup division (12) Exit".

       01  K-NA	   PIC X(2) VALUE "NA".
       01  X-USER  PIC X(24).
       01  W-DIVISION  PIC X(20) VALUE "NEW YORK".
       01  W-PASSWORD  PIC X(8)  VALUE SPACES.
       
002300 PROCEDURE DIVISION.
002400 0000-MAIN SECTION.
002500

       	   MOVE FAC-BOLD TO FAC OF S-USER.
	   MOVE FAC-BLANK TO FAC OF S-PASSWORD.
	   
       	   CALL "EXTRACT" USING K-NA, X-USER.

       1000-LOOP.
      
       	   DISPLAY AND READ MAIN-MENU-SCREEN ON THE-WORKSTATION
	       PFKEYS 1, 2, 12.

       	   IF PF-KEY NOT = "12" THEN GO TO 1000-LOOP.
	   
002600 9999-END SECTION.
002700 9999-EXIT.
002800     EXIT PROGRAM.
002900 9999-STOP.
003000     STOP RUN.
006500**
006600**   End of MAINMENU.wcb
006700**
