000100* $Id:$
000200/*****************************************************************
000300*                                                                *
000400*                       IDENTIFICATION DIVISION                  *
000500*                                                                *
000600******************************************************************
000700*
000800 IDENTIFICATION DIVISION.
000900 PROGRAM-ID.
001000     QAMESSAG.
001500/*****************************************************************
001600*                                                                *
001700*                         ENVIRONMENT DIVISION                   *
001800*                                                                *
001900******************************************************************
002000*
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.
002400     WANG-VS.
002500 OBJECT-COMPUTER.
002600     WANG-VS.
002700 FIGURATIVE-CONSTANTS.
002800     BLINK-BIT IS "10"
002900     PROTECT-BIT IS "04"
003000     DIM-BIT IS "08"
003100     TAB-STOP IS "86"
003200     BLINKING-DISPLAY IS "94"
003300     LOWER-FAC IS "80"
003400     BRITE IS "84"
003500     NO-ECHO IS "98"
003501     FAC-MOD IS "81"
003502     FAC-LINE IS "AD"
003600     PFK-NOT-SET IS "00"
003700     PFK-SET IS "01"
003800     HEX-00 IS "00", HEX-01 IS "01", HEX-20 IS "20",
003900     HEX-40 IS "40", HEX-80 IS "80", HEX-A0 IS "A0".
004000
004100/*****************************************************************
004200*                                                                *
004300*                         INPUT-OUTPUT SECTION                   *
004400*                                                                *
004500******************************************************************
004600*
004700 INPUT-OUTPUT SECTION.
004800 FILE-CONTROL.
004900*
005000     SELECT CRT
005100         ASSIGN TO "CRT",      "DISPLAY",
005200         ORGANIZATION    IS SEQUENTIAL
005300         ACCESS MODE     IS RANDOM
005400         RELATIVE KEY    IS LINENUM
005500         PFKEY           IS PF-KEY
005600         CURSOR POSITION IS CURSOR-POS
005700         FILE STATUS     IS FILSTAT.
005800
005900     SELECT CRT-OA-ONLY
006000         ASSIGN TO "OAONLY",      "DISPLAY",
006100         ORGANIZATION    IS SEQUENTIAL
006200         ACCESS MODE     IS RANDOM
006300         RELATIVE KEY    IS LINENUM
006400         PFKEY           IS PF-KEY
006500         CURSOR POSITION IS CURSOR-POS
006600         FILE STATUS     IS FILSTAT.
006700
006800
006900/*****************************************************************
007000*                                                                *
007100*                      DATA DIVISION - FILE SECTION              *
007200*                                                                *
007300******************************************************************
007400*
007500 DATA DIVISION.
007600 FILE SECTION.
       
       FD  CRT
           LABEL RECORDS ARE OMITTED.
       01  CRTREC.
           03  CRTREC-OA.
               05  CRTREC-OA-1             PIC X.
               05  CRTREC-OA-2             PIC X.
               05  CRTREC-OA-3             PIC X.
               05  CRTREC-OA-4             PIC X.
           03  CRTREC-MAPPING-AREA.
               05  CRTREC-ROW  OCCURS 24 TIMES.
                   10 CRTREC-X OCCURS 80 TIMES PIC X.
      
008200 FD  CRT-OA-ONLY
008300     LABEL RECORDS ARE OMITTED.
008400 01  CRT-OA-ONLY-REC                PIC X(4).
008500
008600
008700*
008800/*****************************************************************
008900*                                                                *
009000*                         WORKING STORAGE                        *
009100*                                                                *
009200******************************************************************
009300*
009400 WORKING-STORAGE SECTION.
009500
009503
009600 01  INDEX-COUNTER                  PIC 9(5).
009700 01  FILSTAT.
009800     03  ERR-FLAG                   PIC X(01).
009900     03  PFK-BYTE                   PIC X(01).
010000
010100 77  LINENUM                        PIC 9(02) VALUE 1.
010200 77  PF-KEY                         PIC X(02) VALUE ZERO.
010300
010400 01  CURSOR-POS.
010500     03  MOD-COL                    BINARY.
010600     03  MOD-ROW                    BINARY.
010700
010800 01  REDEF-CURS-POS                 REDEFINES CURSOR-POS.
010900     03  FILLER                     PIC X(01).
011000     03  CURS-COL                   PIC X(01).
011100     03  FILLER                     PIC X(01).
011200     03  CURS-ROW                   PIC X(01).
011300


245500******************************************************************
245600
245700 01  MSG-FN PIC XX VALUE SPACES.
245800 01  MSG-PORT PIC X(4) VALUE "ABCD".
245900 01  MSG-SND PIC X(55) VALUE SPACES.
246000 01  MSG-RCV PIC X(55) VALUE SPACES.
246100 01  MSG-RET PIC 9(4) VALUE ZERO.
246200 01  MSG-RET-X.
246300     03  FILLER BINARY VALUE ZERO.
246400     03  MSG-RET-X-0 BINARY VALUE ZERO.
246500 01  MSG-TYPE PIC X(1) VALUE SPACES.
246600 01  MSG-TIME PIC 9(4) VALUE 500.
246700 01  MSG-BUF-SIZE.
246800     03  FILLER BINARY VALUE ZERO.
246900     03  FILLER BINARY VALUE 2014.
247000 01  MSG-KEEP PIC X VALUE "N".
247100 01  MSG-TIME-X.
247200     03  FILLER BINARY VALUE ZERO.
247300     03  MSG-TIME-X-0 BINARY VALUE ZERO.
247400 01  MSG-LEN-X.
247500     03  FILLER BINARY VALUE ZERO.
247600     03  FILLER BINARY VALUE 55.
247700 01  MSG-LEN-X2.
247800     03  FILLER BINARY VALUE ZERO.
247900     03  FILLER BINARY VALUE 55.
248000 01  MSG-DUMMY PIC X VALUE SPACES.
248100
248200 01  MESSAGE-SCR USAGE IS DISPLAY-WS.
248300
248400     03  FILLER PIC X(35) ROW 1 COLUMN 21
248500         VALUE "*** TESTING THE MESSAGE VSSUB ***".
248600
248700     03  FILLER PIC X(30) ROW 3 COLUMN 23
248800         VALUE "SPECIFY PARAMETERS FOR MESSAGE".
248900
249000     03  FILLER PIC X(5) ROW 5 COLUMN 14
249100         VALUE "PORT ".
249200
249300     03  FILLER PIC X(4) ROW 5 COLUMN 19
249400         SOURCE MSG-PORT OBJECT MSG-PORT.
249500
249600     03  FILLER PIC X(13) ROW 7 COLUMN 6
249700         VALUE "SEND MESSAGE ".
249800
249900     03  FILLER PIC X(55) ROW 7 COLUMN 19
250000         SOURCE MSG-SND OBJECT MSG-SND.
250100
250200     03  FILLER PIC X(16) ROW 8 COLUMN 3
250300         VALUE "RECEIVE MESSAGE ".
250400
250500     03  FILLER PIC X(55) ROW 8 COLUMN 19
250600         SOURCE MSG-RCV.
250700
250800     03  FILLER PIC X(12) ROW 10 COLUMN 7
250900         VALUE "RETURN-CODE ".
251000
251100     03  MSG-RET-S PIC ZZZ9 ROW 10 COLUMN 19
251200         SOURCE MSG-RET.
251300
251400     03  FILLER PIC X(35) ROW 12 COLUMN 2
251500         VALUE "(1) (CR)   Create Message Port".
251600
251700     03  FILLER PIC X(25) ROW 12 COLUMN 43
251800         VALUE "KEEP port on unlink (Y/N)".
251900
252000     03  FILLER PIC X ROW 12 COLUMN 70
252100         SOURCE MSG-KEEP OBJECT MSG-KEEP.
252200
252300     03  FILLER PIC X(40) ROW 13 COLUMN 2
252400         VALUE "(2) (DE)   Destroy Message Port".
252500
252600     03  FILLER PIC X(40) ROW 14 COLUMN 2
252700         VALUE "(3) (XM)   Transmit".
252800
252900     03  FILLER PIC X(40) ROW 15 COLUMN 2
253000         VALUE "(4) (XW)   Transmit and Wait".
253100
253200     03  FILLER PIC X(40) ROW 16 COLUMN 2
253300         VALUE "(5) (CH-W) Check and Wait".
253400
253500     03  FILLER PIC X(35) ROW 17 COLUMN 2
253600         VALUE "(6) (CH-T) Check with Timeout".
253700
253800     03  FILLER PIC X(4) ROW 17 COLUMN 41
253900         VALUE "TIME".
254000     03  FILLER PIC 9(4) ROW 17 COLUMN 47
254100         SOURCE MSG-TIME OBJECT MSG-TIME.
254200
254300     03  FILLER PIC X(40) ROW 18 COLUMN 2
254400         VALUE "(7) (CH-K) Check with Key Interrupt".
254500
254600     03  FILLER PIC X(60) ROW 19 COLUMN 2 VALUE
254700         "(8) (CH-B) Check with Both          TIME (above)".
254800
254900     03  FILLER PIC X(11) ROW 21 COLUMN 2
255000         VALUE "(16) EXIT".
255100
255200     03  FILLER PIC X(25) ROW 24 COLUMN 26
255300         VALUE "PRESS A PFKEY TO CONTINUE".
255400
255500 01  MESSAGE-UNLOCK-OA.
255600         10  FILLER  PIC X VALUE HEX-01.
255700         10  FILLER  PIC X VALUE HEX-A0.
255800         10  FILLER  PIC X VALUE HEX-00.
255900         10  FILLER  PIC X VALUE HEX-00.
256000 01  MESSAGE-LOCK-OA.
256100         10  FILLER  PIC X VALUE HEX-01.
256200         10  FILLER  PIC X VALUE HEX-40.
256300         10  FILLER  PIC X VALUE HEX-00.
256400         10  FILLER  PIC X VALUE HEX-00.
256500 01  MESSAGECRT.
256600     05  OA-MESSAGECRT PIC X(4).
256700     05  FILLER PIC X(80) value
256800     "             **** WAITING FOR MESSAGE OR AID CHAR ****".
256900     05  FILLER pic x(400) value spaces.
257000     05  FILLER PIC X(80) value
257100     " Enter some text while waiting, then press an AID key".
257200     05  MSG-FAC-01 pic x.
257300     05  MSG-LINE-01 pic x(79) value spaces.
257400     05  MSG-FAC-02 pic x.
257500     05  MSG-LINE-02 pic x(79) value spaces.
257600     05  MSG-FAC-03 pic x.
257700     05  MSG-LINE-03 pic x(79) value spaces.
257800     05  FILLER pic x(1120) value spaces.
257900******************************************************************
258000

274500
274600
274700/*****************************************************************
274800*                                                                *
274900*                         PROCEDURE DIVISION                     *
275000*                                                                *
275100******************************************************************
275200*
275300 PROCEDURE DIVISION.
275400
275500 SUBROUTINE-TESTS.
275600     OPEN I-O CRT.

278800     PERFORM MESSAGE-CALL.

399534******************************************************************
399600* ALL DONE.
399700******************************************************************
399800
399900 EXIT-PROGRAM.
           CLOSE CRT.
400000     EXIT PROGRAM.
400100
400200 STOP-RUN.
400300     STOP RUN.



345900******************************************************************
346000
346100 MESSAGE-CALL.
346200     MOVE BRITE TO FAC OF MSG-RET-S.
346300     DISPLAY AND READ MESSAGE-SCR ON CRT
346400     PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 16.
346500
346600     IF PF-KEY = "01" THEN
346700          MOVE "CR" TO MSG-FN
346800          CALL "MESSAGE" USING MSG-FN
346900                               MSG-PORT
347000                               MSG-BUF-SIZE
347100                               MSG-KEEP
347200                               MSG-RET-X
347300     ELSE IF PF-KEY = "02" THEN
347400          MOVE "DE" TO MSG-FN
347500          CALL "MESSAGE" USING MSG-FN
347600                               MSG-PORT
347700                               MSG-RET-X
347800     ELSE IF PF-KEY = "03" THEN
347900          MOVE "XM" TO MSG-FN
348000          CALL "MESSAGE" USING MSG-FN
348100                               MSG-PORT
348200                               MSG-SND
348300                               MSG-LEN-X
348400                               MSG-RET-X
348500     ELSE IF PF-KEY = "04" THEN
348600          MOVE "XW" TO MSG-FN
348700          CALL "MESSAGE" USING MSG-FN
348800                               MSG-PORT
348900                               MSG-SND
349000                               MSG-LEN-X
349100                               MSG-RET-X
349200     ELSE IF PF-KEY = "05" THEN
349300          MOVE "CH" TO MSG-FN
349400          MOVE "W" TO MSG-TYPE
349500          MOVE MSG-TIME TO MSG-TIME-X-0
349600          CALL "MESSAGE" USING MSG-FN
349700                               MSG-PORT
349800                               MSG-TYPE
349900                               MSG-TIME-X
350000                               MSG-RCV
350100                               MSG-LEN-X2
350200                               MSG-DUMMY
350300                               MSG-RET-X
350400     ELSE IF PF-KEY = "06" THEN
350500          MOVE "CH" TO MSG-FN
350600          MOVE "T" TO MSG-TYPE
350700          MOVE MSG-TIME TO MSG-TIME-X-0
350800          CALL "MESSAGE" USING MSG-FN
350900                               MSG-PORT
351000                               MSG-TYPE
351100                               MSG-TIME-X
351200                               MSG-RCV
351300                               MSG-LEN-X2
351400                               MSG-DUMMY
351500                               MSG-RET-X
351600     ELSE IF PF-KEY = "07" THEN
351700          perform MESSAGE-UNLOCK-SCREEN
351800          MOVE "CH" TO MSG-FN
351900          MOVE "K" TO MSG-TYPE
352000          MOVE MSG-TIME TO MSG-TIME-X-0
352100          CALL "MESSAGE" USING MSG-FN
352200                               MSG-PORT
352300                               MSG-TYPE
352400                               MSG-TIME-X
352500                               MSG-RCV
352600                               MSG-LEN-X2
352700                               MSG-DUMMY
352800                               MSG-RET-X
352900          perform MESSAGE-READ-SCREEN
353000     ELSE IF PF-KEY = "08" THEN
353100          perform MESSAGE-UNLOCK-SCREEN
353200          MOVE "CH" TO MSG-FN
353300          MOVE "B" TO MSG-TYPE
353400          MOVE MSG-TIME TO MSG-TIME-X-0
353500          CALL "MESSAGE" USING MSG-FN
353600                               MSG-PORT
353700                               MSG-TYPE
353800                               MSG-TIME-X
353900                               MSG-RCV
354000                               MSG-LEN-X2
354100                               MSG-DUMMY
354200                               MSG-RET-X
354300          perform MESSAGE-READ-SCREEN.
354400
354500     MOVE MSG-RET-X-0 TO MSG-RET.
354600     IF PF-KEY NOT = "16" THEN
354700          GO TO MESSAGE-CALL.
354800
354900 MESSAGE-UNLOCK-SCREEN.
355000     move message-unlock-oa to oa-messagecrt.
355100     move HEX-80 to MSG-FAC-01, MSG-FAC-02, MSG-FAC-03.
355200     move messagecrt to crtrec.
355300     REWRITE crtrec.
355400
355500 MESSAGE-READ-SCREEN.
355600*    Lock the keyboard first
355700     move message-lock-oa to crt-oa-only-rec.
355800     REWRITE crt-oa-only-rec.
355900     read crt into messagecrt.
356000
356100******************************************************************
356200
