      /*****************************************************************
      *                                                                *
      *                       IDENTIFICATION DIVISION                  *
      *                                                                *
      ******************************************************************
      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           QASCREEN.
       AUTHOR.
           Greg Lindholm.
       DATE-WRITTEN.
           12/07/89.
      /*****************************************************************
      *                                                                *
      *                         ENVIRONMENT DIVISION                   *
      *                                                                *
      ******************************************************************
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
           WANG-VS.
       OBJECT-COMPUTER.
           WANG-VS.
       FIGURATIVE-CONSTANTS.
           A-0-BYTE IS "00"
           A-1-BYTE IS "01"
           A-160-BYTE IS "A0"
           HEXFF IS "FF"
           HEX-00 IS "00"
           HEX-01 IS "01"
           HEX-02 IS "02"
           HEX-0A IS "0A"
           HEX-0B IS "0B"
           HEX-10 IS "10"
           HEX-28 IS "28"
           HEX-80 IS "80"
           HEX-84 IS "84"
           HEX-88 IS "88"
           HEX-8C IS "8C"
           HEX-90 IS "90"
           HEX-94 IS "94"
           HEX-98 IS "98"
           HEX-9C IS "9C"
           HEX-A0 IS "A0"
           HEX-A4 IS "A4"
           HEX-A8 IS "A8"
           HEX-AC IS "AC"
           HEX-B0 IS "B0"
           HEX-B4 IS "B4"
           HEX-B8 IS "B8"
           HEX-BC IS "BC"
           WSXIO-READ IS "40"
           WSXIO-WRITE IS "80"
           BLINK-BIT IS "10"
           PROTECT-BIT IS "04"
           DIM-BIT IS "08"
           TAB-STOP IS "86"
           BLINKING-DISPLAY IS "94"
           BRITE IS "84"
           BRITE-MOD-ALL IS "80"
           DIM-PROT-ALL IS "8C"
           NO-ECHO IS "98"
           SUB-1 IS "01"
           SUB-2 IS "02"
           SUB-3 IS "03"
           SUB-4 IS "04"
           SUB-5 IS "05"
           SUB-6 IS "06"
           SUB-7 IS "07"
           SUB-8 IS "08"
           SUB-9 IS "09"
           SUB-10 IS "0A"
           SUB-11 IS "0B"
           SUB-12 IS "0C"
           SUB-13 IS "0D"
           SUB-14 IS "0E"
           SUB-15 IS "0F"
           SUB-16 IS "10"
           SUB-17 IS "11"
           SUB-18 IS "12"
           SUB-19 IS "13"
           SUB-20 IS "14"
           SUB-21 IS "15"
           SUB-22 IS "16"
           SUB-23 IS "17"
           SUB-24 IS "18"
           SUB-25 IS "19"
           SUB-26 IS "1A"
           SUB-27 IS "1B"
           SUB-28 IS "1C"
           SUB-29 IS "1D"
           SUB-30 IS "1E"
           SUB-31 IS "1F"
           SUB-96 IS "60"
           MENU-PICK IS "8E".

      /*****************************************************************
      *                                                                *
      *                         INPUT-OUTPUT SECTION                   *
      *                                                                *
      ******************************************************************
      *
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *
           SELECT CRT
               ASSIGN TO "CRT",      "DISPLAY",
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS RANDOM
               RELATIVE KEY    IS LINENUM
               PFKEY           IS PF-KEY
               CURSOR POSITION IS CURSOR-POS
               FILE STATUS     IS FILSTAT.

           SELECT CRT-ROW
               ASSIGN TO "CRTROW",    "DISPLAY",
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS RANDOM
               RELATIVE KEY    IS LINENUM
               PFKEY           IS PF-KEY
               CURSOR POSITION IS CURSOR-POS
               FILE STATUS     IS FILSTAT.

           SELECT CRT-OA
               ASSIGN TO "CRTOA",    "DISPLAY",
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS RANDOM
               FILE STATUS     IS FILSTAT.


      /*****************************************************************
      *                                                                *
      *                      DATA DIVISION - FILE SECTION              *
      *                                                                *
      ******************************************************************
      *
       DATA DIVISION.
       FILE SECTION.
      *
       FD  CRT
           LABEL RECORDS ARE OMITTED.
       01  CRTREC.
           03  CRTREC-OA                    PIC X(4).
           03  CRTREC-MAPPING-AREA          PIC X(1920).

       FD  CRT-ROW
           LABEL RECORDS ARE OMITTED.
       01  CRT-ROW-REC.
           03  CRT-ROW-REC-OA.
               05  CRT-ROW-OA-1             PIC X.
               05  CRT-ROW-OA-2             PIC X.
               05  CRT-ROW-OA-3             PIC X.
               05  CRT-ROW-OA-4             PIC X.
           03  CRT-ROW-REC-MAP.
               05  FILLER                   PIC X(80).
           03  CRT-ROW-REC-MAP-X REDEFINES CRT-ROW-REC-MAP.
               05  CRT-ROW-X OCCURS 80 TIMES PIC X.

       FD  CRT-OA
           LABEL RECORDS ARE OMITTED.
       01  CRT-OA-REC.
               05  CRT-OA-1             PIC X.
               05  CRT-OA-2             PIC X.
               05  CRT-OA-3             PIC X.
               05  CRT-OA-4             PIC X.

      *
      /*****************************************************************
      *                                                                *
      *                         WORKING STORAGE                        *
      *                                                                *
      ******************************************************************
      *
       WORKING-STORAGE SECTION.

       01  FILSTAT.
           03  ERR-FLAG                   PIC X(01).
           03  PFK-BYTE                   PIC X(01).

       77  LINENUM                        PIC 9(02) VALUE 1.
       77  PF-KEY                         PIC X(02) VALUE ZERO.

       01  CURSOR-POS.
           03  MOD-COL                    BINARY.
           03  MOD-ROW                    BINARY.

      ******************************************************************

       01  REDEF-CURS-POS                 REDEFINES CURSOR-POS.
           03  FILLER                     PIC X(01).
           03  CURS-COL                   PIC X(01).
           03  FILLER                     PIC X(01).
           03  CURS-ROW                   PIC X(01).

       01  MY-INDEX                       PIC 9(5).
       01  INDEX-D1                       PIC 9(5).
       01  INDEX-D2                       PIC 9(5).
       01  INDEX-D3                       PIC 9(5).
       01  THE-PASS                       PIC X(6).
       01  THE-BLPRO                      PIC X(7)  VALUE "no disp".
       01  PRINT-FLAG                     PIC X(27) VALUE SPACES.
       01  PRINT-STATUS                   PIC X(1)  VALUE "C".
       01  PRINT-UFB-ADD                  PIC X(2)  VALUE SPACES.
       01  PRINT-FUNC                     PIC X(1)  VALUE "P".
       01  PRINT-RECVR                    PIC X(22) VALUE SPACES.
       01  ACCEPT-FIELD                   PIC X(6).
       01  START-VAL                      PIC X(4) VALUE "0000".

       01  SCREEN-OCC-1.
           03  FILLER OCCURS 3 TIMES.

               10  FILLER OCCURS 1 TIMES.
                   15  ACCOUNT-FIELD       PIC X(25).
                   15  ACCOUNT-DESC-FIELD  PIC X(30).
                   15  DIST-PCT-FIELD      PIC 999.99-.
                   15  AMOUNT-FIELD        PIC 99999.99.

               10  FILLER OCCURS 1 TIMES.

                   15  SRC-TAG-FIELD       PIC X(7).
                   15  SOURCE-FIELD        PIC X(10).
                   15  PROJ-TAG-FIELD      PIC X(8).
                   15  PROJECT-FIELD       PIC X(10).
                   15  PROJ-DESC-FIELD     PIC X(30).

       01  REWRITE-TEST.
           03  FILLER               PIC X(740) VALUE SPACES.
           03  FILLER               PIC X      VALUE BRITE.
           03  FILLER               PIC X(50)  VALUE
           "THIS IS A TEST OF REWRITE (PAUSE 3 SECONDS)".

       01  PAUSE-TIME.
           03  PAUSE-TIME-1  BINARY.
           03  PAUSE-TIME-2  BINARY.


       01  CRTREC2.
           05  CRTREC2-FULL         PIC X(1924) VALUE SPACES.
           05  FILLER REDEFINES CRTREC2-FULL.
               10  CRTREC2-OA.
                   15  CRTREC2-OA-1   PIC X.
                   15  CRTREC2-OA-2   PIC X.
                   15  CRTREC2-OA-3   PIC X.
                   15  CRTREC2-OA-4   PIC X.
               10  CRTREC2-24-ROWS.
                   15  CRTREC2-ROW  OCCURS 24 TIMES.
                       20 CRTREC2-X OCCURS 80 TIMES PIC X.


      /*****************************************************************
      *                                                                *
      *                   DISPLAY DEFINITIONS                          *
      *                                                                *
      ******************************************************************
      *

       01  FLOAT-KEY PIC 99 VALUE 4.

       01  YES-NO    PIC XXX VALUE "YES".
       01  T1.
           03  ENTRIES.
               05  FILLER PIC XXX VALUE "YES".
               05  FILLER PIC XXX VALUE "NO ".
           03  FILLER REDEFINES ENTRIES.
               05  YN-TABLE OCCURS 2 TIMES PIC XXX.

       01  FILLER.
           03  NUM-ANS-EXPANDED.
               05  FILLER PIC X(5) VALUE "ONE".
               05  FILLER PIC X(5) VALUE "TWO".
               05  FILLER PIC X(5) VALUE "THREE".
           03  FILLER REDEFINES NUM-ANS-EXPANDED.
               05  NUM-ANS   PIC X(5) OCCURS 3 TIMES.

       01  T2.
           03  ENTRIES.
               05  FILLER PIC X(5) VALUE "ONE".
               05  FILLER PIC X(5) VALUE "TWO".
               05  FILLER PIC X(5) VALUE "THREE".
               05  FILLER PIC X(5) VALUE "FOUR".
               05  FILLER PIC X(5) VALUE "FIVE".
               05  FILLER PIC X(5) VALUE "SIX".
               05  FILLER PIC X(5) VALUE "SEVEN".
               05  FILLER PIC X(5) VALUE "EIGHT".
               05  FILLER PIC X(5) VALUE "NINE".
               05  FILLER PIC X(5) VALUE "TEN".
           03  FILLER REDEFINES ENTRIES.
               05  NUM-TABLE OCCURS 10 TIMES PIC X(5).

       01  FILLER.
           05  t3-x.
               10 filler pic s9(4)v99 value 0.
               10 filler pic s9(4)v99 value 0.
               10 filler pic s9(4)v99 value 0.
               10 filler pic s9(4)v99 value 0.
               10 filler pic s9(4)v99 value 0.
           05  t3 redefines t3-x pic s9(4)v99 occurs 5 times.


       01  FILLER.
           03  FILLER                      OCCURS 3 TIMES.
               05  FILLER                  OCCURS 2 TIMES.
                   07  MATRIX-DATE-SOURCE  OCCURS 8 TIMES
                       PIC X(7) VALUE SPACES.

               05  FILLER                  OCCURS 4 TIMES.
                   07  MATRIX-GROUP-SOURCE OCCURS 7 TIMES
                       PIC X(7) VALUE SPACES.

       01  MATRIX-ITEM.
           05  FILLER     PIC X VALUE "(".
           05  MATRIX-D1  PIC 9 VALUE ZERO.
           05  FILLER     PIC X VALUE "-".
           05  MATRIX-D2  PIC 9 VALUE ZERO.
           05  FILLER     PIC X VALUE "-".
           05  MATRIX-D3  PIC 9 VALUE ZERO.
           05  FILLER     PIC X VALUE ")".

       01  MATRIX-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER PIC X(18) ROW 1 COL 40 VALUE
               "MATRIX TEST SCREEN".
           03  FILLER                      OCCURS 3 TIMES.
               05  FILLER                  OCCURS 2 TIMES.
                   07  MATRIX-DATE         OCCURS 8 TIMES
                       PIC X(7)  LINE 3 COLUMN 02
                       SOURCE MATRIX-DATE-SOURCE.

               05  FILLER                  OCCURS 4 TIMES.
                   07  MATRIX-GROUP         OCCURS 7 TIMES
                       PIC X(7)  LINE 5 COL 04
                       SOURCE MATRIX-GROUP-SOURCE
                       OBJECT MATRIX-GROUP-SOURCE.

           03  MATRIX-LINE-24 PIC X(38) LINE 24 COL 02 VALUE
               "Press (ENTER) to continue.".
                                                        
       01  SYNC-SCREEN1 USAGE IS DISPLAY-WS.
           03  FILLER PIC X(24) ROW 3 COL 28 VALUE
           "*** TEST WISPSYNC ***".
           03  FILLER PIC X(60) ROW 8 COL 10 VALUE
           "This is a test to see if WISPSYNC will really cause the".
           03  FILLER PIC X(60) ROW 9 COL 10 VALUE
           "screen to cleanup (SYNC) after an external routine is".
           03  FILLER PIC X(60) ROW 10 COL 10 VALUE
           "called that changes the contents of the screen.".
           03  FILLER PIC X(40) ROW 24 COL 27 VALUE
           "PRESS (ENTER) TO CONTINUE.".

       01  SYNC-SCREEN2 USAGE IS DISPLAY-WS.
           03  FILLER PIC X(40) ROW 13 COL 20 VALUE
           "The screen should be messed up.".
           03  FILLER PIC X(40) ROW 24 COL 27 VALUE
           "PRESS (ENTER) TO CONTINUE.".

       01  SYNC-SCREEN3 USAGE IS DISPLAY-WS.
           03  FILLER PIC X(25) ROW 8 COL 30 VALUE
           "  DID WISPSYNC WORK ?  ".
           03  FILLER PIC X(40) ROW 24 COL 27 VALUE
           "PRESS (ENTER) TO CONTINUE.".

       01  KEYBOARD-TEST-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER PIC X(40) ROW 2 COL 20
               VALUE "PRESS A PFKEY, (ENTER) TO QUIT".

           03  FILLER PIC X(18) ROW 12 COL 10
               VALUE "YOU PRESSED PF KEY".

           03  FILLER PIC X(2) ROW 12 COL 30
               SOURCE PF-KEY.

       01  MISC-SCREEN USAGE IS DISPLAY-WS.

           03  FILLER PIC X(23)     ROW 1 COL 29  VALUE
               "* * * MISC-SCREEN * * *".

           03  FILLER PIC X(9)                   ROW  3 COL 1
               VALUE      "PIC 9(5)".
           03  MISC-ROW03  PIC 9(5)              ROW  3 COL 36
               SOURCE XMISC-PIC9-5
               OBJECT XMISC-PIC9-5.

           03  FILLER PIC X(9)                   ROW  4 COL 1
               VALUE      "PIC Z(5)".
           03  MISC-ROW04  PIC Z(5)              ROW  4 COL 36
               SOURCE XMISC-PICZ-5
               OBJECT XMISC-PICZ-5.

           03  FILLER PIC X(9)                   ROW  5 COL 1
               VALUE      "PIC -(6)".
           03  MISC-ROW05  PIC -(6)              ROW  5 COL 35
               SOURCE XMISC-PICS--6
               OBJECT XMISC-PICS--6.

           03  FILLER PIC X(12)                  ROW  6 COL 1
               VALUE        "PIC ----.--".
           03  MISC-ROW06    PIC ----.--         ROW  6 COL 37
               SOURCE XMISC-PICS9-3V2
               OBJECT XMISC-PICS9-3V2.

           03  FILLER PIC X(14)                  ROW  7 COL 1
               VALUE         "PIC 99,999.99+".
           03  MISC-ROW07     PIC 99,999.99+     ROW  7 COL 35
               SOURCE XMISC-PICS9-5V2
               OBJECT XMISC-PICS9-5V2.

           03  FILLER PIC X(20)                  ROW  8 COL 1
               VALUE          "PIC $ZZ,ZZZ.ZZB-".
           03  MISC-ROW08      PIC $ZZ,ZZZ.ZZB-  ROW  8 COL 34
               SOURCE XMISC-PICSZ-5V2
               OBJECT XMISC-PICSZ-5V2.

           03  FILLER PIC X(9)                   ROW 9 COL 1
               VALUE           "PIC +Z(9)".
           03  MISC-ROW09       PIC +Z(9)        ROW 9 COL 31
               SOURCE XMISC-PICZ9
               OBJECT XMISC-PICZ9.

           03  FILLER PIC X(20)                  ROW 10 COL 1
               VALUE           "PIC $B*(9)BCR".
           03  MISC-ROW10       PIC $B*(9)BCR    ROW 10 COL 30
               SOURCE XMISC-PIC9Z
               OBJECT XMISC-PIC9Z.

           03  FILLER PIC X(20)                  ROW 11 COL 1
               VALUE       "PIC $$,$$$B.B$$BDB".
           03  MISC-ROW11   PIC $$,$$$B.B$$BDB   ROW 11 COL 35
               SOURCE XMISC-PICS9-4V2
               OBJECT XMISC-PICS9-4V2.

           03  FILLER PIC X(17)                  ROW 12 COL 1
               VALUE      "PIC +++,+++.99/99".
           03  MISC-ROW12  PIC +++,+++.99/99     ROW 12 COL 34
               SOURCE XMISC-PICS9-5V4
               OBJECT XMISC-PICS9-5V4.

           03  FILLER PIC X(20)                  ROW 13 COL 1
               VALUE         "PIC -$B**,***.**".
           03  MISC-ROW13     PIC -$B**,***.**   ROW 13 COL 32
               SOURCE XMISC-PICS232
               OBJECT XMISC-PICS232.

           03  FILLER PIC X(15)                  ROW 14 COL 1
               VALUE          "PIC ZZZBZZBZZZZ".
           03  MISC-ROW14      PIC ZZZBZZBZZZZ   ROW 14 COL 30
               SOURCE XMISC-PIC9
               OBJECT XMISC-PIC9.

           03  FILLER PIC X(15)                  ROW 15 COL 1
               VALUE           "PIC ZZZ/ZZ/ZZZZ".
           03  MISC-ROW15       PIC ZZZ/ZZ/ZZZZ  ROW 15 COL 30
               SOURCE XMISC-PICE9
               OBJECT XMISC-PICE9.

           03  FILLER PIC X(20)                  ROW 16 COL 1
               VALUE       "PIC ZZZZ,ZZZ,ZZZ,ZZZ".
           03  MISC-ROW16   PIC ZZZZ,ZZZ,ZZZ,ZZZ ROW 16 COL 25
               SOURCE XMISC-PICZ13
               OBJECT XMISC-PICZ13.

           03  FILLER PIC X(10)                  ROW 17 COL 1
               VALUE     "PIC A(10)".
           03  MISC-ROW17 PIC A(10)              ROW 17 COL 25
               SOURCE XMISC-PICA10
               OBJECT XMISC-PICA10.

           03  FILLER PIC X(12)                  ROW 18 COL 1
               VALUE     "PIC AABAABAA".
           03  MISC-ROW18 PIC AABAABAA           ROW 18 COL 25
               SOURCE XMISC-PICAB8
               OBJECT XMISC-PICAB8-X.

           03  FILLER PIC X(05)                  ROW 18 COL 40
               VALUE     "---->".
           03  FILLER     PIC X(8)               ROW 18 COL 50
               SOURCE XMISC-PICAB8-X.

           03  FILLER PIC X(11)                  ROW 19 COL 1
               VALUE     "PIC A9AB9A9".
           03  MISC-ROW19 PIC A9AB9A9            ROW 19 COL 25
               SOURCE XMISC-PICA9B7
               OBJECT XMISC-PICA9B7-X.

           03  FILLER PIC X(05)                  ROW 19 COL 40
               VALUE     "---->".
           03  FILLER     PIC X(8)               ROW 19 COL 50
               SOURCE XMISC-PICA9B7-X.

           03  FILLER PIC X(12)                  ROW 20 COL 1
               VALUE     "PIC AA/XX/99".
           03  MISC-ROW20 PIC AA/XX/99           ROW 20 COL 25
               SOURCE XMISC-PICAX8
               OBJECT XMISC-PICAX8-X.

           03  FILLER PIC X(05)                  ROW 20 COL 40
               VALUE     "---->".
           03  FILLER     PIC X(8)               ROW 20 COL 50
               SOURCE XMISC-PICAX8-X.

           03  FILLER PIC X(12)                  ROW 21 COL 1
               VALUE     "PIC XXB00BXX".
           03  MISC-ROW21 PIC XXB00BXX           ROW 21 COL 25
               SOURCE XMISC-PICXB8
               OBJECT XMISC-PICXB8-X.

           03  FILLER PIC X(05)                  ROW 21 COL 40
               VALUE     "---->".
           03  FILLER     PIC X(8)               ROW 21 COL 50
               SOURCE XMISC-PICXB8-X.

           03  FILLER PIC X(14)                 ROW 22 COL 1
               VALUE     "PIC Z(3) 1-199".
           03  MISC-ROW22 PIC Z(3)              ROW 22 COL 25
               RANGE 1 TO 199
               SOURCE XMISC-PICZ3
               OBJECT XMISC-PICZ3.

           03  FILLER PIC X(20)                 ROW 23 COL 1 
               VALUE "PIC X(50) (UPLOW):".
           03  MISC-ROW23 PIC X(50)             ROW 23 COL 25
               SOURCE XMISC-UPLOW OBJECT XMISC-UPLOW.

123456*8901234567890123456789012345678901234567890123456789012345678901234567890

           03  FILLER PIC X(50)
                      ROW 24 COL 20
                      VALUE "PRESS (ENTER) TO CONTINUE, (16) EXIT".

       01  XMISC-PIC9-5         PIC 9(5)      VALUE 0.
       01  XMISC-PICZ-5         PIC 9(5)      VALUE 0.
       01  XMISC-PICS--6        PIC S9(5)     VALUE 0.
       01  XMISC-PICS9-3V2      PIC S999V99   VALUE 0.
       01  XMISC-PICS9-5V2      PIC S99999V99 VALUE 0.
       01  XMISC-PICSZ-5V2      PIC S99999V99 VALUE 0.
       01  XMISC-PICZ9          PIC S9(9)     VALUE 0.
       01  XMISC-PIC9Z          PIC S9(9)     VALUE 0.
       01  XMISC-PICS9-4V2      PIC S9999V99  VALUE 0.
       01  XMISC-PICS9-5V4      PIC S9(5)V9(4)  VALUE 0.
       01  XMISC-PICS232        PIC S99999V99   VALUE 0.
       01  XMISC-PIC9           PIC  9(9)       VALUE 0.
       01  XMISC-PICE9          PIC  9(9)       VALUE 0.
       01  XMISC-PICZ13         PIC S9(13) COMP VALUE 0.
       01  XMISC-PICA10         PIC X(10) VALUE SPACES.
       01  XMISC-PICAB8         PIC X(8)  VALUE SPACES.
       01  XMISC-PICAB8-X       PIC X(8)  VALUE SPACES.
       01  XMISC-PICA9B7        PIC X(7)  VALUE SPACES.
       01  XMISC-PICA9B7-X      PIC X(7)  VALUE SPACES.
       01  XMISC-PICAX8         PIC X(8)  VALUE SPACES.
       01  XMISC-PICAX8-X       PIC X(8)  VALUE SPACES.
       01  XMISC-PICXB8         PIC X(8)  VALUE SPACES.
       01  XMISC-PICXB8-X       PIC X(8)  VALUE SPACES.
       01  XMISC-PICZ3          PIC  999  VALUE 0.
       01  XMISC-UPLOW          PIC X(50) VALUE
           "This is a TEST of UPlow.".


       01  SCREEN-1 USAGE IS DISPLAY-WS.
           03  FILLER PIC X(29) 
                      ROW 1 COL 25
                      VALUE "Screen 1 in program SAMPLE. ".

           03  FILLER PIC X(158) ROW 2 COL 1 VALUE
               "This screen contains some modifiable text fields and som
      -    "e modifiable numeric fields. All of the fields are part of a
      -    " grouped screen item which OCCURS 6 times.".

           03  FILLER PIC X(48) ROW 5 COL 2 VALUE
               "IT IS INTERRUPTED BY A DISPLAY VERB AFTER ENTRY.".

           03  QUOTE-TEST PIC X(50) ROW 7 COL 2 VALUE
               """This is a test of QUOTE <""> inside a literal.""". 

           03  FILLER PIC X(21) ROW 9 COL 14
               VALUE "THIS ITEM IS NO-ECHO.".
           03  PASSWORD-ITEM PIC X(6) ROW 9 COL 37 SOURCE THE-PASS
               OBJECT THE-PASS.

           03  FILLER OCCURS 3 TIMES.

               10  FILLER OCCURS 1 TIMES.
                   15  SRC-TAG-ITEM-4      PIC X(07)  ROW 11 COLUMN 08
                       SOURCE SRC-TAG-FIELD.
                   15  SOURCE-ITEM-4       PIC X(10)  ROW 11 COLUMN 16
                       SOURCE SOURCE-FIELD
                       OBJECT SOURCE-FIELD.
                   15  PROJ-TAG-ITEM-4     PIC X(08)  ROW 11 COLUMN 29
                       SOURCE PROJ-TAG-FIELD.
                   15  PROJECT-ITEM-4      PIC X(10)  ROW 11 COLUMN 38
                       SOURCE PROJECT-FIELD
                       OBJECT PROJECT-FIELD.
                   15  PROJ-DESC-ITEM-4    PIC X(30)  ROW 11 COLUMN 49
                       SOURCE PROJ-DESC-FIELD.

               10  FILLER OCCURS 1 TIMES.
                   15  ACCOUNT-ITEM-4      PIC X(25)  ROW 12 COLUMN 03
                       SOURCE ACCOUNT-FIELD.
                   15  ACCOUNT-DESC-ITEM-4 PIC X(30)  ROW 12 COLUMN 29
                       SOURCE ACCOUNT-DESC-FIELD
                       OBJECT ACCOUNT-DESC-FIELD.
                   15  DIST-PCT-ITEM-4  PIC Z(2)9.99- ROW 12 COLUMN 60
                       SOURCE DIST-PCT-FIELD
                       OBJECT DIST-PCT-FIELD.
                   15  AMOUNT-ITEM-4     PIC 9(9).99- ROW 12 COLUMN 68
                       SOURCE AMOUNT-FIELD
                       OBJECT AMOUNT-FIELD.

           03  FILLER PIC X(18) ROW 18 COL 5 VALUE "RANGE (YES ,NO)".
           03  FILLER PIC X(3)  ROW 18 COL 25 
               SOURCE IS YES-NO OBJECT IS YES-NO
      *$RANGE_COUNT 2
               RANGE IS YN-TABLE.

           03  FILLER PIC X(18) ROW 18 COL 30 VALUE "RANGE (ONE-TEN)".
           03  FILLER PIC X(5)  ROW 18 COL 50 OCCURS 3 TIMES
               SOURCE IS NUM-ANS OBJECT IS NUM-ANS
      *$RANGE_COUNT 10
               RANGE IS NUM-TABLE.

	   03  FILLER PIC X(17) ROW 20 COL 5 VALUE "RANGE (-99 - 175)".
           03  FILLER PIC Z(4).ZZ- OCCURS 5 TIMES ROW 20 COLUMN 25
               RANGE -99 to 175 SOURCE t3 OBJECT t3.

           03  FILLER PIC X(19) ROW 22 COL 4
               VALUE "THIS ITEM IS BLPRO.".
           03  BLPRO-ITEM PIC X(7) ROW 22 COL 25
                 SOURCE THE-BLPRO.

           03  PFKEY-ITEM PIC X(27) ROW 22 COL 35
               SOURCE PRINT-FLAG.

           03  FILLER PIC X(40)
                      ROW 24 COL 27
                      VALUE "PRESS (ENTER) TO CONTINUE.".

       01  EMBED-SCREEN USAGE IS DISPLAY-WS.
           03  EMBEDDED-ITEM PIC X(60) ROW 12 COL 10
                 SOURCE EMBED-STRUCT OBJECT EMBED-STRUCT.

       01  EMBED-STRUCT.
           03  FILLER PIC X VALUE HEX-8C.
           03  FILLER PIC X(17) VALUE "Embedded FAC test".
           03  FILLER PIC X VALUE HEX-80.
           03  EMBED-VALUE PIC X(5) VALUE "+++++".
           03  FILLER PIC X VALUE HEX-8C.
           03  FILLER PIC X(35) VALUE "<<< 80 Brite-Mod-ALL".

       01  SCREEN-SUBT USAGE IS DISPLAY-WS.
           03  FILLER PIC X(23) 
                      ROW 1 COL 20
                      VALUE "Test Substitution Table".

           03  FILLER PIC X(156) ROW 3 COL 1 VALUE
               "This screen contains some characters with values in the
      -    "non-printable range.    The substitution table will be used
      -    "to display a graphics/default character.".

           03  FILLER PIC X(44)
                      ROW 6 COL 1 VALUE
               "Display the default substitution characters:".

           03  FILLER PIC X(79)
                      ROW 9 COL 1 VALUE
               "  1   2   3   4   5   6   7   8   9  10  11  12  13  14
      -    " 15  16  17  18  19  20".
   
           03  TEST-ITEM-1 PIC X(79) ROW 10 COLUMN 1
               SOURCE SUB-LINE-1.

           03  FILLER PIC X(47)
                      ROW 12 COL 1 VALUE
               " 21  22  23  24  25  26  27  28  29  30  31  96".
   
           03  TEST-ITEM-2 PIC X(47) ROW 13 COLUMN 1
               SOURCE SUB-LINE-2.

           03  TEST-ITEM-3 PIC X(7) ROW 16 COLUMN 20
               SOURCE SUB-LINE-3.
           03  TEST-ITEM-4 PIC X(7) ROW 17 COLUMN 20
               SOURCE SUB-LINE-4.
           03  TEST-ITEM-5 PIC X(7) ROW 18 COLUMN 20
               SOURCE SUB-LINE-5.
           03  TEST-ITEM-6 PIC X(7) ROW 19 COLUMN 20
               SOURCE SUB-LINE-4.
           03  TEST-ITEM-7 PIC X(7) ROW 20 COLUMN 20
               SOURCE SUB-LINE-6.

           03  FILLER PIC X(40)
                      ROW 24 COL 27
                      VALUE "PRESS (ENTER) TO CONTINUE.".

       01  SCREEN-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 20 VALUE
               "TRY THINGS:".
           03  FILLER  PIC X(13) ROW 1 COL 60 VALUE
               "SCREEN-SCREEN".
           03  FILLER  PIC X(35) ROW  3 COL 02 VALUE
               " (1) DISPLAY A COMPLEX SCREEN.".
           03  FILLER  PIC X(35) ROW  4 COL 02 VALUE
               " (2) TRY THE PF KEYS.".
           03  FILLER  PIC X(35) ROW  5 COL 02 VALUE
               " (3) PIC ZZ AND MISC.".
           03  FILLER  PIC X(35) ROW  6 COL 02 VALUE
               " (4) ".
           03  FILLER  PIC X(35) ROW  7 COL 02 VALUE
               " (5) ".
           03  FILLER  PIC X(35) ROW  8 COL 02 VALUE
               " (6) TEST REWRITE TO CRT.".
           03  FILLER  PIC X(35) ROW  9 COL 02 VALUE
               " (7) ".
           03  FILLER  PIC X(37) ROW 10 COL 02 VALUE
               " (8) TEST COMPLX MUTIPLE DIMENSIONS.".
           03  FILLER  PIC X(35) ROW 11 COL 02 VALUE
               " (9) ".
           03  FILLER  PIC X(35) ROW 12 COL 02 VALUE
               "(10) TEST SUBSTITUTION TABLE.".
           03  FILLER  PIC X(35) ROW 13 COL 02 VALUE
               "(11) TEST MONKEY BAR MENU.".
           03  FILLER  PIC X(35) ROW 14 COL 02 VALUE
               "(12) COLUMN TEST.".
           03  FILLER  PIC X(35) ROW 15 COL 02 VALUE
               "(13) DISPLAY AND READ TOTAL TEST.".
           03  FILLER  PIC X(35) ROW 16 COL 02 VALUE
               "(14) TEST VWANG 132/80 COLUMN MODE.".
           03  FILLER  PIC X(35) ROW 17 COL 02 VALUE
               "(15) REWRITE & READ OF CRT.".
           03  FILLER  PIC X(35) ROW 19 COL 02 VALUE
               "(16) EXIT".
           03  FILLER  PIC X(35) ROW  3 COL 40 VALUE
               "(17) ROW REWRITE & READ".
           03  FILLER  PIC X(35) ROW  4 COL 40 VALUE
               "(18) MULTIPLE COLUMNS".
           03  FILLER  PIC X(35) ROW  5 COL 40 VALUE
               "(19) EMBEDDED FAC TEST".
           03  FILLER  PIC X(35) ROW  6 COL 40 VALUE
               "(20) ALL FACs TEST".
           03  FILLER  PIC X(35) ROW  7 COL 40 VALUE
               "(21) ".
           03  FILLER  PIC X(35) ROW  8 COL 40 VALUE
               "(22) ".
           03  FILLER  PIC X(35) ROW  9 COL 40 VALUE
               "(23) ".
           03  FILLER  PIC X(35) ROW 10 COL 40 VALUE
               "(24) ".
           03  FILLER  PIC X(35) ROW 11 COL 40 VALUE
               "(25) ".
           03  FILLER  PIC X(35) ROW 12 COL 40 VALUE
               "(26) ".
           03  FILLER  PIC X(35) ROW 13 COL 40 VALUE
               "(27) ".
           03  FILLER  PIC X(35) ROW 14 COL 40 VALUE
               "(28) ".
           03  FILLER  PIC X(35) ROW 15 COL 40 VALUE
               "(29) ".
           03  FILLER  PIC X(35) ROW 16 COL 40 VALUE
               "(30) ".
           03  FILLER  PIC X(35) ROW 17 COL 40 VALUE
               "(31) ".
           03  FILLER  PIC X(23) ROW 24 COL 20 VALUE
               "PRESS (16) TO EXIT".

       01  SUB-LINE-1.
           03  FILLER    PIC X(2) VALUE SPACES.
           03  SUB-COL1  PIC X    VALUE SUB-1.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL2  PIC X VALUE SUB-2.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL3  PIC X VALUE SUB-3.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL4  PIC X VALUE SUB-4.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL5  PIC X VALUE SUB-5.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL6  PIC X VALUE SUB-6.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL7  PIC X VALUE SUB-7.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL8  PIC X VALUE SUB-8.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL9  PIC X VALUE SUB-9.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL10 PIC X VALUE SUB-10.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL11 PIC X VALUE SUB-11.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL12 PIC X VALUE SUB-12.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL13 PIC X VALUE SUB-13.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL14 PIC X VALUE SUB-14.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL15 PIC X VALUE SUB-15.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL16 PIC X VALUE SUB-16.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL17 PIC X VALUE SUB-17.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL18 PIC X VALUE SUB-18.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL19 PIC X VALUE SUB-19.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL20 PIC X VALUE SUB-20.

       01  SUB-LINE-2.
           03  FILLER    PIC X(2) VALUE SPACES.
           03  SUB-COL21 PIC X VALUE SUB-21.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL22 PIC X VALUE SUB-22.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL23 PIC X VALUE SUB-23.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL24 PIC X VALUE SUB-24.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL25 PIC X VALUE SUB-25.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL26 PIC X VALUE SUB-26.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL27 PIC X VALUE SUB-27.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL28 PIC X VALUE SUB-28.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL29 PIC X VALUE SUB-29.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL30 PIC X VALUE SUB-30.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL31 PIC X VALUE SUB-31.
           03  FILLER    PIC X(3) VALUE SPACES.
           03  SUB-COL21 PIC X VALUE SUB-96.

       01  SUB-LINE-3.
           03  BT3-COL1   PIC X VALUE SUB-20.
           03  BT3-COL2   PIC X VALUE SUB-7.
           03  BT3-COL3   PIC X VALUE SUB-7.
           03  BT3-COL4   PIC X VALUE SUB-28.
           03  BT3-COL5   PIC X VALUE SUB-7.
           03  BT3-COL6   PIC X VALUE SUB-7.
           03  BT3-COL7   PIC X VALUE SUB-19.

       01  SUB-LINE-4.
           03  BT4-COL1   PIC X VALUE SUB-6.
           03  FILLER     PIC X(2) VALUE SPACES.
           03  BT4-COL4   PIC X VALUE SUB-6.
           03  FILLER     PIC X(2) VALUE SPACES.
           03  BT4-COL7   PIC X VALUE SUB-6.

       01  SUB-LINE-5.
           03  BT-COL1   PIC X VALUE SUB-24.
           03  BT-COL2   PIC X VALUE SUB-7.
           03  BT-COL3   PIC X VALUE SUB-7 .
           03  BT-COL4   PIC X VALUE SUB-14.
           03  BT-COL5   PIC X VALUE SUB-7.
           03  BT-COL6   PIC X VALUE SUB-7.
           03  BT-COL7   PIC X VALUE SUB-25.

       01  SUB-LINE-6.
           03  BT-COL1   PIC X VALUE SUB-21.
           03  BT-COL2   PIC X VALUE SUB-7.
           03  BT-COL3   PIC X VALUE SUB-7.
           03  BT-COL4   PIC X VALUE SUB-27.
           03  BT-COL5   PIC X VALUE SUB-7.
           03  BT-COL6   PIC X VALUE SUB-7.
           03  BT-COL7   PIC X VALUE SUB-18.

       01  WSXIO-COMMAND PIC X VALUE "T".
       01  WSXIO-CODE PIC X.
       01  WSXIO-IOSW-REC PIC X(8).
       01  WSXIO-TIMER.
           05  T1-VAL BINARY VALUE 0.
           05  T2-VAL BINARY VALUE 2.

       01  WSXIO-ORDER-AREA.
           03  WSXIO-O-A-1 PIC X VALUE A-1-BYTE.
           03  WSXIO-O-A-2 PIC X VALUE A-160-BYTE.
           03  WSXIO-O-A-3 PIC X VALUE A-0-BYTE.
           03  WSXIO-O-A-4 PIC X VALUE A-0-BYTE.

       01  WSXIO-OA-SAVE PIC X(4).

       01  WSXIO-O-A-LENGTH.
           05  O-A-L1 BINARY VALUE 0.
           05  O-A-L2 BINARY VALUE 4.

       01  WSXIO-SCREEN-LENGTH.
           05  S1-LEN BINARY VALUE 0.
           05  S2-LEN BINARY VALUE 1920.

       01  WSXIO-COUNTER PIC 9 VALUE 0.

       01  WSXIO-SCREEN.
           05 WSXIO-MSG PIC X(22) VALUE "THIS IS THE FIRST LINE".
           05 FILLER PIC X(218) VALUE SPACES.
           05 FILLER PIC X(18) VALUE "3 LINES OR SO DOWN".
           05 FILLER PIC X(1) VALUE BRITE-MOD-ALL.
           05 FILLER PIC X(20) VALUE SPACES.
           05 FILLER PIC X(1) VALUE DIM-PROT-ALL.
           05 FILLER PIC X(1640) VALUE SPACES.

       01  ALL-FAC-SCREEN USAGE IS DISPLAY-WS.
           05  FILLER PIC X(30)     ROW 1 COL 25  VALUE
               "  * * * ALL-FAC-SCREEN * * *".

           05  FILLER PIC X(02) ROW  4 COL  2 VALUE "80".
           05  AF-80  PIC X(30) ROW  4 COL  6 VALUE "NOLINE BRIGHT".
           05  FILLER PIC X(02) ROW  4 COL 42 VALUE "84".
           05  AF-84  PIC X(30) ROW  4 COL 46 VALUE "NOLINE BRIGHT".

           05  FILLER PIC X(02) ROW  6 COL  2 VALUE "88".
           05  AF-88  PIC X(30) ROW  6 COL  6 VALUE "NOLINE DIM".
           05  FILLER PIC X(02) ROW  6 COL 42 VALUE "8C".
           05  AF-8C  PIC X(30) ROW  6 COL 46 VALUE "NOLINE DIM".

           05  FILLER PIC X(02) ROW  8 COL  2 VALUE "90".
           05  AF-90  PIC X(30) ROW  8 COL  6 VALUE "NOLINE BLINK".
           05  FILLER PIC X(02) ROW  8 COL 42 VALUE "94".
           05  AF-94  PIC X(30) ROW  8 COL 46 VALUE "NOLINE BLINK".

           05  FILLER PIC X(02) ROW 10 COL  2 VALUE "98".
           05  AF-98  PIC X(30) ROW 10 COL  6 VALUE "NOLINE BLANK".
           05  FILLER PIC X(02) ROW 10 COL 42 VALUE "9C".
           05  AF-9C  PIC X(30) ROW 10 COL 46 VALUE "NOLINE BLANK".

           05  FILLER PIC X(02) ROW 12 COL  2 VALUE "A0".
           05  AF-A0  PIC X(30) ROW 12 COL  6 VALUE "  LINE BRIGHT".
           05  FILLER PIC X(02) ROW 12 COL 42 VALUE "A4".
           05  AF-A4  PIC X(30) ROW 12 COL 46 VALUE "  LINE BRIGHT".

           05  FILLER PIC X(02) ROW 14 COL  2 VALUE "A8".
           05  AF-A8  PIC X(30) ROW 14 COL  6 VALUE "  LINE DIM".
           05  FILLER PIC X(02) ROW 14 COL 42 VALUE "AC".
           05  AF-AC  PIC X(30) ROW 14 COL 46 VALUE "  LINE DIM".

           05  FILLER PIC X(02) ROW 16 COL  2 VALUE "B0".
           05  AF-B0  PIC X(30) ROW 16 COL  6 VALUE "  LINE BLINK".
           05  FILLER PIC X(02) ROW 16 COL 42 VALUE "B4".
           05  AF-B4  PIC X(30) ROW 16 COL 46 VALUE "  LINE BLINK".

           05  FILLER PIC X(02) ROW 18 COL  2 VALUE "B8".
           05  AF-B8  PIC X(30) ROW 18 COL  6 VALUE "  LINE BLANK".
           05  FILLER PIC X(02) ROW 18 COL 42 VALUE "BC".
           05  AF-BC  PIC X(30) ROW 18 COL 46 VALUE "  LINE BLANK".

           05  FILLER PIC X(40) ROW 24 COL 25 VALUE 
               "PRESS (ENTER) TO CONTINUE".

      /*****************************************************************
      *                                                                *
      *                         PROCEDURE DIVISION                     *
      *                                                                *
      ******************************************************************
      *
       PROCEDURE DIVISION.

       SCREEN-TESTS.
      
           DISPLAY AND READ SCREEN-SCREEN ON CRT
           PFKEYS 1, 2, 3,       6,    8,  10, 11, 12, 13, 14, 15, 16,
                  17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
                  30, 31, 32.

           IF PF-KEY = "01" THEN
              PERFORM DISPLAY-SCREEN
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "02" THEN
              PERFORM TRY-PF-KEYS
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "03" THEN
              PERFORM DISPLAY-MISC THRU DISPLAY-MISC-EXIT
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "04" THEN
000000*$WANG_CODE
              CALL "QASCROLL"
000000*$WANG_END
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "05" THEN
000000*$WANG_CODE
              CALL "QATSTLST"
000000*$WANG_END
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "06" THEN
              PERFORM DO-REWRITE
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "07" THEN
              PERFORM DO-WISPSYNC
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "08" THEN
              PERFORM DO-MATRIX
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "09" THEN

              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "10" THEN
              PERFORM DO-SCREEN-SUBTEST
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "19" THEN
              PERFORM EMBEDDED-FAC-TEST
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "20" THEN
              PERFORM ALL-FAC-TEST
              GO TO SCREEN-TESTS
           ELSE IF PF-KEY = "16" THEN
              GO TO EXIT-PROGRAM.

           CALL "QASCRN2" USING PF-KEY.

           GO TO SCREEN-TESTS.

       DISPLAY-SCREEN.
      ******************************************************************
      * FIRST MAKE SURE THE SCREEN ITEMS GET THERE INITIAL VALUES.     *
      ******************************************************************
           PERFORM INITIALIZE-SCREEN-OCC-1.

           MOVE "BAILEYS" TO SRC-TAG-FIELD(1, 1).
           MOVE "Smiths " TO SRC-TAG-FIELD(2, 1).
           MOVE "Holmes " TO SRC-TAG-FIELD(3, 1).

           MOVE "LAUNCH  " TO PROJ-TAG-FIELD(1, 1).
           MOVE "ORBIT   " TO PROJ-TAG-FIELD(2, 1).
           MOVE "SPACE   " TO PROJ-TAG-FIELD(3, 1).

           MOVE "INITIAL LAUNCH PROCEDURE   " TO
                PROJ-DESC-FIELD(1, 1).
           MOVE "ENTER ASYNCHRONOUS ORBIT   " TO
                PROJ-DESC-FIELD(2, 1).
           MOVE "STUDY THE EFFECTS OF SPACE " TO
                PROJ-DESC-FIELD(3, 1).

           MOVE "SUPER LAUNCH COMPANY     " TO
                ACCOUNT-FIELD(1, 1).
           MOVE "GREAT ORBITER CORPORATION" TO
                ACCOUNT-FIELD(2, 1).
           MOVE "SPACE EFFECT INCORPORATED" TO
                ACCOUNT-FIELD(3, 1).

      ******************************************************************
      * SET UP A FIELD TO ACT AS A NON-ECHO PASSWORD FIELD.
      ******************************************************************

           MOVE NO-ECHO TO FAC OF PASSWORD-ITEM.

           SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(1, 1) OFF.
           SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(2, 1) OFF.
           SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(3, 1) OFF.

           SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(1, 1) OFF.
           SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(2, 1) OFF.
           SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(3, 1) OFF.

           SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(1, 1) OFF.
           SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(2, 1) OFF.
           SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(3, 1) OFF.

           SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(1, 1) OFF.
           SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(2, 1) OFF.
           SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(3, 1) OFF.

           SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(1, 1) OFF.
           SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(2, 1) OFF.
           SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(3, 1) OFF.

           SET BLINK-BIT IN FAC OF AMOUNT-ITEM-4(3, 1) ON.

      ******************************************************************
      * SET UP FIELD TO ACT SUPRESSED PROTECTED.
      ******************************************************************

           MOVE HEX-9C TO FAC OF BLPRO-ITEM.
           MOVE "Push (14) to print screen." TO PRINT-FLAG.

      ******************************************************************
      * NOW DISPLAY THE FIRST SCREEN
      ******************************************************************

           DISPLAY AND READ SCREEN-1 ON CRT
           PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16,
                  17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
                  30, 31, 32.

           IF PF-KEY = "14" THEN
              PERFORM PRINT-SCREEN.

           MOVE SPACES TO PRINT-FLAG.
      ******************************************************************
      * PROTECT ALL THE FIELDS THAT WERE MODIFIABLE.
      ******************************************************************

           SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(1, 1) ON.
           SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(2, 1) ON.
           SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(3, 1) ON.

           SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(1, 1) ON.
           SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(2, 1) ON.
           SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(3, 1) ON.


           SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(1, 1) ON.
           SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(2, 1) ON.
           SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(3, 1) ON.

           SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(1, 1) ON.
           SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(2, 1) ON.
           SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(3, 1) ON.

           SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(1, 1) ON.
           SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(2, 1) ON.

      ******************************************************************
      * MAKE THE PASSWORD FIELD VISIBLE AND BLINING.
      ******************************************************************

           MOVE BLINKING-DISPLAY TO FAC OF PASSWORD-ITEM.

      ******************************************************************
      * RE DISPLAY THE FIELDS
      ******************************************************************

           DISPLAY AND READ SCREEN-1 ON CRT.

       TRY-PF-KEYS.
           DISPLAY AND READ ALTERED KEYBOARD-TEST-SCREEN ON CRT
           PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14,
                 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
                 27, 28, 29, 30, 31, 32
           ON PFKEY 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14,
                 15,16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
                 27, 28, 29, 30, 31, 32
                 GO TO TRY-PF-KEYS.

       PRINT-SCREEN.
           move spaces to print-recvr.
           CALL "SCREEN" USING PRINT-STATUS,
                               CRT,
                               PRINT-FUNC,
                               PRINT-RECVR.
           display "Print file =" PRINT-RECVR.

       DISPLAY-MISC.
           SET PROTECT-BIT IN FAC OF MISC-ROW03 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW04 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW05 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW06 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW07 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW08 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW09 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW10 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW11 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW12 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW13 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW14 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW15 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW16 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW17 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW18 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW19 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW20 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW21 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW22 OFF.
           SET PROTECT-BIT IN FAC OF MISC-ROW23 OFF.
           MOVE BRITE-MOD-ALL TO FAC OF MISC-ROW23.

           DISPLAY AND READ MISC-SCREEN ON CRT 
               PFKEY 16
               ON PFKEY 16 GO TO DISPLAY-MISC-EXIT.

           SET PROTECT-BIT IN FAC OF MISC-ROW03 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW04 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW05 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW06 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW07 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW08 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW09 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW10 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW11 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW12 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW13 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW14 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW15 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW16 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW17 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW18 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW19 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW20 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW21 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW22 ON.
           SET PROTECT-BIT IN FAC OF MISC-ROW23 ON.
           MOVE DIM-PROT-ALL TO FAC OF MISC-ROW23.

           DISPLAY AND READ MISC-SCREEN ON CRT 
               PFKEY 16
               ON PFKEY 16 GO TO DISPLAY-MISC-EXIT.

           IF PF-KEY NOT = "16" THEN GO TO DISPLAY-MISC.
       DISPLAY-MISC-EXIT.
           EXIT.

       DO-REWRITE.

           MOVE REWRITE-TEST TO CRTREC-MAPPING-AREA.
           REWRITE CRTREC SETTING CURSOR COLUMN 01 ROW 01.
           MOVE 0   TO PAUSE-TIME-1.
           MOVE 300 TO PAUSE-TIME-2.
           CALL "PAUSE" USING PAUSE-TIME.

       INITIALIZE-SCREEN-OCC-1.

           PERFORM INIT-THE-ARRAY VARYING MY-INDEX FROM 1 BY 1 UNTIL
                   MY-INDEX IS > 3.

       INIT-THE-ARRAY.
           MOVE "BLANK" TO ACCOUNT-FIELD (MY-INDEX, 1).
           MOVE "BLANK" TO ACCOUNT-DESC-FIELD (MY-INDEX, 1).
           MOVE "BLANK" TO SRC-TAG-FIELD (MY-INDEX, 1).
           MOVE "BLANK" TO SOURCE-FIELD (MY-INDEX, 1).
           MOVE "BLANK" TO PROJ-TAG-FIELD (MY-INDEX, 1).
           MOVE "BLANK" TO PROJECT-FIELD (MY-INDEX, 1).
           MOVE "BLANK" TO PROJ-DESC-FIELD (MY-INDEX, 1).

           MOVE 1 TO DIST-PCT-FIELD (MY-INDEX, 1).
           MOVE 2 TO AMOUNT-FIELD  (MY-INDEX, 1).

        END-INIT-SCREEN.

      ******************************************************************

       DO-WISPSYNC.
000000*$WANG_CODE
           DISPLAY AND READ SYNC-SCREEN1 ON CRT.
           CALL "MESSUP".
           DISPLAY AND READ SYNC-SCREEN2 ON CRT.
           CALL "WISPSYNC".
           DISPLAY AND READ SYNC-SCREEN3 ON CRT.
000000*$WANG_END

      ******************************************************************

       DO-MATRIX.

           PERFORM INIT-MATRIX-D1 VARYING INDEX-D1 FROM 1 BY 1
                   UNTIL INDEX-D1 IS > 3.

           DISPLAY AND READ MATRIX-SCREEN ON CRT.

       INIT-MATRIX-D1.
           MOVE INDEX-D1 TO MATRIX-D1.

           PERFORM INIT-MATRIX-D2-1 VARYING INDEX-D2 FROM 1 BY 1
                   UNTIL INDEX-D2 IS > 2.

           PERFORM INIT-MATRIX-D2-2 VARYING INDEX-D2 FROM 1 BY 1
                   UNTIL INDEX-D2 IS > 4.

       INIT-MATRIX-D2-1.
           MOVE INDEX-D2 TO MATRIX-D2.

           PERFORM INIT-MATRIX-D3-1 VARYING INDEX-D3 FROM 1 BY 1
                   UNTIL INDEX-D3 IS > 8.

       INIT-MATRIX-D2-2.
           MOVE INDEX-D2 TO MATRIX-D2.

           PERFORM INIT-MATRIX-D3-2 VARYING INDEX-D3 FROM 1 BY 1
                   UNTIL INDEX-D3 IS > 7.

       INIT-MATRIX-D3-1.
           MOVE INDEX-D3 TO MATRIX-D3.
           MOVE MATRIX-ITEM TO 
                MATRIX-DATE-SOURCE(INDEX-D1, INDEX-D2, INDEX-D3).

       INIT-MATRIX-D3-2.
           MOVE INDEX-D3 TO MATRIX-D3.
           MOVE MATRIX-ITEM TO 
                MATRIX-GROUP-SOURCE(INDEX-D1, INDEX-D2, INDEX-D3).

      ******************************************************************

       DO-WSXIO.

      **** WRITE THE INITIAL SCREEN ***************
      **** POSITION CURSOR TO FIRST MODIFIABLE FIELD.

           MOVE "X" TO WSXIO-COMMAND.
           MOVE WSXIO-WRITE TO WSXIO-CODE.

           CALL "WSXIO" USING WSXIO-COMMAND
                              WISP-SCRATCH-BYTE-1
                              WSXIO-CODE
                              WSXIO-ORDER-AREA
                              WSXIO-O-A-LENGTH
                              WSXIO-SCREEN
                              WSXIO-SCREEN-LENGTH
                              WSXIO-TIMER
                              WSXIO-IOSW-REC
                              WISP-SCRATCH-BYTE-2
                              WISP-SCRATCH-BYTE-3
                              WISP-SCRATCH-BYTE-4.

      *** CLEAR THE POSITION CURSOR BIT IN WCC.

           MOVE HEX-80 TO WSXIO-O-A-2.

           PERFORM READ-WSXIO-SCREEN WITH TEST AFTER UNTIL
                   WSXIO-CODE IS NOT = HEXFF.

       READ-WSXIO-SCREEN.

           MOVE "X" TO WSXIO-COMMAND.
           MOVE WSXIO-WRITE TO WSXIO-CODE.

      **** WRITE THE SCREEN ***************
      **** NO POSITION CURSOR TO BE DONE.

           CALL "WSXIO" USING WSXIO-COMMAND
                              WISP-SCRATCH-BYTE-1
                              WSXIO-CODE
                              WSXIO-ORDER-AREA
                              WSXIO-O-A-LENGTH
                              WSXIO-SCREEN
                              WSXIO-SCREEN-LENGTH
                              WSXIO-TIMER
                              WSXIO-IOSW-REC
                              WISP-SCRATCH-BYTE-2
                              WISP-SCRATCH-BYTE-3
                              WISP-SCRATCH-BYTE-4.

           MOVE "T" TO WSXIO-COMMAND.
           MOVE WSXIO-READ TO WSXIO-CODE.

      **** READ THE SCREEN, 5 SEC TIMER ***************

           CALL "WSXIO" USING WSXIO-COMMAND
                              WISP-SCRATCH-BYTE-1
                              WSXIO-CODE
                              WSXIO-ORDER-AREA
                              WSXIO-O-A-LENGTH
                              WSXIO-SCREEN
                              WSXIO-SCREEN-LENGTH
                              WSXIO-TIMER
                              WSXIO-IOSW-REC
                              WISP-SCRATCH-BYTE-2
                              WISP-SCRATCH-BYTE-3
                              WISP-SCRATCH-BYTE-4.

      **** GET AID CHAR ***************

           MOVE "A" TO WSXIO-COMMAND.
           CALL "WSXIO" USING WSXIO-COMMAND
                              WISP-SCRATCH-BYTE-1
                              WSXIO-CODE.

           IF WSXIO-CODE = HEXFF
              IF WSXIO-COUNTER = 1
                 MOVE ZERO TO WSXIO-COUNTER
                 MOVE "MESSAGE 1 ON DISPLAY" TO
                 WSXIO-MSG
              ELSE
                 MOVE 1 TO WSXIO-COUNTER
                 MOVE "THIS IS MESSAGE 2" TO
                 WSXIO-MSG.

      ******************************************************************

       DO-SCREEN-SUBTEST.
           DISPLAY AND READ SCREEN-SUBT ON CRT.


      ******************************************************************
       EMBEDDED-FAC-TEST.
           DISPLAY AND READ EMBED-SCREEN ON CRT.
           DISPLAY AND READ EMBED-SCREEN ON CRT.

      ******************************************************************
       ALL-FAC-TEST.
           MOVE HEX-80 TO FAC OF AF-80.
           MOVE HEX-84 TO FAC OF AF-84.
           MOVE HEX-88 TO FAC OF AF-88.
           MOVE HEX-8C TO FAC OF AF-8C.

           MOVE HEX-90 TO FAC OF AF-90.
           MOVE HEX-94 TO FAC OF AF-94.
           MOVE HEX-98 TO FAC OF AF-98.
           MOVE HEX-9C TO FAC OF AF-9C.

           MOVE HEX-A0 TO FAC OF AF-A0.
           MOVE HEX-A4 TO FAC OF AF-A4.
           MOVE HEX-A8 TO FAC OF AF-A8.
           MOVE HEX-AC TO FAC OF AF-AC.

           MOVE HEX-B0 TO FAC OF AF-B0.
           MOVE HEX-B4 TO FAC OF AF-B4.
           MOVE HEX-B8 TO FAC OF AF-B8.
           MOVE HEX-BC TO FAC OF AF-BC.

           DISPLAY AND READ ALL-FAC-SCREEN ON CRT.

      ******************************************************************

      ******************************************************************
      * ALL DONE.
      ******************************************************************

       EXIT-PROGRAM.
           EXIT PROGRAM.

       STOP-RUN.
           STOP RUN.
