000100/*****************************************************************
000200*                                                                *
000300*                       IDENTIFICATION DIVISION                  *
000400*                                                                *
000500******************************************************************
000600*
000700 IDENTIFICATION DIVISION.
000800 PROGRAM-ID.
000900     QASCREEN.
001000 AUTHOR.
001100     Greg Lindholm.
001200 DATE-WRITTEN.
001300     12/07/89.
001400/*****************************************************************
001500*                                                                *
001600*                         ENVIRONMENT DIVISION                   *
001700*                                                                *
001800******************************************************************
001900*
002000 ENVIRONMENT DIVISION.
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.
002300     WANG-VS.
002400 OBJECT-COMPUTER.
002500     WANG-VS.
002600 FIGURATIVE-CONSTANTS.
002700     A-0-BYTE IS "00"
002800     A-1-BYTE IS "01"
002900     A-160-BYTE IS "A0"
003000     HEXFF IS "FF"
003100     HEX-00 IS "00"
003200     HEX-01 IS "01"
003300     HEX-02 IS "02"
003400     HEX-0A IS "0A"
003500     HEX-0B IS "0B"
003600     HEX-10 IS "10"
003700     HEX-28 IS "28"
003800     HEX-80 IS "80"
003900     HEX-84 IS "84"
004000     HEX-88 IS "88"
004100     HEX-8C IS "8C"
004200     HEX-90 IS "90"
004300     HEX-94 IS "94"
004400     HEX-98 IS "98"
004500     HEX-9C IS "9C"
004600     HEX-A0 IS "A0"
004700     HEX-A4 IS "A4"
004800     HEX-A8 IS "A8"
004900     HEX-AC IS "AC"
005000     HEX-B0 IS "B0"
005100     HEX-B4 IS "B4"
005200     HEX-B8 IS "B8"
005300     HEX-BC IS "BC"
005600     BLINK-BIT IS "10"
005700     PROTECT-BIT IS "04"
005800     DIM-BIT IS "08"
005900     TAB-STOP IS "86"
006000     BLINKING-DISPLAY IS "94"
006100     BRITE IS "84"
006200     BRITE-MOD-ALL IS "80"
006300     DIM-PROT-ALL IS "8C"
006400     NO-ECHO IS "98"
006500     SUB-1 IS "01"
006600     SUB-2 IS "02"
006700     SUB-3 IS "03"
006800     SUB-4 IS "04"
006900     SUB-5 IS "05"
007000     SUB-6 IS "06"
007100     SUB-7 IS "07"
007200     SUB-8 IS "08"
007300     SUB-9 IS "09"
007400     SUB-10 IS "0A"
007500     SUB-11 IS "0B"
007600     SUB-12 IS "0C"
007700     SUB-13 IS "0D"
007800     SUB-14 IS "0E"
007900     SUB-15 IS "0F"
008000     SUB-16 IS "10"
008100     SUB-17 IS "11"
008200     SUB-18 IS "12"
008300     SUB-19 IS "13"
008400     SUB-20 IS "14"
008500     SUB-21 IS "15"
008600     SUB-22 IS "16"
008700     SUB-23 IS "17"
008800     SUB-24 IS "18"
008900     SUB-25 IS "19"
009000     SUB-26 IS "1A"
009100     SUB-27 IS "1B"
009200     SUB-28 IS "1C"
009300     SUB-29 IS "1D"
009400     SUB-30 IS "1E"
009500     SUB-31 IS "1F"
009600     SUB-96 IS "60"
009700     MENU-PICK IS "8E".
009800
009900/*****************************************************************
010000*                                                                *
010100*                         INPUT-OUTPUT SECTION                   *
010200*                                                                *
010300******************************************************************
010400*
010500 INPUT-OUTPUT SECTION.
010600 FILE-CONTROL.
010700*
010800     SELECT CRT
010900         ASSIGN TO "CRT",      "DISPLAY",
011000         ORGANIZATION    IS SEQUENTIAL
011100         ACCESS MODE     IS RANDOM
011200         RELATIVE KEY    IS LINENUM
011300         PFKEY           IS PF-KEY
011400         CURSOR POSITION IS CURSOR-POS
011500         FILE STATUS     IS FILSTAT.
011600
011700     SELECT CRT-ROW
011800         ASSIGN TO "CRTROW",    "DISPLAY",
011900         ORGANIZATION    IS SEQUENTIAL
012000         ACCESS MODE     IS RANDOM
012100         RELATIVE KEY    IS LINENUM
012200         PFKEY           IS PF-KEY
012300         CURSOR POSITION IS CURSOR-POS
012400         FILE STATUS     IS FILSTAT.
012500
012600     SELECT CRT-OA
012700         ASSIGN TO "CRTOA",    "DISPLAY",
012800         ORGANIZATION    IS SEQUENTIAL
012900         ACCESS MODE     IS RANDOM
013000         FILE STATUS     IS FILSTAT.
013100
013200
013300/*****************************************************************
013400*                                                                *
013500*                      DATA DIVISION - FILE SECTION              *
013600*                                                                *
013700******************************************************************
013800*
013900 DATA DIVISION.
014000 FILE SECTION.
014100*
014200 FD  CRT
014300     LABEL RECORDS ARE OMITTED.
014400 01  CRTREC.
014500     03  CRTREC-OA                    PIC X(4).
014600     03  CRTREC-MAPPING-AREA          PIC X(1920).
014700
014800 FD  CRT-ROW
014900     LABEL RECORDS ARE OMITTED.
015000 01  CRT-ROW-REC.
015100     03  CRT-ROW-REC-OA.
015200         05  CRT-ROW-OA-1             PIC X.
015300         05  CRT-ROW-OA-2             PIC X.
015400         05  CRT-ROW-OA-3             PIC X.
015500         05  CRT-ROW-OA-4             PIC X.
015600     03  CRT-ROW-REC-MAP.
015700         05  FILLER                   PIC X(80).
015800     03  CRT-ROW-REC-MAP-X REDEFINES CRT-ROW-REC-MAP.
015900         05  CRT-ROW-X OCCURS 80 TIMES PIC X.
016000
016100 FD  CRT-OA
016200     LABEL RECORDS ARE OMITTED.
016300 01  CRT-OA-REC.
016400         05  CRT-OA-1             PIC X.
016500         05  CRT-OA-2             PIC X.
016600         05  CRT-OA-3             PIC X.
016700         05  CRT-OA-4             PIC X.
016800
016900*
017000/*****************************************************************
017100*                                                                *
017200*                         WORKING STORAGE                        *
017300*                                                                *
017400******************************************************************
017500*
017600 WORKING-STORAGE SECTION.
017700
017800 01  FILSTAT.
017900     03  ERR-FLAG                   PIC X(01).
018000     03  PFK-BYTE                   PIC X(01).
018100
018200 77  LINENUM                        PIC 9(02) VALUE 1.
018300 77  PF-KEY                         PIC X(02) VALUE ZERO.
018400
018500 01  CURSOR-POS.
018600     03  MOD-COL                    BINARY.
018700     03  MOD-ROW                    BINARY.
018800
018900******************************************************************
019000
019100 01  REDEF-CURS-POS                 REDEFINES CURSOR-POS.
019200     03  FILLER                     PIC X(01).
019300     03  CURS-COL                   PIC X(01).
019400     03  FILLER                     PIC X(01).
019500     03  CURS-ROW                   PIC X(01).
019600
019700 01  MY-INDEX                       PIC 9(5).
019800 01  INDEX-D1                       PIC 9(5).
019900 01  INDEX-D2                       PIC 9(5).
020000 01  INDEX-D3                       PIC 9(5).
020100 01  THE-PASS                       PIC X(6).
020200 01  THE-BLPRO                      PIC X(7)  VALUE "no disp".
020800 01  ACCEPT-FIELD                   PIC X(6).
020900 01  START-VAL                      PIC X(4) VALUE "0000".
021000
021100 01  SCREEN-OCC-1.
021200     03  FILLER OCCURS 3 TIMES.
021300
021400         10  FILLER OCCURS 1 TIMES.
021500             15  ACCOUNT-FIELD       PIC X(25).
021600             15  ACCOUNT-DESC-FIELD  PIC X(30).
021700             15  DIST-PCT-FIELD      PIC 999.99-.
021800             15  AMOUNT-FIELD        PIC 99999.99.
021900
022000         10  FILLER OCCURS 1 TIMES.
022100
022200             15  SRC-TAG-FIELD       PIC X(7).
022300             15  SOURCE-FIELD        PIC X(10).
022400             15  PROJ-TAG-FIELD      PIC X(8).
022500             15  PROJECT-FIELD       PIC X(10).
022600             15  PROJ-DESC-FIELD     PIC X(30).
023700
023800
023900 01  CRTREC2.
024000     05  CRTREC2-FULL         PIC X(1924) VALUE SPACES.
024100     05  FILLER REDEFINES CRTREC2-FULL.
024200         10  CRTREC2-OA.
024300             15  CRTREC2-OA-1   PIC X.
024400             15  CRTREC2-OA-2   PIC X.
024500             15  CRTREC2-OA-3   PIC X.
024600             15  CRTREC2-OA-4   PIC X.
024700         10  CRTREC2-24-ROWS.
024800             15  CRTREC2-ROW  OCCURS 24 TIMES.
024900                 20 CRTREC2-X OCCURS 80 TIMES PIC X.
025000
025100
025200/*****************************************************************
025300*                                                                *
025400*                   DISPLAY DEFINITIONS                          *
025500*                                                                *
025600******************************************************************
025700*
025800
026800
026900 01  FILLER.
027000     03  NUM-ANS-EXPANDED.
027100         05  FILLER PIC X(5) VALUE "ONE".
027200         05  FILLER PIC X(5) VALUE "TWO".
027300         05  FILLER PIC X(5) VALUE "THREE".
027400     03  FILLER REDEFINES NUM-ANS-EXPANDED.
027500         05  NUM-ANS   PIC X(5) OCCURS 3 TIMES.
027600
027700 01  T2.
027800     03  ENTRIES.
027900         05  FILLER PIC X(5) VALUE "ONE".
028000         05  FILLER PIC X(5) VALUE "TWO".
028100         05  FILLER PIC X(5) VALUE "THREE".
028200         05  FILLER PIC X(5) VALUE "FOUR".
028300         05  FILLER PIC X(5) VALUE "FIVE".
028400         05  FILLER PIC X(5) VALUE "SIX".
028500         05  FILLER PIC X(5) VALUE "SEVEN".
028600         05  FILLER PIC X(5) VALUE "EIGHT".
028700         05  FILLER PIC X(5) VALUE "NINE".
028800         05  FILLER PIC X(5) VALUE "TEN".
028900     03  FILLER REDEFINES ENTRIES.
029000         05  NUM-TABLE OCCURS 10 TIMES PIC X(5).
029100
029200 01  FILLER.
029300     05  t3-x.
029400         10 filler pic s9(4)v99 value 0.
029500         10 filler pic s9(4)v99 value 0.
029600         10 filler pic s9(4)v99 value 0.
029700         10 filler pic s9(4)v99 value 0.
029800         10 filler pic s9(4)v99 value 0.
029900     05  t3 redefines t3-x pic s9(4)v99 occurs 5 times.
030000
030100
030200 01  FILLER.
030300     03  FILLER                      OCCURS 3 TIMES.
030400         05  FILLER                  OCCURS 2 TIMES.
030500             07  MATRIX-DATE-SOURCE  OCCURS 8 TIMES
030600                 PIC X(7) VALUE SPACES.
030700
030800         05  FILLER                  OCCURS 4 TIMES.
030900             07  MATRIX-GROUP-SOURCE OCCURS 7 TIMES
031000                 PIC X(7) VALUE SPACES.
031100
031200 01  MATRIX-ITEM.
031300     05  FILLER     PIC X VALUE "(".
031400     05  MATRIX-D1  PIC 9 VALUE ZERO.
031500     05  FILLER     PIC X VALUE "-".
031600     05  MATRIX-D2  PIC 9 VALUE ZERO.
031700     05  FILLER     PIC X VALUE "-".
031800     05  MATRIX-D3  PIC 9 VALUE ZERO.
031900     05  FILLER     PIC X VALUE ")".
032000
032100 01  MATRIX-SCREEN USAGE IS DISPLAY-WS.
032200     03  FILLER PIC X(18) ROW 1 COL 40 VALUE
032300         "MATRIX TEST SCREEN".
032400     03  FILLER                      OCCURS 3 TIMES.
032500         05  FILLER                  OCCURS 2 TIMES.
032600             07  MATRIX-DATE         OCCURS 8 TIMES
032700                 PIC X(7)  LINE 3 COLUMN 02
032800                 SOURCE MATRIX-DATE-SOURCE.
032900
033000         05  FILLER                  OCCURS 4 TIMES.
033100             07  MATRIX-GROUP         OCCURS 7 TIMES
033200                 PIC X(7)  LINE 5 COL 04
033300                 SOURCE MATRIX-GROUP-SOURCE
033400                 OBJECT MATRIX-GROUP-SOURCE.
033500
033600     03  MATRIX-LINE-24 PIC X(38) LINE 24 COL 02 VALUE
033700         "Press (ENTER) to continue.".
033800
033900 01  SYNC-SCREEN1 USAGE IS DISPLAY-WS.
034000     03  FILLER PIC X(24) ROW 3 COL 28 VALUE
034100     "*** TEST WISPSYNC ***".
034200     03  FILLER PIC X(60) ROW 8 COL 10 VALUE
034300     "This is a test to see if WISPSYNC will really cause the".
034400     03  FILLER PIC X(60) ROW 9 COL 10 VALUE
034500     "screen to cleanup (SYNC) after an external routine is".
034600     03  FILLER PIC X(60) ROW 10 COL 10 VALUE
034700     "called that changes the contents of the screen.".
034800     03  FILLER PIC X(40) ROW 24 COL 27 VALUE
034900     "PRESS (ENTER) TO CONTINUE.".
035000
035100 01  SYNC-SCREEN2 USAGE IS DISPLAY-WS.
035200     03  FILLER PIC X(40) ROW 13 COL 20 VALUE
035300     "The screen should be messed up.".
035400     03  FILLER PIC X(40) ROW 24 COL 27 VALUE
035500     "PRESS (ENTER) TO CONTINUE.".
035600
035700 01  SYNC-SCREEN3 USAGE IS DISPLAY-WS.
035800     03  FILLER PIC X(25) ROW 8 COL 30 VALUE
035900     "  DID WISPSYNC WORK ?  ".
036000     03  FILLER PIC X(40) ROW 24 COL 27 VALUE
036100     "PRESS (ENTER) TO CONTINUE.".
036200
036300 01  KEYBOARD-TEST-SCREEN USAGE IS DISPLAY-WS.
036400     03  FILLER PIC X(40) ROW 2 COL 20
036500         VALUE "PRESS A PFKEY, (ENTER) TO QUIT".
036600
036700     03  FILLER PIC X(18) ROW 12 COL 10
036800         VALUE "YOU PRESSED PF KEY".
036900
037000     03  FILLER PIC X(2) ROW 12 COL 30
037100         SOURCE PF-KEY.
037200
037300 01  MISC-SCREEN USAGE IS DISPLAY-WS.
037400
037500     03  FILLER PIC X(23)     ROW 1 COL 29  VALUE
037600         "* * * MISC-SCREEN * * *".
037700
037800     03  FILLER PIC X(9)                   ROW  3 COL 1
037900         VALUE      "PIC 9(5)".
038000     03  MISC-ROW03  PIC 9(5)              ROW  3 COL 36
038100         SOURCE XMISC-PIC9-5
038200         OBJECT XMISC-PIC9-5.
038300
038400     03  FILLER PIC X(9)                   ROW  4 COL 1
038500         VALUE      "PIC Z(5)".
038600     03  MISC-ROW04  PIC Z(5)              ROW  4 COL 36
038700         SOURCE XMISC-PICZ-5
038800         OBJECT XMISC-PICZ-5.
038900
039000     03  FILLER PIC X(9)                   ROW  5 COL 1
039100         VALUE      "PIC -(6)".
039200     03  MISC-ROW05  PIC -(6)              ROW  5 COL 35
039300         SOURCE XMISC-PICS--6
039400         OBJECT XMISC-PICS--6.
039500
039600     03  FILLER PIC X(12)                  ROW  6 COL 1
039700         VALUE        "PIC ----.--".
039800     03  MISC-ROW06    PIC ----.--         ROW  6 COL 37
039900         SOURCE XMISC-PICS9-3V2
040000         OBJECT XMISC-PICS9-3V2.
040100
040200     03  FILLER PIC X(14)                  ROW  7 COL 1
040300         VALUE         "PIC 99,999.99+".
040400     03  MISC-ROW07     PIC 99,999.99+     ROW  7 COL 35
040500         SOURCE XMISC-PICS9-5V2
040600         OBJECT XMISC-PICS9-5V2.
040700
040800     03  FILLER PIC X(20)                  ROW  8 COL 1
040900         VALUE          "PIC $ZZ,ZZZ.ZZB-".
041000     03  MISC-ROW08      PIC $ZZ,ZZZ.ZZB-  ROW  8 COL 34
041100         SOURCE XMISC-PICSZ-5V2
041200         OBJECT XMISC-PICSZ-5V2.
041300
041400     03  FILLER PIC X(9)                   ROW 9 COL 1
041500         VALUE           "PIC +Z(9)".
041600     03  MISC-ROW09       PIC +Z(9)        ROW 9 COL 31
041700         SOURCE XMISC-PICZ9
041800         OBJECT XMISC-PICZ9.
041900
042000     03  FILLER PIC X(20)                  ROW 10 COL 1
042100         VALUE           "PIC $B*(9)BCR".
042200     03  MISC-ROW10       PIC $B*(9)BCR    ROW 10 COL 30
042300         SOURCE XMISC-PIC9Z
042400         OBJECT XMISC-PIC9Z.
042500
042600     03  FILLER PIC X(20)                  ROW 11 COL 1
042700         VALUE       "PIC $$,$$$B.B$$BDB".
042800     03  MISC-ROW11   PIC $$,$$$B.B$$BDB   ROW 11 COL 35
042900         SOURCE XMISC-PICS9-4V2
043000         OBJECT XMISC-PICS9-4V2.
043100
043200     03  FILLER PIC X(17)                  ROW 12 COL 1
043300         VALUE      "PIC +++,+++.99/99".
043400     03  MISC-ROW12  PIC +++,+++.99/99     ROW 12 COL 34
043500         SOURCE XMISC-PICS9-5V4
043600         OBJECT XMISC-PICS9-5V4.
043700
043800     03  FILLER PIC X(20)                  ROW 13 COL 1
043900         VALUE         "PIC -$B**,***.**".
044000     03  MISC-ROW13     PIC -$B**,***.**   ROW 13 COL 32
044100         SOURCE XMISC-PICS232
044200         OBJECT XMISC-PICS232.
044300
044400     03  FILLER PIC X(15)                  ROW 14 COL 1
044500         VALUE          "PIC ZZZBZZBZZZZ".
044600     03  MISC-ROW14      PIC ZZZBZZBZZZZ   ROW 14 COL 30
044700         SOURCE XMISC-PIC9
044800         OBJECT XMISC-PIC9.
044900
045000     03  FILLER PIC X(15)                  ROW 15 COL 1
045100         VALUE           "PIC ZZZ/ZZ/ZZZZ".
045200     03  MISC-ROW15       PIC ZZZ/ZZ/ZZZZ  ROW 15 COL 30
045300         SOURCE XMISC-PICE9
045400         OBJECT XMISC-PICE9.
045500
045600     03  FILLER PIC X(20)                  ROW 16 COL 1
045700         VALUE       "PIC ZZZZ,ZZZ,ZZZ,ZZZ".
045800     03  MISC-ROW16   PIC ZZZZ,ZZZ,ZZZ,ZZZ ROW 16 COL 25
045900         SOURCE XMISC-PICZ13
046000         OBJECT XMISC-PICZ13.
046100
046200     03  FILLER PIC X(10)                  ROW 17 COL 1
046300         VALUE     "PIC A(10)".
046400     03  MISC-ROW17 PIC A(10)              ROW 17 COL 25
046500         SOURCE XMISC-PICA10
046600         OBJECT XMISC-PICA10.
046700
046800     03  FILLER PIC X(12)                  ROW 18 COL 1
046900         VALUE     "PIC AABAABAA".
047000     03  MISC-ROW18 PIC AABAABAA           ROW 18 COL 25
047100         SOURCE XMISC-PICAB8
047200         OBJECT XMISC-PICAB8-X.
047300
047400     03  FILLER PIC X(05)                  ROW 18 COL 40
047500         VALUE     "---->".
047600     03  FILLER     PIC X(8)               ROW 18 COL 50
047700         SOURCE XMISC-PICAB8-X.
047800
047900     03  FILLER PIC X(11)                  ROW 19 COL 1
048000         VALUE     "PIC A9AB9A9".
048100     03  MISC-ROW19 PIC A9AB9A9            ROW 19 COL 25
048200         SOURCE XMISC-PICA9B7
048300         OBJECT XMISC-PICA9B7-X.
048400
048500     03  FILLER PIC X(05)                  ROW 19 COL 40
048600         VALUE     "---->".
048700     03  FILLER     PIC X(8)               ROW 19 COL 50
048800         SOURCE XMISC-PICA9B7-X.
048900
049000     03  FILLER PIC X(12)                  ROW 20 COL 1
049100         VALUE     "PIC AA/XX/99".
049200     03  MISC-ROW20 PIC AA/XX/99           ROW 20 COL 25
049300         SOURCE XMISC-PICAX8
049400         OBJECT XMISC-PICAX8-X.
049500
049600     03  FILLER PIC X(05)                  ROW 20 COL 40
049700         VALUE     "---->".
049800     03  FILLER     PIC X(8)               ROW 20 COL 50
049900         SOURCE XMISC-PICAX8-X.
050000
050100     03  FILLER PIC X(12)                  ROW 21 COL 1
050200         VALUE     "PIC XXB00BXX".
050300     03  MISC-ROW21 PIC XXB00BXX           ROW 21 COL 25
050400         SOURCE XMISC-PICXB8
050500         OBJECT XMISC-PICXB8-X.
050600
050700     03  FILLER PIC X(05)                  ROW 21 COL 40
050800         VALUE     "---->".
050900     03  FILLER     PIC X(8)               ROW 21 COL 50
051000         SOURCE XMISC-PICXB8-X.
051100
051200     03  FILLER PIC X(14)                 ROW 22 COL 1
051300         VALUE     "PIC Z(3) 1-199".
051400     03  MISC-ROW22 PIC Z(3)              ROW 22 COL 25
051500         RANGE 1 TO 199
051600         SOURCE XMISC-PICZ3
051700         OBJECT XMISC-PICZ3.
051800
051900     03  FILLER PIC X(20)                 ROW 23 COL 1
052000         VALUE "PIC X(50) (UPLOW):".
052100     03  MISC-ROW23 PIC X(50)             ROW 23 COL 25
052200         SOURCE XMISC-UPLOW OBJECT XMISC-UPLOW.
052300
052400*8901234567890123456789012345678901234567890123456789012345678901234567890
052500
052600     03  FILLER PIC X(50)
052700                ROW 24 COL 20
052800                VALUE "PRESS (ENTER) TO CONTINUE, (16) EXIT".
052900
053000 01  XMISC-PIC9-5         PIC 9(5)      VALUE 0.
053100 01  XMISC-PICZ-5         PIC 9(5)      VALUE 0.
053200 01  XMISC-PICS--6        PIC S9(5)     VALUE 0.
053300 01  XMISC-PICS9-3V2      PIC S999V99   VALUE 0.
053400 01  XMISC-PICS9-5V2      PIC S99999V99 VALUE 0.
053500 01  XMISC-PICSZ-5V2      PIC S99999V99 VALUE 0.
053600 01  XMISC-PICZ9          PIC S9(9)     VALUE 0.
053700 01  XMISC-PIC9Z          PIC S9(9)     VALUE 0.
053800 01  XMISC-PICS9-4V2      PIC S9999V99  VALUE 0.
053900 01  XMISC-PICS9-5V4      PIC S9(5)V9(4)  VALUE 0.
054000 01  XMISC-PICS232        PIC S99999V99   VALUE 0.
054100 01  XMISC-PIC9           PIC  9(9)       VALUE 0.
054200 01  XMISC-PICE9          PIC  9(9)       VALUE 0.
054300 01  XMISC-PICZ13         PIC S9(13) COMP VALUE 0.
054400 01  XMISC-PICA10         PIC X(10) VALUE SPACES.
054500 01  XMISC-PICAB8         PIC X(8)  VALUE SPACES.
054600 01  XMISC-PICAB8-X       PIC X(8)  VALUE SPACES.
054700 01  XMISC-PICA9B7        PIC X(7)  VALUE SPACES.
054800 01  XMISC-PICA9B7-X      PIC X(7)  VALUE SPACES.
054900 01  XMISC-PICAX8         PIC X(8)  VALUE SPACES.
055000 01  XMISC-PICAX8-X       PIC X(8)  VALUE SPACES.
055100 01  XMISC-PICXB8         PIC X(8)  VALUE SPACES.
055200 01  XMISC-PICXB8-X       PIC X(8)  VALUE SPACES.
055300 01  XMISC-PICZ3          PIC  999  VALUE 0.
055400 01  XMISC-UPLOW          PIC X(50) VALUE
055500     "This is a TEST of UPlow.".
055600
055700
055800 01  SCREEN-1 USAGE IS DISPLAY-WS.
055900     03  FILLER PIC X(29)
056000                ROW 1 COL 25
056100                VALUE "Screen 1 in program SAMPLE. ".
056200
056300     03  FILLER PIC X(158) ROW 2 COL 1 VALUE
056400         "This screen contains some modifiable text fields and som
056500-    "e modifiable numeric fields. All of the fields are part of a
056600-    " grouped screen item which OCCURS 6 times.".
056700
056800     03  FILLER PIC X(48) ROW 5 COL 2 VALUE
056900         "IT IS INTERRUPTED BY A DISPLAY VERB AFTER ENTRY.".
057000
057100     03  QUOTE-TEST PIC X(50) ROW 7 COL 2 VALUE
057200         """This is a test of QUOTE <""> inside a literal.""".
057300
057400     03  FILLER PIC X(21) ROW 9 COL 14
057500         VALUE "THIS ITEM IS NO-ECHO.".
057600     03  PASSWORD-ITEM PIC X(6) ROW 9 COL 37 SOURCE THE-PASS
057700         OBJECT THE-PASS.
057800
057900     03  FILLER OCCURS 3 TIMES.
058000
058100         10  FILLER OCCURS 1 TIMES.
058200             15  SRC-TAG-ITEM-4      PIC X(07)  ROW 11 COLUMN 08
058300                 SOURCE SRC-TAG-FIELD.
058400             15  SOURCE-ITEM-4       PIC X(10)  ROW 11 COLUMN 16
058500                 SOURCE SOURCE-FIELD
058600                 OBJECT SOURCE-FIELD.
058700             15  PROJ-TAG-ITEM-4     PIC X(08)  ROW 11 COLUMN 29
058800                 SOURCE PROJ-TAG-FIELD.
058900             15  PROJECT-ITEM-4      PIC X(10)  ROW 11 COLUMN 38
059000                 SOURCE PROJECT-FIELD
059100                 OBJECT PROJECT-FIELD.
059200             15  PROJ-DESC-ITEM-4    PIC X(30)  ROW 11 COLUMN 49
059300                 SOURCE PROJ-DESC-FIELD.
059400
059500         10  FILLER OCCURS 1 TIMES.
059600             15  ACCOUNT-ITEM-4      PIC X(25)  ROW 12 COLUMN 03
059700                 SOURCE ACCOUNT-FIELD.
059800             15  ACCOUNT-DESC-ITEM-4 PIC X(30)  ROW 12 COLUMN 29
059900                 SOURCE ACCOUNT-DESC-FIELD
060000                 OBJECT ACCOUNT-DESC-FIELD.
060100             15  DIST-PCT-ITEM-4  PIC Z(2)9.99- ROW 12 COLUMN 60
060200                 SOURCE DIST-PCT-FIELD
060300                 OBJECT DIST-PCT-FIELD.
060400             15  AMOUNT-ITEM-4     PIC 9(9).99- ROW 12 COLUMN 68
060500                 SOURCE AMOUNT-FIELD
060600                 OBJECT AMOUNT-FIELD.
060700
060800     03  FILLER PIC X(18) ROW 18 COL 5 VALUE "RANGE (YES ,NO)".
060900     03  FILLER PIC X(3)  ROW 18 COL 25
061000         SOURCE IS YES-NO OBJECT IS YES-NO
061100*$RANGE_COUNT 2
061200         RANGE IS YN-TABLE.
061300
061400     03  FILLER PIC X(18) ROW 18 COL 30 VALUE "RANGE (ONE-TEN)".
061500     03  FILLER PIC X(5)  ROW 18 COL 50 OCCURS 3 TIMES
061600         SOURCE IS NUM-ANS OBJECT IS NUM-ANS
061700*$RANGE_COUNT 10
061800         RANGE IS NUM-TABLE.
061900
062000     03  FILLER PIC X(17) ROW 20 COL 5 VALUE "RANGE (-99 - 175)".
062100     03  FILLER PIC Z(4).ZZ- OCCURS 5 TIMES ROW 20 COLUMN 25
062200         RANGE -99 to 175 SOURCE t3 OBJECT t3.
062300
062400     03  FILLER PIC X(19) ROW 22 COL 4
062500         VALUE "THIS ITEM IS BLPRO.".
062600     03  BLPRO-ITEM PIC X(7) ROW 22 COL 25
062700           SOURCE THE-BLPRO.
062800
063200     03  FILLER PIC X(40)
063300                ROW 24 COL 27
063400                VALUE "PRESS (ENTER) TO CONTINUE.".
063500
064700
064800 01  SCREEN-SUBT USAGE IS DISPLAY-WS.
064900     03  FILLER PIC X(23)
065000                ROW 1 COL 20
065100                VALUE "Test Substitution Table".
065200
065300     03  FILLER PIC X(156) ROW 3 COL 1 VALUE
065400         "This screen contains some characters with values in the
065500-    "non-printable range.    The substitution table will be used
065600-    "to display a graphics/default character.".
065700
065800     03  FILLER PIC X(44)
065900                ROW 6 COL 1 VALUE
066000         "Display the default substitution characters:".
066100
066200     03  FILLER PIC X(79)
066300                ROW 9 COL 1 VALUE
066400         "  1   2   3   4   5   6   7   8   9  10  11  12  13  14
066500-    " 15  16  17  18  19  20".
066600
066700     03  TEST-ITEM-1 PIC X(79) ROW 10 COLUMN 1
066800         SOURCE SUB-LINE-1.
066900
067000     03  FILLER PIC X(47)
067100                ROW 12 COL 1 VALUE
067200         " 21  22  23  24  25  26  27  28  29  30  31  96".
067300
067400     03  TEST-ITEM-2 PIC X(47) ROW 13 COLUMN 1
067500         SOURCE SUB-LINE-2.
067600
067700     03  TEST-ITEM-3 PIC X(7) ROW 16 COLUMN 20
067800         SOURCE SUB-LINE-3.
067900     03  TEST-ITEM-4 PIC X(7) ROW 17 COLUMN 20
068000         SOURCE SUB-LINE-4.
068100     03  TEST-ITEM-5 PIC X(7) ROW 18 COLUMN 20
068200         SOURCE SUB-LINE-5.
068300     03  TEST-ITEM-6 PIC X(7) ROW 19 COLUMN 20
068400         SOURCE SUB-LINE-4.
068500     03  TEST-ITEM-7 PIC X(7) ROW 20 COLUMN 20
068600         SOURCE SUB-LINE-6.
068700
068800     03  FILLER PIC X(40)
068900                ROW 24 COL 27
069000                VALUE "PRESS (ENTER) TO CONTINUE.".
069100

      ******************************************************************
       01  COLUMN-TEST-SCREEN USAGE IS DISPLAY-WS.

           03  FILLER PIC X(30)     ROW 1 COL 25  VALUE
               "* * * COLUMN-TEST-SCREEN * * *".
	   03  FILLER PIC X(79)     ROW 2 COL 2  
	       SOURCE COLUMN-TEST-SCREEN-MESSAGE.

           03  FILLER PIC X(60) ROW 4 COL 10 VALUE
               "This test does 2 DISPLAY AND READs of a 9 element".
           03  FILLER PIC X(60) ROW 5 COL 10 VALUE
               "vertical matrix with a PIC Z(6)9.99- and a RANGE of".
           03  FILLER PIC X(60) ROW 6 COL 10 VALUE
               "-99 to 999.".


           03  SC1-MATRIX-DAT OCCURS 9 TIMES ROW 12.
               05  SC1-COL-QTY-FAC PIC Z(6)9.99- ROW 12 COL 25
                   RANGE -99 TO 999
                   SOURCE SC1-COL-QTY
                   OBJECT SC1-COL-QTY.

           03  FILLER PIC X(40)
                      ROW 24 COL 27
                      VALUE "PRESS (ENTER) TO CONTINUE.".

       01 SC1-DATA-ITEM.
           03  SC1-COL-QTY PIC S9(7)V99 OCCURS 9 TIMES.
       01 COLUMN-TEST-SCREEN-MESSAGE PIC X(79) VALUE SPACES.

      ******************************************************************
123456*    This is a screen from RHS that wasn't working

000001 01  MESSAGE-SUMMARY USAGE DISPLAY-WS.
           05  SUMMARY-LINE-1 COLUMN 20 PIC X(50)
               SOURCE MESSAGE-SUMMARY-TOPLINE.
           05  FILLER ROW 2 OCCURS 23.
            10 FILLER ROW 2 COLUMN 02 PIC X(19) SOURCE SUMMARY-COLUMN-1.
            10 FILLER ROW 2 COLUMN 22 PIC X(19) SOURCE SUMMARY-COLUMN-2.
            10 FILLER ROW 2 COLUMN 42 PIC X(19) SOURCE SUMMARY-COLUMN-3.
            10 FILLER ROW 2 COLUMN 62 PIC X(19) SOURCE SUMMARY-COLUMN-4.

000001 01  MESSAGE-SUMMARY-TOPLINE.
           05  FILLER PIC X(50) VALUE 
               "MULTIPLE COLUMNS 4 x 23 = 92 ELEMENTS".

000001 77  TOTAL-MESSAGE-COUNT PIC 9(5) COMP.
       01  SUMMARY-COLUMNS.
           05  SUMMARY-ELEMENT OCCURS 92.
            10 SUMMARY-ELEMENT-ID      PIC XXX.
            10 SUMMARY-ELEMENT-GRP REDEFINES SUMMARY-ELEMENT-ID PIC XX.
            10 SUMMARY-ELEMENT-TO      PIC ZZZ9.
            10 SUMMARY-ELEMENTTO       PIC XXXX.    %   VALUE " TO;".
            10 SUMMARY-ELEMENT-BY      PIC ZZZ9.
            10 SUMMARY-ELEMENTBY       PIC XXXX.    %   VALUE " BY".
            10 J1                      PIC 9999 COMP.
            10 J2                      PIC 9999 COMP.
       01  FILLER REDEFINES SUMMARY-COLUMNS.
           05  SUMMARY-COLUMN-1 PIC X(25) OCCURS 23.
           05  SUMMARY-COLUMN-2 PIC X(25) OCCURS 23.
           05  SUMMARY-COLUMN-3 PIC X(25) OCCURS 23.
           05  SUMMARY-COLUMN-4 PIC X(25) OCCURS 23.

      ******************************************************************
       01  SCREEN-TOTAL USAGE IS DISPLAY-WS.
           03  FILLER PIC X(30) ROW 1 COL 25
               VALUE "DISPLAY & READ TOTAL TEST".
           03  FILLER PIC X(10) ROW 3 COL 5 VALUE "FLOAT KEY".
           03  FILLER PIC 99 ROW 3 COL 17 SOURCE FLOAT-KEY.
           03  FILLER PIC X(18) ROW 5 COL 5 VALUE "RANGE (YES ,NO)".
           03  FILLER PIC X(3)  ROW 5 COL 25 
               SOURCE IS YES-NO OBJECT IS YES-NO
      *$RANGE_COUNT 2
               RANGE IS YN-TABLE.
           03  FILLER PIC X(50) ROW 22 COL 25 
               VALUE "ONLY PFKEY (1), (2), (3), FLOAT-KEY, (16)".
           03  FILLER PIC X(50) ROW 23 COL 25 
               VALUE "ON   PFKEY       (3), FLOAT-KEY".
	   03  FILLER PIC X(50) ROW 24 COL 25
	       VALUE "Press (16) to exit loop".

       01  FLOAT-KEY PIC 99 VALUE 4.
       01  YES-NO    PIC XXX VALUE "YES".

       01  T1.
           03  ENTRIES.
               05  FILLER PIC XXX VALUE "YES".
               05  FILLER PIC XXX VALUE "NO ".
           03  FILLER REDEFINES ENTRIES.
               05  YN-TABLE OCCURS 2 TIMES PIC XXX.

      ******************************************************************
069200 01  QASCREEN-MENU USAGE IS DISPLAY-WS.
069300     03  FILLER  PIC X(11) ROW 1 COL 20 VALUE
069400         "TRY THINGS:".
069500     03  FILLER  PIC X(39) ROW 1 COL 60 VALUE
069600         "QASCREEN-MENU".
069700     03  FILLER  PIC X(35) ROW  3 COL 02 VALUE
069800         " (1) DISPLAY A COMPLEX SCREEN.".
069900     03  FILLER  PIC X(35) ROW  4 COL 02 VALUE
070000         " (2) TRY THE PF KEYS.".
070100     03  FILLER  PIC X(35) ROW  5 COL 02 VALUE
070200         " (3) PIC ZZ AND MISC.".
070300     03  FILLER  PIC X(37) ROW  6 COL 02 VALUE
070400         " (4) TEST COMPLX MUTIPLE DIMENSIONS.".
070500     03  FILLER  PIC X(35) ROW  7 COL 02 VALUE
070600         " (5) TEST SUBSTITUTION TABLE.".
070700     03  FILLER  PIC X(35) ROW  8 COL 02 VALUE
070800         " (6) DISPLAY VERB".
070900     03  FILLER  PIC X(35) ROW  9 COL 02 VALUE
071000         " (7) DISPLAY AND READ TOTAL TEST.".
071100     03  FILLER  PIC X(37) ROW 10 COL 02 VALUE
071200         " (8) MULTIPLE COLUMNS".
071300     03  FILLER  PIC X(35) ROW 11 COL 02 VALUE
071400         " (9) ALL FACs TEST".
071500     03  FILLER  PIC X(35) ROW 12 COL 02 VALUE
071600         "(10) COLUMN TEST.".
071700     03  FILLER  PIC X(35) ROW 13 COL 02 VALUE
071800         "(11) ".
071900     03  FILLER  PIC X(35) ROW 14 COL 02 VALUE
072000         "(12) DIRECT IO TESTS - QASCRN2".
072100     03  FILLER  PIC X(35) ROW 15 COL 02 VALUE
072200         "(13) ".
072300     03  FILLER  PIC X(35) ROW 16 COL 02 VALUE
072400         "(14) ".
072500     03  FILLER  PIC X(35) ROW 17 COL 02 VALUE
072600         "(15) ".
072700     03  FILLER  PIC X(35) ROW 19 COL 02 VALUE
072800         "(16) EXIT".
072900     03  FILLER  PIC X(35) ROW  3 COL 40 VALUE
073000         "(17) ".
073100     03  FILLER  PIC X(35) ROW  4 COL 40 VALUE
073200         "(18) ".
073300     03  FILLER  PIC X(35) ROW  5 COL 40 VALUE
073400         "(19) ".
073500     03  FILLER  PIC X(35) ROW  6 COL 40 VALUE
073600         "(20) ".
073700     03  FILLER  PIC X(35) ROW  7 COL 40 VALUE
073800         "(21) ".
073900     03  FILLER  PIC X(35) ROW  8 COL 40 VALUE
074000         "(22) ".
074100     03  FILLER  PIC X(35) ROW  9 COL 40 VALUE
074200         "(23) ".
074300     03  FILLER  PIC X(35) ROW 10 COL 40 VALUE
074400         "(24) ".
074500     03  FILLER  PIC X(35) ROW 11 COL 40 VALUE
074600         "(25) ".
074700     03  FILLER  PIC X(35) ROW 12 COL 40 VALUE
074800         "(26) ".
074900     03  FILLER  PIC X(35) ROW 13 COL 40 VALUE
075000         "(27) ".
075100     03  FILLER  PIC X(35) ROW 14 COL 40 VALUE
075200         "(28) ".
075300     03  FILLER  PIC X(35) ROW 15 COL 40 VALUE
075400         "(29) ".
075500     03  FILLER  PIC X(35) ROW 16 COL 40 VALUE
075600         "(30) ".
075700     03  FILLER  PIC X(35) ROW 17 COL 40 VALUE
075800         "(31) ".
075900     03  FILLER  PIC X(23) ROW 24 COL 20 VALUE
076000         "PRESS (16) TO EXIT".
076100
076200 01  SUB-LINE-1.
076300     03  FILLER    PIC X(2) VALUE SPACES.
076400     03  SUB-COL1  PIC X    VALUE SUB-1.
076500     03  FILLER    PIC X(3) VALUE SPACES.
076600     03  SUB-COL2  PIC X VALUE SUB-2.
076700     03  FILLER    PIC X(3) VALUE SPACES.
076800     03  SUB-COL3  PIC X VALUE SUB-3.
076900     03  FILLER    PIC X(3) VALUE SPACES.
077000     03  SUB-COL4  PIC X VALUE SUB-4.
077100     03  FILLER    PIC X(3) VALUE SPACES.
077200     03  SUB-COL5  PIC X VALUE SUB-5.
077300     03  FILLER    PIC X(3) VALUE SPACES.
077400     03  SUB-COL6  PIC X VALUE SUB-6.
077500     03  FILLER    PIC X(3) VALUE SPACES.
077600     03  SUB-COL7  PIC X VALUE SUB-7.
077700     03  FILLER    PIC X(3) VALUE SPACES.
077800     03  SUB-COL8  PIC X VALUE SUB-8.
077900     03  FILLER    PIC X(3) VALUE SPACES.
078000     03  SUB-COL9  PIC X VALUE SUB-9.
078100     03  FILLER    PIC X(3) VALUE SPACES.
078200     03  SUB-COL10 PIC X VALUE SUB-10.
078300     03  FILLER    PIC X(3) VALUE SPACES.
078400     03  SUB-COL11 PIC X VALUE SUB-11.
078500     03  FILLER    PIC X(3) VALUE SPACES.
078600     03  SUB-COL12 PIC X VALUE SUB-12.
078700     03  FILLER    PIC X(3) VALUE SPACES.
078800     03  SUB-COL13 PIC X VALUE SUB-13.
078900     03  FILLER    PIC X(3) VALUE SPACES.
079000     03  SUB-COL14 PIC X VALUE SUB-14.
079100     03  FILLER    PIC X(3) VALUE SPACES.
079200     03  SUB-COL15 PIC X VALUE SUB-15.
079300     03  FILLER    PIC X(3) VALUE SPACES.
079400     03  SUB-COL16 PIC X VALUE SUB-16.
079500     03  FILLER    PIC X(3) VALUE SPACES.
079600     03  SUB-COL17 PIC X VALUE SUB-17.
079700     03  FILLER    PIC X(3) VALUE SPACES.
079800     03  SUB-COL18 PIC X VALUE SUB-18.
079900     03  FILLER    PIC X(3) VALUE SPACES.
080000     03  SUB-COL19 PIC X VALUE SUB-19.
080100     03  FILLER    PIC X(3) VALUE SPACES.
080200     03  SUB-COL20 PIC X VALUE SUB-20.
080300
080400 01  SUB-LINE-2.
080500     03  FILLER    PIC X(2) VALUE SPACES.
080600     03  SUB-COL21 PIC X VALUE SUB-21.
080700     03  FILLER    PIC X(3) VALUE SPACES.
080800     03  SUB-COL22 PIC X VALUE SUB-22.
080900     03  FILLER    PIC X(3) VALUE SPACES.
081000     03  SUB-COL23 PIC X VALUE SUB-23.
081100     03  FILLER    PIC X(3) VALUE SPACES.
081200     03  SUB-COL24 PIC X VALUE SUB-24.
081300     03  FILLER    PIC X(3) VALUE SPACES.
081400     03  SUB-COL25 PIC X VALUE SUB-25.
081500     03  FILLER    PIC X(3) VALUE SPACES.
081600     03  SUB-COL26 PIC X VALUE SUB-26.
081700     03  FILLER    PIC X(3) VALUE SPACES.
081800     03  SUB-COL27 PIC X VALUE SUB-27.
081900     03  FILLER    PIC X(3) VALUE SPACES.
082000     03  SUB-COL28 PIC X VALUE SUB-28.
082100     03  FILLER    PIC X(3) VALUE SPACES.
082200     03  SUB-COL29 PIC X VALUE SUB-29.
082300     03  FILLER    PIC X(3) VALUE SPACES.
082400     03  SUB-COL30 PIC X VALUE SUB-30.
082500     03  FILLER    PIC X(3) VALUE SPACES.
082600     03  SUB-COL31 PIC X VALUE SUB-31.
082700     03  FILLER    PIC X(3) VALUE SPACES.
082800     03  SUB-COL21 PIC X VALUE SUB-96.
082900
083000 01  SUB-LINE-3.
083100     03  BT3-COL1   PIC X VALUE SUB-20.
083200     03  BT3-COL2   PIC X VALUE SUB-7.
083300     03  BT3-COL3   PIC X VALUE SUB-7.
083400     03  BT3-COL4   PIC X VALUE SUB-28.
083500     03  BT3-COL5   PIC X VALUE SUB-7.
083600     03  BT3-COL6   PIC X VALUE SUB-7.
083700     03  BT3-COL7   PIC X VALUE SUB-19.
083800
083900 01  SUB-LINE-4.
084000     03  BT4-COL1   PIC X VALUE SUB-6.
084100     03  FILLER     PIC X(2) VALUE SPACES.
084200     03  BT4-COL4   PIC X VALUE SUB-6.
084300     03  FILLER     PIC X(2) VALUE SPACES.
084400     03  BT4-COL7   PIC X VALUE SUB-6.
084500
084600 01  SUB-LINE-5.
084700     03  BT-COL1   PIC X VALUE SUB-24.
084800     03  BT-COL2   PIC X VALUE SUB-7.
084900     03  BT-COL3   PIC X VALUE SUB-7 .
085000     03  BT-COL4   PIC X VALUE SUB-14.
085100     03  BT-COL5   PIC X VALUE SUB-7.
085200     03  BT-COL6   PIC X VALUE SUB-7.
085300     03  BT-COL7   PIC X VALUE SUB-25.
085400
085500 01  SUB-LINE-6.
085600     03  BT-COL1   PIC X VALUE SUB-21.
085700     03  BT-COL2   PIC X VALUE SUB-7.
085800     03  BT-COL3   PIC X VALUE SUB-7.
085900     03  BT-COL4   PIC X VALUE SUB-27.
086000     03  BT-COL5   PIC X VALUE SUB-7.
086100     03  BT-COL6   PIC X VALUE SUB-7.
086200     03  BT-COL7   PIC X VALUE SUB-18.
086300
       01  ALL-FAC-SCREEN-DATA.
           05  FS80  PIC X(30) VALUE "TEST TEST TEST".
           05  FS84  PIC X(30) VALUE "TEST TEST TEST".
           05  FS88  PIC X(30) VALUE "TEST TEST TEST".
           05  FS8C  PIC X(30) VALUE "TEST TEST TEST".
           05  FS90  PIC X(30) VALUE "TEST TEST TEST".
           05  FS94  PIC X(30) VALUE "TEST TEST TEST".
           05  FS98  PIC X(30) VALUE "TEST TEST TEST".
           05  FS9C  PIC X(30) VALUE "TEST TEST TEST".
           05  FSA0  PIC X(30) VALUE "TEST TEST TEST".
           05  FSA4  PIC X(30) VALUE "TEST TEST TEST".
           05  FSA8  PIC X(30) VALUE "TEST TEST TEST".
           05  FSAC  PIC X(30) VALUE "TEST TEST TEST".
           05  FSB0  PIC X(30) VALUE "TEST TEST TEST".
           05  FSB4  PIC X(30) VALUE "TEST TEST TEST".
           05  FSB8  PIC X(30) VALUE "TEST TEST TEST".
           05  FSBC  PIC X(30) VALUE "TEST TEST TEST".

089700*89|123456789|123456789|123456789|123456789|123456789|123456789|12
089800 01  ALL-FAC-SCREEN USAGE IS DISPLAY-WS.
089900     05  FILLER PIC X(30)     ROW 1 COL 25  VALUE
090000         "  * * * ALL-FAC-SCREEN * * *".
      
           05  PIC X(35) ROW  4 COL  2 VALUE "80  NOLINE BRIGHT MOD ".
           05  PIC X(35) ROW  4 COL 42 VALUE "84  NOLINE BRIGHT PROT".
           05  PIC X(35) ROW  6 COL  2 VALUE "88  NOLINE DIM    MOD ".
           05  PIC X(35) ROW  6 COL 42 VALUE "8C  NOLINE DIM    PROT".
           05  PIC X(35) ROW  8 COL  2 VALUE "90  NOLINE BLINK  MOD ".
           05  PIC X(35) ROW  8 COL 42 VALUE "94  NOLINE BLINK  PROT".
           05  PIC X(35) ROW 10 COL  2 VALUE "98  NOLINE BLANK  MOD ".
           05  PIC X(35) ROW 10 COL 42 VALUE "9C  NOLINE BLANK  PROT".
           05  PIC X(35) ROW 12 COL  2 VALUE "A0    LINE BRIGHT MOD ".
           05  PIC X(35) ROW 12 COL 42 VALUE "A4    LINE BRIGHT PROT".
           05  PIC X(35) ROW 14 COL  2 VALUE "A8    LINE DIM    MOD ".
           05  PIC X(35) ROW 14 COL 42 VALUE "AC    LINE DIM    PROT".
           05  PIC X(35) ROW 16 COL  2 VALUE "B0    LINE BLINK  MOD ".
           05  PIC X(35) ROW 16 COL 42 VALUE "B4    LINE BLINK  PROT".
           05  PIC X(35) ROW 18 COL  2 VALUE "B8    LINE BLANK  MOD ".
           05  PIC X(35) ROW 18 COL 42 VALUE "BC    LINE BLANK  PROT".

           05  AF-80  PIC X(30) ROW  5 COL  6 SOURCE FS80 OBJECT FS80.
           05  AF-84  PIC X(30) ROW  5 COL 46 SOURCE FS84 OBJECT FS84.
           05  AF-88  PIC X(30) ROW  7 COL  6 SOURCE FS88 OBJECT FS88.
           05  AF-8C  PIC X(30) ROW  7 COL 46 SOURCE FS8C OBJECT FS8C.
           05  AF-90  PIC X(30) ROW  9 COL  6 SOURCE FS90 OBJECT FS90.
           05  AF-94  PIC X(30) ROW  9 COL 46 SOURCE FS94 OBJECT FS94.
           05  AF-98  PIC X(30) ROW 11 COL  6 SOURCE FS98 OBJECT FS98.
           05  AF-9C  PIC X(30) ROW 11 COL 46 SOURCE FS9C OBJECT FS9C.
           05  AF-A0  PIC X(30) ROW 13 COL  6 SOURCE FSA0 OBJECT FSA0.
           05  AF-A4  PIC X(30) ROW 13 COL 46 SOURCE FSA4 OBJECT FSA4.
           05  AF-A8  PIC X(30) ROW 15 COL  6 SOURCE FSA8 OBJECT FSA8.
           05  AF-AC  PIC X(30) ROW 15 COL 46 SOURCE FSAC OBJECT FSAC.
           05  AF-B0  PIC X(30) ROW 17 COL  6 SOURCE FSB0 OBJECT FSB0.
           05  AF-B4  PIC X(30) ROW 17 COL 46 SOURCE FSB4 OBJECT FSB4.
           05  AF-B8  PIC X(30) ROW 19 COL  6 SOURCE FSB8 OBJECT FSB8.
           05  AF-BC  PIC X(30) ROW 19 COL 46 SOURCE FSBC OBJECT FSBC.

094200     05  FILLER PIC X(40) ROW 24 COL 25 VALUE
094300         "PRESS (ENTER) TO CONTINUE".
094400
094500/*****************************************************************
094600*                                                                *
094700*                         PROCEDURE DIVISION                     *
094800*                                                                *
094900******************************************************************
095000*
095100 PROCEDURE DIVISION.
095200
095300 QASCREEN-MENU-LOOP.
095400
095500     DISPLAY AND READ QASCREEN-MENU ON CRT
095600     ONLY PFKEYS 1, 2, 3, 4, 5, 6, 7, 8,  9, 10, 12,  16.
095900
096000     IF PF-KEY = "01" THEN
096100        PERFORM DISPLAY-SCREEN
096200        
096300     ELSE IF PF-KEY = "02" THEN
096400        PERFORM TRY-PF-KEYS
096500        
096600     ELSE IF PF-KEY = "03" THEN
096700        PERFORM DISPLAY-MISC THRU DISPLAY-MISC-EXIT
096800        
096900     ELSE IF PF-KEY = "04" THEN
097100        PERFORM DO-MATRIX
097300        
097400     ELSE IF PF-KEY = "05" THEN
097600        PERFORM DO-SCREEN-SUBTEST

           ELSE IF PF-KEY = "06" THEN
123456*78901234567890123456789012345678901234567890123456789012345678901
      *
      * Note A DISPLAY VERB does 79 characters per line.
      *
              DISPLAY 
           "123456789012345678901234567890123456789012345678901234567890
      -    "1234567890123456789"
           "<2>         *** THIS IS A TEST OF THE DISPLAY VERB ***       
      -    "                   "
           "<3>
      -    "                   "
           "<4>  Four lines item are sent to the screen. "

           ELSE IF PF-KEY = "07" THEN
              PERFORM DISPLAY-TOTAL

           ELSE IF PF-KEY = "08" THEN
              PERFORM RHS-TEST
098700        
098800     ELSE IF PF-KEY = "09" THEN
098900        PERFORM ALL-FAC-TEST

           ELSE IF PF-KEY = "10" THEN
              PERFORM COLUMN-TEST-PARA
099000        
099100     ELSE IF PF-KEY = "12" THEN
099200        CALL "QASCRN2"
099300        

100000     ELSE IF PF-KEY = "16" THEN
100100        GO TO EXIT-PROGRAM.
100200
100400
100500     GO TO QASCREEN-MENU-LOOP.
100600
100700 DISPLAY-SCREEN.
100800******************************************************************
100900* FIRST MAKE SURE THE SCREEN ITEMS GET THERE INITIAL VALUES.     *
101000******************************************************************
101100     PERFORM INITIALIZE-SCREEN-OCC-1.
101200
101300     MOVE "BAILEYS" TO SRC-TAG-FIELD(1, 1).
101400     MOVE "Smiths " TO SRC-TAG-FIELD(2, 1).
101500     MOVE "Holmes " TO SRC-TAG-FIELD(3, 1).
101600
101700     MOVE "LAUNCH  " TO PROJ-TAG-FIELD(1, 1).
101800     MOVE "ORBIT   " TO PROJ-TAG-FIELD(2, 1).
101900     MOVE "SPACE   " TO PROJ-TAG-FIELD(3, 1).
102000
102100     MOVE "INITIAL LAUNCH PROCEDURE   " TO
102200          PROJ-DESC-FIELD(1, 1).
102300     MOVE "ENTER ASYNCHRONOUS ORBIT   " TO
102400          PROJ-DESC-FIELD(2, 1).
102500     MOVE "STUDY THE EFFECTS OF SPACE " TO
102600          PROJ-DESC-FIELD(3, 1).
102700
102800     MOVE "SUPER LAUNCH COMPANY     " TO
102900          ACCOUNT-FIELD(1, 1).
103000     MOVE "GREAT ORBITER CORPORATION" TO
103100          ACCOUNT-FIELD(2, 1).
103200     MOVE "SPACE EFFECT INCORPORATED" TO
103300          ACCOUNT-FIELD(3, 1).
103400
103500******************************************************************
103600* SET UP A FIELD TO ACT AS A NON-ECHO PASSWORD FIELD.
103700******************************************************************
103800
103900     MOVE NO-ECHO TO FAC OF PASSWORD-ITEM.
104000
104100     SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(1, 1) OFF.
104200     SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(2, 1) OFF.
104300     SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(3, 1) OFF.
104400
104500     SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(1, 1) OFF.
104600     SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(2, 1) OFF.
104700     SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(3, 1) OFF.
104800
104900     SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(1, 1) OFF.
105000     SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(2, 1) OFF.
105100     SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(3, 1) OFF.
105200
105300     SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(1, 1) OFF.
105400     SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(2, 1) OFF.
105500     SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(3, 1) OFF.
105600
105700     SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(1, 1) OFF.
105800     SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(2, 1) OFF.
105900     SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(3, 1) OFF.
106000
106100     SET BLINK-BIT IN FAC OF AMOUNT-ITEM-4(3, 1) ON.
106200
106300******************************************************************
106400* SET UP FIELD TO ACT SUPRESSED PROTECTED.
106500******************************************************************
106600
106700     MOVE HEX-9C TO FAC OF BLPRO-ITEM.
106900
107000******************************************************************
107100* NOW DISPLAY THE FIRST SCREEN
107200******************************************************************
107300
107400     DISPLAY AND READ SCREEN-1 ON CRT
107500     PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16,
107600            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
107700            30, 31, 32.
107800
108300******************************************************************
108400* PROTECT ALL THE FIELDS THAT WERE MODIFIABLE.
108500******************************************************************
108600
108700     SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(1, 1) ON.
108800     SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(2, 1) ON.
108900     SET PROTECT-BIT IN FAC OF SOURCE-ITEM-4(3, 1) ON.
109000
109100     SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(1, 1) ON.
109200     SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(2, 1) ON.
109300     SET PROTECT-BIT IN FAC OF PROJECT-ITEM-4(3, 1) ON.
109400
109500
109600     SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(1, 1) ON.
109700     SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(2, 1) ON.
109800     SET PROTECT-BIT IN FAC OF ACCOUNT-DESC-ITEM-4(3, 1) ON.
109900
110000     SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(1, 1) ON.
110100     SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(2, 1) ON.
110200     SET PROTECT-BIT IN FAC OF DIST-PCT-ITEM-4(3, 1) ON.
110300
110400     SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(1, 1) ON.
110500     SET PROTECT-BIT IN FAC OF AMOUNT-ITEM-4(2, 1) ON.
110600
110700******************************************************************
110800* MAKE THE PASSWORD FIELD VISIBLE AND BLINING.
110900******************************************************************
111000
111100     MOVE BLINKING-DISPLAY TO FAC OF PASSWORD-ITEM.
111200
111300******************************************************************
111400* RE DISPLAY THE FIELDS
111500******************************************************************
111600
111700     DISPLAY AND READ SCREEN-1 ON CRT.
111800
111900 TRY-PF-KEYS.
111910     PERFORM TEST AFTER UNTIL PF-KEY = "00"
112000        DISPLAY AND READ KEYBOARD-TEST-SCREEN ON CRT
112100           PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
112200           14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
112300           27, 28, 29, 30, 31, 32
112400     END-PERFORM.
113600
113700 DISPLAY-MISC.
113800     SET PROTECT-BIT IN FAC OF MISC-ROW03 OFF.
113900     SET PROTECT-BIT IN FAC OF MISC-ROW04 OFF.
114000     SET PROTECT-BIT IN FAC OF MISC-ROW05 OFF.
114100     SET PROTECT-BIT IN FAC OF MISC-ROW06 OFF.
114200     SET PROTECT-BIT IN FAC OF MISC-ROW07 OFF.
114300     SET PROTECT-BIT IN FAC OF MISC-ROW08 OFF.
114400     SET PROTECT-BIT IN FAC OF MISC-ROW09 OFF.
114500     SET PROTECT-BIT IN FAC OF MISC-ROW10 OFF.
114600     SET PROTECT-BIT IN FAC OF MISC-ROW11 OFF.
114700     SET PROTECT-BIT IN FAC OF MISC-ROW12 OFF.
114800     SET PROTECT-BIT IN FAC OF MISC-ROW13 OFF.
114900     SET PROTECT-BIT IN FAC OF MISC-ROW14 OFF.
115000     SET PROTECT-BIT IN FAC OF MISC-ROW15 OFF.
115100     SET PROTECT-BIT IN FAC OF MISC-ROW16 OFF.
115200     SET PROTECT-BIT IN FAC OF MISC-ROW17 OFF.
115300     SET PROTECT-BIT IN FAC OF MISC-ROW18 OFF.
115400     SET PROTECT-BIT IN FAC OF MISC-ROW19 OFF.
115500     SET PROTECT-BIT IN FAC OF MISC-ROW20 OFF.
115600     SET PROTECT-BIT IN FAC OF MISC-ROW21 OFF.
115700     SET PROTECT-BIT IN FAC OF MISC-ROW22 OFF.
115800     SET PROTECT-BIT IN FAC OF MISC-ROW23 OFF.
115900     MOVE BRITE-MOD-ALL TO FAC OF MISC-ROW23.
116000
116100     DISPLAY AND READ MISC-SCREEN ON CRT
116200         PFKEY 16
116300         ON PFKEY 16 GO TO DISPLAY-MISC-EXIT.
116400
116500     SET PROTECT-BIT IN FAC OF MISC-ROW03 ON.
116600     SET PROTECT-BIT IN FAC OF MISC-ROW04 ON.
116700     SET PROTECT-BIT IN FAC OF MISC-ROW05 ON.
116800     SET PROTECT-BIT IN FAC OF MISC-ROW06 ON.
116900     SET PROTECT-BIT IN FAC OF MISC-ROW07 ON.
117000     SET PROTECT-BIT IN FAC OF MISC-ROW08 ON.
117100     SET PROTECT-BIT IN FAC OF MISC-ROW09 ON.
117200     SET PROTECT-BIT IN FAC OF MISC-ROW10 ON.
117300     SET PROTECT-BIT IN FAC OF MISC-ROW11 ON.
117400     SET PROTECT-BIT IN FAC OF MISC-ROW12 ON.
117500     SET PROTECT-BIT IN FAC OF MISC-ROW13 ON.
117600     SET PROTECT-BIT IN FAC OF MISC-ROW14 ON.
117700     SET PROTECT-BIT IN FAC OF MISC-ROW15 ON.
117800     SET PROTECT-BIT IN FAC OF MISC-ROW16 ON.
117900     SET PROTECT-BIT IN FAC OF MISC-ROW17 ON.
118000     SET PROTECT-BIT IN FAC OF MISC-ROW18 ON.
118100     SET PROTECT-BIT IN FAC OF MISC-ROW19 ON.
118200     SET PROTECT-BIT IN FAC OF MISC-ROW20 ON.
118300     SET PROTECT-BIT IN FAC OF MISC-ROW21 ON.
118400     SET PROTECT-BIT IN FAC OF MISC-ROW22 ON.
118500     SET PROTECT-BIT IN FAC OF MISC-ROW23 ON.
118600     MOVE DIM-PROT-ALL TO FAC OF MISC-ROW23.
118700
118800     DISPLAY AND READ MISC-SCREEN ON CRT
118900         PFKEY 16
119000         ON PFKEY 16 GO TO DISPLAY-MISC-EXIT.
119100
119200     GO TO DISPLAY-MISC.
119300 DISPLAY-MISC-EXIT.
119400     EXIT.
120300
120400 INITIALIZE-SCREEN-OCC-1.
120500
120600     PERFORM INIT-THE-ARRAY VARYING MY-INDEX FROM 1 BY 1 UNTIL
120700             MY-INDEX IS > 3.
120800
120900 INIT-THE-ARRAY.
121000     MOVE "BLANK" TO ACCOUNT-FIELD (MY-INDEX, 1).
121100     MOVE "BLANK" TO ACCOUNT-DESC-FIELD (MY-INDEX, 1).
121200     MOVE "BLANK" TO SRC-TAG-FIELD (MY-INDEX, 1).
121300     MOVE "BLANK" TO SOURCE-FIELD (MY-INDEX, 1).
121400     MOVE "BLANK" TO PROJ-TAG-FIELD (MY-INDEX, 1).
121500     MOVE "BLANK" TO PROJECT-FIELD (MY-INDEX, 1).
121600     MOVE "BLANK" TO PROJ-DESC-FIELD (MY-INDEX, 1).
121700
121800     MOVE 1 TO DIST-PCT-FIELD (MY-INDEX, 1).
121900     MOVE 2 TO AMOUNT-FIELD  (MY-INDEX, 1).
122000
122100  END-INIT-SCREEN.
122200
122300******************************************************************
122400
122500 DO-WISPSYNC.
122600*$WANG_CODE
122700     DISPLAY AND READ SYNC-SCREEN1 ON CRT.
122800     CALL "MESSUP".
122900     DISPLAY AND READ SYNC-SCREEN2 ON CRT.
123000     CALL "WISPSYNC".
123100     DISPLAY AND READ SYNC-SCREEN3 ON CRT.
123200*$WANG_END
123300
123400******************************************************************
123500
123600 DO-MATRIX.
123700
123800     PERFORM INIT-MATRIX-D1 VARYING INDEX-D1 FROM 1 BY 1
123900             UNTIL INDEX-D1 IS > 3.
124000
124100     DISPLAY AND READ MATRIX-SCREEN ON CRT.
124200
124300 INIT-MATRIX-D1.
124400     MOVE INDEX-D1 TO MATRIX-D1.
124500
124600     PERFORM INIT-MATRIX-D2-1 VARYING INDEX-D2 FROM 1 BY 1
124700             UNTIL INDEX-D2 IS > 2.
124800
124900     PERFORM INIT-MATRIX-D2-2 VARYING INDEX-D2 FROM 1 BY 1
125000             UNTIL INDEX-D2 IS > 4.
125100
125200 INIT-MATRIX-D2-1.
125300     MOVE INDEX-D2 TO MATRIX-D2.
125400
125500     PERFORM INIT-MATRIX-D3-1 VARYING INDEX-D3 FROM 1 BY 1
125600             UNTIL INDEX-D3 IS > 8.
125700
125800 INIT-MATRIX-D2-2.
125900     MOVE INDEX-D2 TO MATRIX-D2.
126000
126100     PERFORM INIT-MATRIX-D3-2 VARYING INDEX-D3 FROM 1 BY 1
126200             UNTIL INDEX-D3 IS > 7.
126300
126400 INIT-MATRIX-D3-1.
126500     MOVE INDEX-D3 TO MATRIX-D3.
126600     MOVE MATRIX-ITEM TO
126700          MATRIX-DATE-SOURCE(INDEX-D1, INDEX-D2, INDEX-D3).
126800
126900 INIT-MATRIX-D3-2.
127000     MOVE INDEX-D3 TO MATRIX-D3.
127100     MOVE MATRIX-ITEM TO
127200          MATRIX-GROUP-SOURCE(INDEX-D1, INDEX-D2, INDEX-D3).
127300
127400******************************************************************
136100
136200 DO-SCREEN-SUBTEST.
136300     DISPLAY AND READ SCREEN-SUBT ON CRT.
136400
136500
137000
137100******************************************************************
137200 ALL-FAC-TEST.
137300     MOVE HEX-80 TO FAC OF AF-80.
137400     MOVE HEX-84 TO FAC OF AF-84.
137500     MOVE HEX-88 TO FAC OF AF-88.
137600     MOVE HEX-8C TO FAC OF AF-8C.
137700
137800     MOVE HEX-90 TO FAC OF AF-90.
137900     MOVE HEX-94 TO FAC OF AF-94.
138000     MOVE HEX-98 TO FAC OF AF-98.
138100     MOVE HEX-9C TO FAC OF AF-9C.
138200
138300     MOVE HEX-A0 TO FAC OF AF-A0.
138400     MOVE HEX-A4 TO FAC OF AF-A4.
138500     MOVE HEX-A8 TO FAC OF AF-A8.
138600     MOVE HEX-AC TO FAC OF AF-AC.
138700
138800     MOVE HEX-B0 TO FAC OF AF-B0.
138900     MOVE HEX-B4 TO FAC OF AF-B4.
139000     MOVE HEX-B8 TO FAC OF AF-B8.
139100     MOVE HEX-BC TO FAC OF AF-BC.
139200
139300     DISPLAY AND READ ALL-FAC-SCREEN ON CRT.
139400
139500******************************************************************
139600
       COLUMN-TEST-PARA.
           MOVE 0 TO SC1-COL-QTY(1).
           MOVE 0 TO SC1-COL-QTY(2).
           MOVE 0 TO SC1-COL-QTY(3).
           MOVE 0 TO SC1-COL-QTY(4).
           MOVE 0 TO SC1-COL-QTY(5).
           MOVE 0 TO SC1-COL-QTY(6).
           MOVE 0 TO SC1-COL-QTY(7).
           MOVE 0 TO SC1-COL-QTY(8).
           MOVE 0 TO SC1-COL-QTY(9).

           MOVE "1 of 2" TO COLUMN-TEST-SCREEN-MESSAGE.
           DISPLAY AND READ COLUMN-TEST-SCREEN ON CRT.

           MOVE "2 of 2" TO COLUMN-TEST-SCREEN-MESSAGE.
           DISPLAY AND READ COLUMN-TEST-SCREEN ON CRT.

139500******************************************************************
       RHS-TEST.
           PERFORM RHS-SETUP VARYING TOTAL-MESSAGE-COUNT FROM 1 BY 1
                             UNTIL TOTAL-MESSAGE-COUNT > 92.
           PERFORM RHS-DR.

       RHS-DR.
           DISPLAY AND READ MESSAGE-SUMMARY ON CRT.

       RHS-SETUP.
           MOVE "(( " TO SUMMARY-ELEMENT-ID ( TOTAL-MESSAGE-COUNT ).
           MOVE " ) (" TO SUMMARY-ELEMENTTO ( TOTAL-MESSAGE-COUNT ).
           MOVE " )) " TO SUMMARY-ELEMENTBY ( TOTAL-MESSAGE-COUNT ).
           MOVE TOTAL-MESSAGE-COUNT TO
                SUMMARY-ELEMENT-TO ( TOTAL-MESSAGE-COUNT )
                SUMMARY-ELEMENT-BY ( TOTAL-MESSAGE-COUNT )
                J1 ( TOTAL-MESSAGE-COUNT )
                J2 ( TOTAL-MESSAGE-COUNT ).

      ******************************************************************

       DISPLAY-TOTAL.

       	   DISPLAY "DISPLAY AND READ TOTAL TEST LOOP".
		   
           MOVE 4 TO FLOAT-KEY.

           DISPLAY AND READ ALTERED SCREEN-TOTAL ON CRT
           ONLY PFKEY 1, 2, 3, FLOAT-KEY, 16
           ON PFKEY FLOAT-KEY, 3
                PERFORM ON-PFKEY-PARA
           NO-MOD 
                PERFORM NO-MOD-PARA.

       	   IF PF-KEY NOT = 16 THEN
	       GO DISPLAY-TOTAL.
		
       ON-PFKEY-PARA.
           DISPLAY "ON-PFKEY: PFKEY " PF-KEY " WAS PRESSED".
       NO-MOD-PARA.
           DISPLAY "NO MODS WERE MADE ON THIS SCREEN".

      ******************************************************************

139700******************************************************************
139800* ALL DONE.
139900******************************************************************
140000
140100 EXIT-PROGRAM.
140200     EXIT PROGRAM.
140300
140400 STOP-RUN.
140500     STOP RUN.
