000100* $Id:$
000200/*****************************************************************
000300*                                                                *
000400*                       IDENTIFICATION DIVISION                  *
000500*                                                                *
000600******************************************************************
000700*
000800 IDENTIFICATION DIVISION.
000900 PROGRAM-ID.
001000     QASUBS.
001100 AUTHOR.
001200     Greg Lindholm.
001300 DATE-WRITTEN.
001400     12/08/89.
001500/*****************************************************************
001600*                                                                *
001700*                         ENVIRONMENT DIVISION                   *
001800*                                                                *
001900******************************************************************
002000*
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.
002400     WANG-VS.
002500 OBJECT-COMPUTER.
002600     WANG-VS.
002700 FIGURATIVE-CONSTANTS.
002800     BLINK-BIT IS "10"
002900     PROTECT-BIT IS "04"
003000     DIM-BIT IS "08"
003100     TAB-STOP IS "86"
003200     BLINKING-DISPLAY IS "94"
003300     LOWER-FAC IS "80"
003400     BRITE IS "84"
003500     NO-ECHO IS "98"
003501     FAC-MOD IS "81"
003502     FAC-LINE IS "AD"
003600     PFK-NOT-SET IS "00"
003700     PFK-SET IS "01"
003800     HEX-00 IS "00", HEX-01 IS "01", HEX-20 IS "20",
003900     HEX-40 IS "40", HEX-80 IS "80", HEX-A0 IS "A0".
004000
004100/*****************************************************************
004200*                                                                *
004300*                         INPUT-OUTPUT SECTION                   *
004400*                                                                *
004500******************************************************************
004600*
004700 INPUT-OUTPUT SECTION.
004800 FILE-CONTROL.
004900*
005000     SELECT CRT
005100         ASSIGN TO "CRT",      "DISPLAY",
005200         ORGANIZATION    IS SEQUENTIAL
005300         ACCESS MODE     IS RANDOM
005400         RELATIVE KEY    IS LINENUM
005500         PFKEY           IS PF-KEY
005600         CURSOR POSITION IS CURSOR-POS
005700         FILE STATUS     IS FILSTAT.
005800
005900     SELECT CRT-OA-ONLY
006000         ASSIGN TO "OAONLY",      "DISPLAY",
006100         ORGANIZATION    IS SEQUENTIAL
006200         ACCESS MODE     IS RANDOM
006300         RELATIVE KEY    IS LINENUM
006400         PFKEY           IS PF-KEY
006500         CURSOR POSITION IS CURSOR-POS
006600         FILE STATUS     IS FILSTAT.
006700
	   SELECT SORTCALL-REC45
               ASSIGN TO "REC45",    "DISK",     NODISPLAY,
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS SEQUENTIAL
               FILE STATUS     IS SC-FILESTAT.

	   SELECT SORTCALL-REC55
               ASSIGN TO "REC55",    "DISK",     NODISPLAY,
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS SEQUENTIAL
               FILE STATUS     IS SC-FILESTAT.

	   SELECT SORTCALL-REC80
               ASSIGN TO "REC80",    "DISK",     NODISPLAY,
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS SEQUENTIAL
               FILE STATUS     IS SC-FILESTAT.

	   SELECT SORTCALL-REC90
               ASSIGN TO "REC90",    "DISK",     NODISPLAY,
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS SEQUENTIAL
               FILE STATUS     IS SC-FILESTAT.
006800
006900/*****************************************************************
007000*                                                                *
007100*                      DATA DIVISION - FILE SECTION              *
007200*                                                                *
007300******************************************************************
007400*
007500 DATA DIVISION.
007600 FILE SECTION.
       
       FD  CRT
           LABEL RECORDS ARE OMITTED.
       01  CRTREC.
           03  CRTREC-OA.
               05  CRTREC-OA-1             PIC X.
               05  CRTREC-OA-2             PIC X.
               05  CRTREC-OA-3             PIC X.
               05  CRTREC-OA-4             PIC X.
           03  CRTREC-MAPPING-AREA.
               05  CRTREC-ROW  OCCURS 24 TIMES.
                   10 CRTREC-X OCCURS 80 TIMES PIC X.
      
008200 FD  CRT-OA-ONLY
008300     LABEL RECORDS ARE OMITTED.
008400 01  CRT-OA-ONLY-REC                PIC X(4).
008500
      
       FD  SORTCALL-REC45
           VALUE OF FILENAME IS SC-OUTFILE
                    LIBRARY  IS SC-OUTLIB
                    VOLUME   IS SC-OUTVOL.

       01  SC-REC45.
           03  SC-REC45-KEY                 PIC 9(10).
           03  SC-REC45-F1                  PIC X(35).
      
       FD  SORTCALL-REC55
           VALUE OF FILENAME IS SC-OUTFILE
                    LIBRARY  IS SC-OUTLIB
                    VOLUME   IS SC-OUTVOL.

       01  SC-REC55.
           03  SC-REC55-KEY                 PIC 9(10).
           03  SC-REC55-ALT1                PIC 9(5).
           03  SC-REC55-ALT2                PIC 9(5).
           03  SC-REC55-F1                  PIC X(35).
      
       FD  SORTCALL-REC80
           VALUE OF FILENAME IS SC-OUTFILE
                    LIBRARY  IS SC-OUTLIB
                    VOLUME   IS SC-OUTVOL.

       01  SC-REC80.
           03  SC-REC80-KEY                 PIC 9(10).
           03  SC-REC80-F1                  PIC X(35).
           03  SC-REC80-F2                  PIC X(35).
      
       FD  SORTCALL-REC90
           VALUE OF FILENAME IS SC-OUTFILE
                    LIBRARY  IS SC-OUTLIB
                    VOLUME   IS SC-OUTVOL.

       01  SC-REC90.
           03  SC-REC90-KEY                 PIC 9(10).
           03  SC-REC90-ALT1                PIC 9(5).
           03  SC-REC90-ALT2                PIC 9(5).
           03  SC-REC90-F1                  PIC X(35).
           03  SC-REC90-F2                  PIC X(35).
008600
008700*
008800/*****************************************************************
008900*                                                                *
009000*                         WORKING STORAGE                        *
009100*                                                                *
009200******************************************************************
009300*
009400 WORKING-STORAGE SECTION.
009500
009501 COPY SOFTLINK.
009502 COPY WISPPLAT.
009503
009600 01  INDEX-COUNTER                  PIC 9(5).
009700 01  FILSTAT.
009800     03  ERR-FLAG                   PIC X(01).
009900     03  PFK-BYTE                   PIC X(01).
010000
010100 77  LINENUM                        PIC 9(02) VALUE 1.
010200 77  PF-KEY                         PIC X(02) VALUE ZERO.
010300
010400 01  CURSOR-POS.
010500     03  MOD-COL                    BINARY.
010600     03  MOD-ROW                    BINARY.
010700
010800 01  REDEF-CURS-POS                 REDEFINES CURSOR-POS.
010900     03  FILLER                     PIC X(01).
011000     03  CURS-COL                   PIC X(01).
011100     03  FILLER                     PIC X(01).
011200     03  CURS-ROW                   PIC X(01).
011300

      ******************************************************************
       01  PROGRESS-ROW-NUM		  PIC 99 VALUE 1.
       01  NEXT-PROGRESS-ROW	          PIC X(79) VALUE SPACES.

       01  PROGRESS-TITLE  PIC X(40) VALUE "PROGRESS SCREEN TITLE".
       01  PROGRESS-FOOTER PIC X(40) VALUE "PROGRESS SCREEN FOOTER".
       01  PROGRESS-ROWS.
           05  FILLER OCCURS 20 TIMES.
	       10  PROGRESS-ROW PIC X(79).

       01  PROGRESS-LOCK-ORDER-AREA.
           05  PROGRESS-LOCK-OA-ROW     PIC X VALUE HEX-01.
           05  PROGRESS-LOCK-OA-WCC     PIC X VALUE HEX-20.
           05  PROGRESS-LOCK-OA-CCOL    PIC X VALUE HEX-01.
           05  PROGRESS-LOCK-OA-CROW    PIC X VALUE HEX-01.

       01  PROGRESS-UNLOCK-ORDER-AREA.
           05  PROGRESS-UNLOCK-OA-ROW     PIC X VALUE HEX-01.
           05  PROGRESS-UNLOCK-OA-WCC     PIC X VALUE HEX-80.
           05  PROGRESS-UNLOCK-OA-CCOL    PIC X VALUE HEX-01.
           05  PROGRESS-UNLOCK-OA-CROW    PIC X VALUE HEX-01.
           
       01  PROGRESS-SCREEN USAGE IS DISPLAY-WS.
           05  FILLER PIC X(40)      ROW  1 COLUMN 20
               SOURCE PROGRESS-TITLE.
           05  FILLER OCCURS 20 TIMES.
	       10  FILLER PIC X(79)  ROW  3 COLUMN  2
	           SOURCE PROGRESS-ROW.
           05  FILLER PIC X(40)      ROW 24 COLUMN 20
               SOURCE PROGRESS-FOOTER.

      ******************************************************************
       
011400******************************************************************
011500
011600 01  FIL-GEN-FILE                   PIC X(8) VALUE "BFILE".
011700 01  LIB-GEN-FILE                   PIC X(8) VALUE SPACES.
011800 01  VOL-GEN-FILE                   PIC X(6) VALUE SPACES.
011900
012000******************************************************************
012100
012200 01  DISPLAY-PROG                   PIC X(8) VALUE "DISPLAY ".
012300
012400******************************************************************
012500
012600
012700 01  RCOUNT PIC 9(10).
012800 01  RNUM   PIC 9(10).
012900
013000******************************************************************
013100
013200 01  MY-EXT                     PIC X(39) VALUE SPACES.
013300
013400 01  FIND-FILE                  PIC X(8) VALUE SPACES.
013500 01  FIND-LIB                   PIC X(8) VALUE SPACES.
013600 01  FIND-VOL                   PIC X(6) VALUE SPACES.
013601 01  FIND-FAILED                PIC 9999.
013700
013800 01  FIND-STARTER.
013900     03 FIND-STARTER-1 BINARY    VALUE ZERO.
014000     03 FIND-STARTER-2 BINARY    VALUE ZERO.
014100 01  FIND-STARTER-X    PIC S9999 VALUE ZERO.
014200
014300 01  FIND-COUNTER.
014400     03 FIND-COUNTER-1 BINARY    VALUE ZERO.
014500     03 FIND-COUNTER-2 BINARY    VALUE ZERO.
014600 01  FIND-COUNTER-X    PIC S9999 VALUE ZERO.
014700
014800 01  FIND-FILE-COUNT.
014900     03 FIND-FILE-COUNT-1 BINARY    VALUE ZERO.
015000     03 FIND-FILE-COUNT-2 BINARY    VALUE ZERO.
015100 01  FIND-FILE-COUNT-X    PIC S9999 VALUE ZERO.
015200
015300 01  FIND-RECEIVER.
015400     03  FILLER OCCURS 10 TIMES.
015500         05  FIND-ELEMENT   PIC X(22).
015600
015700 01  FIND-RECV-TYPE PIC X VALUE "A".
015800
015900 01  FIND-TITLE PIC X(40) VALUE SPACES.
016000
016100 01  FIND-SCREEN USAGE IS DISPLAY-WS.
016200     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
016300        "     *** TESTING THE FIND VSSUB ***".
016400
016500     03  FILLER PIC X(40) ROW 4 COLUMN 20 SOURCE FIND-TITLE.
016600
016700     03  FILLER PIC X(4) ROW 6 COLUMN 15 VALUE "FILE".
016800     03  FILLER PIC X(8) ROW 6 COLUMN 20
016900         SOURCE FIND-FILE OBJECT FIND-FILE.
017000
017100     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
017200     03  FILLER PIC X(8) ROW 6 COLUMN 38
017300         SOURCE FIND-LIB OBJECT FIND-LIB.
017400
017500     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
017600     03  FILLER PIC X(6) ROW 6 COLUMN 55
017700         SOURCE FIND-VOL OBJECT FIND-VOL.
017800
017900     03  FILLER PIC X(10) ROW 7 COLUMN 15 VALUE "WISPFILEXT".
018000     03  FIND-EXT PIC X(39) ROW 7 COLUMN 26
018100         SOURCE MY-EXT OBJECT MY-EXT.
018200
018300     03  FILLER PIC X(07) ROW 8 COLUMN 10 VALUE "STARTER".
018400     03  FILLER PIC Z9    ROW 8 COLUMN 20
018500         SOURCE FIND-STARTER-X OBJECT FIND-STARTER-X.
018600
018700     03  FILLER PIC X(07) ROW 8 COLUMN 30 VALUE "COUNTER".
018800     03  FILLER PIC Z9    ROW 8 COLUMN 40
018900         SOURCE FIND-COUNTER-X OBJECT FIND-COUNTER-X.
019000     03  FILLER PIC X(08) ROW 8 COLUMN 43 VALUE "(MAX 10)".
019100
019200     03  FILLER PIC X(10) ROW 8 COLUMN 55 VALUE "FILE COUNT".
019300     03  FILLER PIC ZZZ9    ROW 8 COLUMN 66
019400         SOURCE FIND-FILE-COUNT-X.
019500
019600     03  FILLER OCCURS 10 TIMES ROW 10.
019700         05  FILLER  PIC X(22) ROW 10 COLUMN 20
019800             SOURCE FIND-ELEMENT.
019900
020000     03  FILLER PIC X(50) ROW 24 COLUMN 15 VALUE
020100         "(ENTER) CONTINUE (8) AUTOTEST (16) TO EXIT".
020200
020300******************************************************************
020400
020500 01  READVTOC-OPTION            PIC X(1) VALUE SPACE.
020600
020700*01  FIND-LIB                   PIC X(8) VALUE SPACES.
020800*01  FIND-VOL                   PIC X(6) VALUE SPACES.
020900
021000*01  FIND-STARTER.
021100*    03 FIND-STARTER-1 BINARY    VALUE ZERO.
021200*    03 FIND-STARTER-2 BINARY    VALUE ZERO.
021300*01  FIND-STARTER-X    PIC S9999 VALUE ZERO.
021400
021500*01  FIND-COUNTER.
021600*    03 FIND-COUNTER-1 BINARY    VALUE ZERO.
021700*    03 FIND-COUNTER-2 BINARY    VALUE ZERO.
021800*01  FIND-COUNTER-X    PIC S9999 VALUE ZERO.
021900
022000*01  FIND-FILE-COUNT.
022100*    03 FIND-FILE-COUNT-1 BINARY    VALUE ZERO.
022200*    03 FIND-FILE-COUNT-2 BINARY    VALUE ZERO.
022300*01  FIND-FILE-COUNT-X    PIC S9999 VALUE ZERO.
022400
022500 01  READVTOC-RECEIVER.
022600     03  FILLER OCCURS 10 TIMES.
022700         05  READVTOC-ELEMENT   PIC X(8).
022800
022900 01  READVTOC-RC-X       PIC S9999 VALUE ZERO.
023000 01  READVTOC-RC.
023100     03  READVTOC-RC-1   BINARY   VALUE ZERO.
023200     03  READVTOC-RC-2   BINARY   VALUE ZERO.
023300
023400*01  FIND-TITLE PIC X(40) VALUE SPACES.
023500
023600 01  READVTOC-SCREEN USAGE IS DISPLAY-WS.
023700     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
023800        "    *** TESTING THE READVTOC VSSUB ***".
023900
024000     03  FILLER PIC X(40) ROW 4 COLUMN 20 SOURCE FIND-TITLE.
024100
024200     03  FILLER PIC X(6) ROW 6 COLUMN 13 VALUE "OPTION".
024300     03  FILLER PIC X(1) ROW 6 COLUMN 20
024400         SOURCE READVTOC-OPTION OBJECT READVTOC-OPTION.
024500
024600     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
024700     03  FILLER PIC X(8) ROW 6 COLUMN 38
024800         SOURCE FIND-LIB OBJECT FIND-LIB.
024900
025000     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
025100     03  FILLER PIC X(6) ROW 6 COLUMN 55
025200         SOURCE FIND-VOL OBJECT FIND-VOL.
025300
025400     03  FILLER PIC X(07) ROW 8 COLUMN 10 VALUE "STARTER".
025500     03  FILLER PIC Z9    ROW 8 COLUMN 20
025600         SOURCE FIND-STARTER-X OBJECT FIND-STARTER-X.
025700
025800     03  FILLER PIC X(07) ROW 8 COLUMN 30 VALUE "COUNTER".
025900     03  FILLER PIC Z9    ROW 8 COLUMN 40
026000         SOURCE FIND-COUNTER-X OBJECT FIND-COUNTER-X.
026100     03  FILLER PIC X(08) ROW 8 COLUMN 43 VALUE "(MAX 10)".
026200
026300     03  FILLER PIC X(10) ROW 8 COLUMN 55 VALUE "FILE COUNT".
026400     03  FILLER PIC ZZZ9    ROW 8 COLUMN 66
026500         SOURCE FIND-FILE-COUNT-X.
026600
026700     03  FILLER OCCURS 10 TIMES ROW 10.
026800         05  FILLER  PIC X(8) ROW 10 COLUMN 20
026900             SOURCE READVTOC-ELEMENT.
027000
027100     03  FILLER PIC X(11) ROW 22 COLUMN 35 VALUE "RETURN-CODE".
027200     03  FILLER PIC ----9 ROW 22 COLUMN 47
027300         SOURCE READVTOC-RC-X.
027400
027500     03  FILLER PIC X(40) ROW 24 COLUMN 20 VALUE
027600         "PRESS (ENTER) TO CONTINUE, (16) TO EXIT".
027700
027800******************************************************************
027900
028000 01  RETCOD.
028100     05  B4          BINARY VALUE 0.
028200     05  RET-CODE BINARY VALUE 0.
028300
028400******************************************************************
028500
028600 01  FLV-TITLE                      PIC X(40) VALUE SPACES.
028700 01  FLV-FILE                       PIC X(8) VALUE SPACES.
028800 01  FLV-LIB                        PIC X(8) VALUE SPACES.
028900 01  FLV-VOL                        PIC X(6) VALUE SPACES.
029000
029100******************************************************************
029200
029300
029400 01  LINKNAME PIC X(8) VALUE SPACES.
029500 01  LINKARG1 PIC X(10) VALUE SPACES.
029600 01  LINKARG2 PIC X(10) VALUE SPACES.
029700 01  LINKARG3 PIC X(10) VALUE SPACES.
029800
029900******************************************************************
030000* DATA FOR GETPARM CALL TO TEST PARAMETERS
030100
030200 01  GP-TYPE               PIC X(2)  VALUE "I ".
030300 01  GP-FORM               PIC X(1)  VALUE "R".
030400 01  GP-PRNAME             PIC X(8)  VALUE "GETPARMX".
030500 01  GP-PFKEY              PIC X(1)  VALUE " ".
030600 01  GP-MESSAGE-ID         PIC X(4)  VALUE "0001".
030700 01  GP-MESSAGE-ISSUER     PIC X(6)  VALUE "SAMPLE".
030800 01  GP-MESSAGE-COUNT.
030900     03  FILLER            BINARY    VALUE 0.
031000     03  FILLER            BINARY    VALUE 2.
031100 01  GP-MESSAGE-TEXT-1     PIC X(28)
031200     VALUE "The first message text line.".
031300 01  GP-MESSAGE-TEXT-2     PIC X(16)
031400     VALUE "The second line.".
031500 01  GP-MESSAGE-LEN-1.
031600     03  FILLER            BINARY    VALUE 0.
031700     03  FILLER            BINARY    VALUE 28.
031800 01  GP-MESSAGE-LEN-2.
031900     03  FILLER            BINARY    VALUE 0.
032000     03  FILLER            BINARY    VALUE 16.
032100
032200 01  GP-T                  PIC X(1)  VALUE "T".
032300 01  GP-A                  PIC X(1)  VALUE "A".
032400 01  GP-TEXT               PIC X(32)
032500     VALUE "Please only correct information!".
032600 01  GP-LENGTH.
032700     03  FILLER            BINARY    VALUE 0.
032800     03  FILLER            BINARY    VALUE 32.
032900 01  GP-N05.
033000     03  FILLER            BINARY    VALUE 0.
033100     03  FILLER            BINARY    VALUE 5.
033200 01  GP-N40.
033300     03  FILLER            BINARY    VALUE 0.
033400     03  FILLER            BINARY    VALUE 40.
033500 01  GP-N09.
033600     03  FILLER            BINARY    VALUE 0.
033700     03  FILLER            BINARY    VALUE 9.
033800 01  GP-N10.
033900     03  FILLER            BINARY    VALUE 0.
034000     03  FILLER            BINARY    VALUE 10.
034100 01  GP-N11.
034200     03  FILLER            BINARY    VALUE 0.
034300     03  FILLER            BINARY    VALUE 11.
034400 01  GP-N12.
034500     03  FILLER            BINARY    VALUE 0.
034600     03  FILLER            BINARY    VALUE 12.
034700 01  GP-N13.
034800     03  FILLER            BINARY    VALUE 0.
034900     03  FILLER            BINARY    VALUE 13.
035000 01  GP-N14.
035100     03  FILLER            BINARY    VALUE 0.
035200     03  FILLER            BINARY    VALUE 14.
035300 01  GP-N15.
035400     03  FILLER            BINARY    VALUE 0.
035500     03  FILLER            BINARY    VALUE 15.
035600 01  GP-N16.
035700     03  FILLER            BINARY    VALUE 0.
035800     03  FILLER            BINARY    VALUE 16.
035900 01  GP-N17.
036000     03  FILLER            BINARY    VALUE 0.
036100     03  FILLER            BINARY    VALUE 17.
036200 01  GP-N18.
036300     03  FILLER            BINARY    VALUE 0.
036400     03  FILLER            BINARY    VALUE 18.
036500 01  GP-N19.
036600     03  FILLER            BINARY    VALUE 0.
036700     03  FILLER            BINARY    VALUE 19.
036800 01  GP-N20.
036900     03  FILLER            BINARY    VALUE 0.
037000     03  FILLER            BINARY    VALUE 20.
037100
037200******************************************************************
037300* DATA FOR PUTPARM CALL AND THEN LINK TO DISPLAY
037400
037500 01  PP-DISPLAY   PIC X(8) VALUE "DISPLAY ".
037600 01  PP-FUNCTION PIC X VALUE "D".
037700 01  PP-PRNAME PIC X(8) VALUE "INPUT   ".
037800 01  PP-KWCOUNT.
037900     03  PP-KW1 BINARY VALUE 0.
038000     03  PP-KW2 BINARY VALUE 3.
038100
038200 01  PP-FILE-KW PIC X(8) VALUE "FILE    ".
038300 01  PP-LIB-KW PIC X(8) VALUE "LIBRARY ".
038400 01  PP-VOL-KW PIC X(8) VALUE "VOLUME  ".
038500
038600 01  PP-LEN-6.
038700     03 PP-L6-KW1 BINARY VALUE 0.
038800     03 PP-L6-KW2 BINARY VALUE 6.
038900
039000 01  PP-LEN-8.
039100     03 PP-L8-KW1 BINARY VALUE 0.
039200     03 PP-L8-KW2 BINARY VALUE 8.
039300
039400 01  PP-RCODE.
039500     03  PP-RCODE-1 BINARY VALUE 0.
039600     03  PP-RCODE-2 BINARY VALUE 0.
039700
039800 01  PP-FILE PIC X(8) VALUE "XYZ".
039900 01  PP-LIB  PIC X(8) VALUE "LIBIN".
040000 01  PP-VOL  PIC X(6) VALUE "VOLIN".
040100
040200 01  PP-LINK-TYPE PIC X(1) VALUE "S".
040300
040400 01  PP-SCREEN USAGE IS DISPLAY-WS.
040500     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
040600        "      *** PUTPARM & LINK TO DISPLAY ***".
040700
040800     03  FILLER PIC X(14) ROW 4 COLUMN 20 VALUE "FUNCTION (D,E)".
040900     03  FILLER PIC X(1)  ROW 4 COLUMN 36
041000         SOURCE PP-FUNCTION OBJECT PP-FUNCTION.
041100
041200     03  FILLER PIC X(4) ROW 6 COLUMN 15 VALUE "FILE".
041300     03  FILLER PIC X(8) ROW 6 COLUMN 20
041400         SOURCE PP-FILE OBJECT PP-FILE.
041500
041600     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
041700     03  FILLER PIC X(8) ROW 6 COLUMN 38
041800         SOURCE PP-LIB OBJECT PP-LIB.
041900
042000     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
042100     03  FILLER PIC X(6) ROW 6 COLUMN 55
042200         SOURCE PP-VOL OBJECT PP-VOL.
042300
042400     03  FILLER PIC X(26) ROW 24 COLUMN 28 VALUE
042500         "PRESS (ENTER) TO CONTINUE".
042600
042700******************************************************************
042800* DATA FOR PF18 PUTPARM CALL
042900
043000 01  PUTP-FUNCTION      PIC X          VALUE "E".
043100 01  PUTP-USAGECNT.
043200     03  PUTP-UC1       BINARY         VALUE 0.
043300     03  PUTP-UC2       BINARY         VALUE 1.
043400 01  PUTP-USAGE-CNT     PIC 9999       VALUE 1.
043500 01  PUTP-PRNAME        PIC X(8)       VALUE "INPUT   ".
043600 01  PUTP-KWCOUNT.
043700     03  PUTP-KW1       BINARY         VALUE 0.
043800     03  PUTP-KW2       BINARY         VALUE 3.
043900*  KEYWORD INFORMATION:
044000 01  PUTP-FILE-KW       PIC X(8)       VALUE "FILE    ".
044100 01  PUTP-FILE          PIC X(8)       VALUE SPACES.
044200 01  PUTP-LIB-KW        PIC X(8)       VALUE "LIBRARY ".
044300 01  PUTP-LIB           PIC X(8)       VALUE SPACES.
044400 01  PUTP-VOL-KW        PIC X(8)       VALUE "VOLUME  ".
044500 01  PUTP-VOL           PIC X(6)       VALUE SPACES.
044600 01  PUTP-LEN-6.
044700     03 PUTP-L6-KW1     BINARY         VALUE 0.
044800     03 PUTP-L6-KW2     BINARY         VALUE 6.
044900 01  PUTP-LEN-8.
045000     03 PUTP-L8-KW1     BINARY         VALUE 0.
045100     03 PUTP-L8-KW2     BINARY         VALUE 8.
045200
045300 01  PUTP-PFKEY-VALUE   PIC X          VALUE "@".
045400 01  PUTP-LABEL         PIC X(8)       VALUE SPACES.
045500 01  PUTP-REFLABEL      PIC X(8)       VALUE SPACES.
045600 01  PUTP-CLEANUP       PIC X          VALUE SPACES.
045700 01  PUTP-RCODE.
045800     03  PUTP-RCODE-1   BINARY         VALUE 0.
045900     03  PUTP-RCODE-2   BINARY         VALUE 0.
046000
046100 01  PUTP-RECEIVER.
046200     03 PP-R1-KW        PIC X(8)      VALUE SPACES.
046300     03 PP-R1-KWFL.
046400        05 PPR1-L1      BINARY        VALUE 0.
046500        05 PPR1-L2      BINARY        VALUE 8.
046600     03 PP-R1-KWVAL     PIC X(8)      VALUE SPACES.
046700     03 PP-R2-KW        PIC X(8)      VALUE SPACES.
046800     03 PP-R2-KWFL.
046900        05 PPR2-L1      BINARY        VALUE 0.
047000        05 PPR2-L2      BINARY        VALUE 8.
047100     03 PP-R2-KWVAL     PIC X(8)      VALUE SPACES.
047200     03 PP-R3-KW        PIC X(8)      VALUE SPACES.
047300     03 PP-R3-KWFL.
047400        05 PPR3-L1      BINARY        VALUE 0.
047500        05 PPR3-L2      BINARY        VALUE 6.
047600     03 PP-R3-KWVAL     PIC X(6)      VALUE SPACES.
047700 01  PUTP-RECVR-LEN.
047800     03 PUTP-RL1        BINARY         VALUE 0.
047900     03 PUTP-RL2        BINARY         VALUE 58.
048000 01  PUTP-TOTAL-LEN.
048100     03 PUTP-TL1        BINARY         VALUE 0.
048200     03 PUTP-TL2        BINARY         VALUE 58.
048300 01  PUTP-RECVR-FILE          PIC X(8) VALUE SPACES.
048400 01  PUTP-RECVR-LENF.
048500     03 PUTP-RECVR-LEN-FILE1  BINARY   VALUE 0.
048600     03 PUTP-RECVR-LEN-FILE2  BINARY   VALUE 8.
048700 01  PUTP-RECVR-LIB           PIC X(8) VALUE SPACES.
048800 01  PUTP-RECVR-LENL.
048900     03 PUTP-RECVR-LEN-LIB1   BINARY   VALUE 0.
049000     03 PUTP-RECVR-LEN-LIB2   BINARY   VALUE 8.
049100 01  PUTP-RECVR-VOL           PIC X(6) VALUE SPACES.
049200 01  PUTP-RECVR-LENV.
049300     03 PUTP-RECVR-LEN-VOL1   BINARY   VALUE 0.
049400     03 PUTP-RECVR-LEN-VOL2   BINARY   VALUE 6.
049500
049600 01  PUTP-STATUS-TEXT        PIC X(40) VALUE SPACES.
049700
049800******************************************************************
049900* DATA FOR PF19 GETPARM CALL
050000
050100 01  GETP-TYPE               PIC X(2)  VALUE "I ".
050200 01  GETP-FORM               PIC X     VALUE "A".
050300 01  GETP-PRNAME             PIC X(8)  VALUE SPACES.
050400 01  GETP-PFKEY              PIC X(1)  VALUE " ".
050500 01  GETP-MESSAGE-ID         PIC X(4)  VALUE SPACES.
050600 01  GETP-MESSAGE-ISSUER     PIC X(6)  VALUE "SAMPLE".
050700 01  GETP-MESSAGE-COUNT.
050800     03  FILLER              BINARY    VALUE 0.
050900     03  FILLER              BINARY    VALUE 2.
051000 01  GETP-MESSAGE-TEXT-1     PIC X(28)
051100     VALUE "MESSAGE TEXT 1".
051200 01  GETP-MESSAGE-LEN-1.
051300     03  FILLER              BINARY    VALUE 0.
051400     03  FILLER              BINARY    VALUE 28.
051500 01  GETP-MESSAGE-TEXT-2     PIC X(16)
051600     VALUE "MESSAGE TEXT 2".
051700 01  GETP-MESSAGE-LEN-2.
051800     03  FILLER              BINARY    VALUE 0.
051900     03  FILLER              BINARY    VALUE 16.
052000
052100 01  GETP-TXT1-TYPE          PIC X     VALUE "U".
052200 01  GETP-TXT1-VAL           PIC X(45)
052300     VALUE "This is a test for underline text on GETPARM.".
052400 01  GETP-TXT1-LEN.
052500     03  FILLER              BINARY    VALUE 0.
052600     03  FILLER              BINARY    VALUE 45.
052700 01  GETP-TXT1-FLROW         PIC X     VALUE "A".
052800 01  GETP-TXT1-ROW.
052900     03  FILLER              BINARY    VALUE 0.
053000     03  FILLER              BINARY    VALUE 9.
053100 01  GETP-TXT1-FLCOL         PIC X     VALUE "A".
053200 01  GETP-TXT1-COL.
053300     03  FILLER              BINARY    VALUE 0.
053400     03  FILLER              BINARY    VALUE 2.
053500
053600 01  GETP-TXT2-TYPE          PIC X     VALUE "T".
053700 01  GETP-TXT2-VAL           PIC X(46)
053800     VALUE "This is a test for plain text of a text field.".
053900 01  GETP-TXT2-LEN.
054000     03  FILLER              BINARY    VALUE 0.
054100     03  FILLER              BINARY    VALUE 46.
054200 01  GETP-TXT2-FLROW         PIC X     VALUE "A".
054300 01  GETP-TXT2-ROW.
054400     03  FILLER              BINARY    VALUE 0.
054500     03  FILLER              BINARY    VALUE 11.
054600 01  GETP-TXT2-FLCOL         PIC X     VALUE "A".
054700 01  GETP-TXT2-COL.
054800     03  FILLER              BINARY    VALUE 0.
054900     03  FILLER              BINARY    VALUE 2.
055000
055100 01  GETP-TXT3-TYPE          PIC X     VALUE "T".
055200 01  GETP-TXT3-VAL          PIC X(49)
055300     VALUE "YOU CAN ENTER THE FIELDS BUT NOTHING WILL HAPPEN:".
055400 01  GETP-TXT3-LEN.
055500     03  FILLER              BINARY    VALUE 0.
055600     03  FILLER              BINARY    VALUE 49.
055700 01  GETP-TXT3-FLROW         PIC X     VALUE "A".
055800 01  GETP-TXT3-ROW.
055900     03  FILLER              BINARY    VALUE 0.
056000     03  FILLER              BINARY    VALUE 13.
056100 01  GETP-TXT3-FLCOL        PIC X     VALUE "A".
056200 01  GETP-TXT3-COL.
056300     03  FILLER              BINARY    VALUE 0.
056400     03  FILLER              BINARY    VALUE 2.
056500
056600 01  GETP-TXT4-TYPE          PIC X     VALUE "T".
056700 01  GETP-TXT4-VAL           PIC X(47)
056800     VALUE "             (Press (ENTER) to call GETPATM.)".
056900 01  GETP-TXT4-LEN.
057000     03  FILLER              BINARY    VALUE 0.
057100     03  FILLER              BINARY    VALUE 47.
057200 01  GETP-TXT4-FLROW         PIC X     VALUE "A".
057300 01  GETP-TXT4-ROW.
057400     03  FILLER              BINARY    VALUE 0.
057500     03  FILLER              BINARY    VALUE 24.
057600 01  GETP-TXT4-FLCOL         PIC X     VALUE "A".
057700 01  GETP-TXT4-COL.
057800     03  FILLER              BINARY    VALUE 0.
057900     03  FILLER              BINARY    VALUE 10.
058000
058100 01  GETP-KW1-TYPE           PIC X     VALUE "K".
058200 01  GETP-FILE-KW            PIC X(8)  VALUE "FILE    ".
058300 01  GETP-FILE               PIC X(8)  VALUE SPACES.
058400 01  GETP-KW1-FLROW          PIC X     VALUE "A".
058500 01  GETP-KW1-ROW.
058600     03  FILLER              BINARY    VALUE 0.
058700     03  FILLER              BINARY    VALUE 15.
058800 01  GETP-KW1-FLCOL         PIC X     VALUE "A".
058900 01  GETP-KW1-COL.
059000     03  FILLER              BINARY    VALUE 0.
059100     03  FILLER              BINARY    VALUE 5.
059200 01  GETP-KW1-DATAT          PIC X     VALUE "C".
059300
059400 01  GETP-KW2-TYPE           PIC X     VALUE "K".
059500 01  GETP-LIB-KW             PIC X(8)  VALUE "LIBRARY ".
059600 01  GETP-LIB                PIC X(8)  VALUE SPACES.
059700 01  GETP-KW2-FLROW          PIC X     VALUE "A".
059800 01  GETP-KW2-ROW.
059900     03  FILLER              BINARY    VALUE 0.
060000     03  FILLER              BINARY    VALUE 15.
060100 01  GETP-KW2-FLCOL          PIC X     VALUE "A".
060200 01  GETP-KW2-COL.
060300     03  FILLER              BINARY    VALUE 0.
060400     03  FILLER              BINARY    VALUE 28.
060500 01  GETP-KW2-DATAT          PIC X     VALUE "C".
060600
060700 01  GETP-KW3-TYPE           PIC X     VALUE "K".
060800 01  GETP-VOL-KW             PIC X(8)  VALUE "VOLUME  ".
060900 01  GETP-VOL                PIC X(6)  VALUE SPACES.
061000 01  GETP-KW3-FLROW          PIC X     VALUE "A".
061100 01  GETP-KW3-ROW.
061200     03  FILLER              BINARY    VALUE 0.
061300     03  FILLER              BINARY    VALUE 15.
061400 01  GETP-KW3-FLCOL          PIC X     VALUE "A".
061500 01  GETP-KW3-COL.
061600     03  FILLER              BINARY    VALUE 0.
061700     03  FILLER              BINARY    VALUE 52.
061800 01  GETP-KW3-DATAT          PIC X     VALUE "C".
061900
062000 01  GETP-LEN-6.
062100     03 GETP-L6-KW1          BINARY    VALUE 0.
062200     03 GETP-L6-KW2          BINARY    VALUE 6.
062300 01  GETP-LEN-8.
062400     03 GETP-L8-KW1          BINARY    VALUE 0.
062500     03 GETP-L8-KW2          BINARY    VALUE 8.
062600
062700 01  GETP-PFKEY-TYPE        PIC X      VALUE "P".
062800 01  GETP-PFKEY-MASK.
062900     03 BYTE-1              PIC X      VALUE PFK-NOT-SET.
063000     03 BYTE-2              PIC X      VALUE PFK-SET.
063100     03 BYTE-3              PIC X      VALUE PFK-NOT-SET.
063200     03 BYTE-4              PIC X      VALUE PFK-NOT-SET.
063300
063400 01  GETP-ENABLE-ENTER     PIC X       VALUE "E".
063500
063600 01  GETP-STATUS-TEXT        PIC X(40) VALUE SPACES.
063700
063800******************************************************************
063900
064000 01  PUTP-SCREEN USAGE IS DISPLAY-WS.
064100     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
064200        "     *** TESTING THE PUTPARM VSSUB ***".
064300
064400     03  FILLER PIC X(20) ROW 4 COLUMN 05
064500         VALUE "FUNCTION (D,E,R,M,C)".
064600     03  FILLER PIC X(1)  ROW 4 COLUMN 27
064700         SOURCE PUTP-FUNCTION OBJECT PUTP-FUNCTION.
064800
064900     03  FILLER PIC X(11) ROW 4 COLUMN 30 VALUE "USAGE COUNT".
065000     03  PUTP-USAGECNT-FIELD PIC 9(4) ROW 4 COLUMN 45
065100         SOURCE PUTP-USAGE-CNT OBJECT PUTP-USAGE-CNT.
065200
065300     03  FILLER PIC X(6) ROW 4 COLUMN 55 VALUE "PRNAME".
065400     03  FILLER PIC X(8) ROW 4 COLUMN 62
065500         SOURCE PUTP-PRNAME OBJECT PUTP-PRNAME.
065600
065700     03  FILLER PIC X(6) ROW 6 COLUMN 2 VALUE "KW CNT".
065800     03  PUTP-KWCNT-FIELD PIC 9(4) ROW 6 COLUMN 10
065900         SOURCE PUTP-KW2 OBJECT PUTP-KW2.
066000
066100     03  FILLER PIC X(4) ROW 6 COLUMN 15 VALUE "FILE".
066200     03  FILLER PIC X(8) ROW 6 COLUMN 20
066300         SOURCE PUTP-FILE OBJECT PUTP-FILE.
066400
066500     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
066600     03  FILLER PIC X(8) ROW 6 COLUMN 38
066700         SOURCE PUTP-LIB OBJECT PUTP-LIB.
066800
066900     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
067000     03  FILLER PIC X(6) ROW 6 COLUMN 55
067100         SOURCE PUTP-VOL OBJECT PUTP-VOL.
067200
067300     03  FILLER PIC X(13) ROW 8 COLUMN 15 VALUE "PUTPARM LABEL".
067400     03  FILLER PIC X(8) ROW 8 COLUMN 30
067500         SOURCE PUTP-LABEL OBJECT PUTP-LABEL.
067600
067700     03  FILLER PIC X(15) ROW 8 COLUMN 40
067800         VALUE "REFERENCE LABEL".
067900     03  FILLER PIC X(8) ROW 8 COLUMN 57
068000         SOURCE PUTP-REFLABEL OBJECT PUTP-REFLABEL.
068100
068200     03  FILLER PIC X(6) ROW 10 COLUMN 15 VALUE "PF-KEY".
068300     03  FILLER PIC X(1) ROW 10 COLUMN 30
068400         SOURCE PUTP-PFKEY-VALUE OBJECT PUTP-PFKEY-VALUE.
068500
068600     03  FILLER PIC X(07) ROW 10 COLUMN 40 VALUE "CLEANUP".
068700     03  FILLER PIC X ROW 10 COLUMN 57
068800         SOURCE PUTP-CLEANUP OBJECT PUTP-CLEANUP.
068900
069000     03  FILLER PIC X(11) ROW 12 COLUMN 15 VALUE "RETURN-CODE".
069100     03  PUTP-RCODE-FIELD PIC 9(4) ROW 12 COLUMN 30
069200         SOURCE PUTP-RCODE-2.
069300
069400     03  FILLER PIC X(40) ROW 12 COLUMN 40
069500         SOURCE PUTP-STATUS-TEXT.
069600
069700     03  FILLER PIC X(33) ROW 14 COLUMN 25
069800         VALUE "Arguments returned for function R".
069900
070000     03  FILLER PIC X(06) ROW 16 COLUMN 1 VALUE "LENGTH".
070100     03  PUTP-ADJLEN-FIELD PIC 9(4) ROW 16 COLUMN 11
070200         SOURCE PUTP-RL2.
070300     03  FILLER PIC X(9) ROW 17 COLUMN 1 VALUE "RECEIVER:".
070400     03  FILLER PIC X(8) ROW 17 COLUMN 11
070500         SOURCE PP-R1-KW.
070600     03  FILLER PIC 9(4) ROW 17 COLUMN 20
070700         SOURCE PPR1-L2.
070800     03  FILLER PIC X(8) ROW 17 COLUMN 25
070900         SOURCE PP-R1-KWVAL.
071000     03  FILLER PIC X(8) ROW 17 COLUMN 34
071100         SOURCE PP-R2-KW.
071200     03  FILLER PIC 9(4) ROW 17 COLUMN 43
071300         SOURCE PPR2-L2.
071400     03  FILLER PIC X(8) ROW 17 COLUMN 48
071500         SOURCE PP-R2-KWVAL.
071600     03  FILLER PIC X(6) ROW 17 COLUMN 57
071700         SOURCE PP-R3-KW.
071800     03  FILLER PIC 9(4) ROW 17 COLUMN 66
071900         SOURCE PPR3-L2.
072000     03  FILLER PIC X(6) ROW 17 COLUMN 71
072100         SOURCE PP-R3-KWVAL.
072200
072300     03  FILLER PIC X(33) ROW 19 COLUMN 25
072400          VALUE "Arguments returned for function M".
072500
072600     03  FILLER PIC X(4) ROW 21 COLUMN 15 VALUE "FILE".
072700     03  FILLER PIC X(8) ROW 21 COLUMN 20
072800         SOURCE PUTP-RECVR-FILE.
072900
073000     03  FILLER PIC X(7) ROW 21 COLUMN 30 VALUE "LIBRARY".
073100     03  FILLER PIC X(8) ROW 21 COLUMN 38
073200         SOURCE PUTP-RECVR-LIB.
073300
073400     03  FILLER PIC X(6) ROW 21 COLUMN 48 VALUE "VOLUME".
073500     03  FILLER PIC X(6) ROW 21 COLUMN 55
073600         SOURCE PUTP-RECVR-VOL.
073700
073800     03  PUTP-RECVR-LENF-FIELD PIC 9(4) ROW 22 COLUMN 20
073900         SOURCE PUTP-RECVR-LEN-FILE2.
074000     03  PUTP-RECVR-LENL-FILED PIC 9(4) ROW 22 COLUMN 38
074100         SOURCE PUTP-RECVR-LEN-LIB2.
074200     03  PUTP-RECVR-LENV-FILED PIC 9(4) ROW 22 COLUMN 55
074300         SOURCE PUTP-RECVR-LEN-VOL2.
074400
074500     03  FILLER PIC X(42) ROW 24 COLUMN 19 VALUE
074600         "(ENTER) do PUTPARM (1) DISPLAY (16) EXIT".
074700
074800******************************************************************
074801 01  COBLINK-SCREEN USAGE IS DISPLAY-WS.
074802     05  FILLER PIC X(30) VALUE
074803         "CALL COBLINK USING PROGNAME"
074804         ROW 1 COL 25.
074805     05  COBLINK-TITLE PIC X(60) VALUE SPACES ROW 4 COL 10.
074806     05  FILLER PIC X(8) VALUE "PROGNAME" ROW 12 COL 20.
074807     05  FILLER PIC X(8) SOURCE SAMPLE-PROG
074808                         OBJECT SAMPLE-PROG
074809         ROW 12 COL 30.
074810     05  FILLER PIC X(40) VALUE "(ENTER) TO CONTINUE (16) TO EXIT"
074811         ROW 24 COL 20.
074812
074813 01  SAMPLE-PROG                    PIC X(8) VALUE "TRIGGER ".
074814******************************************************************
074900
075000 01  GETP-SCREEN USAGE IS DISPLAY-WS.
075100     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
075200        "     *** TESTING THE GETPARM VSSUB ***".
075300
075400     03  FILLER PIC X(23) ROW 4 COLUMN 02
075500         VALUE "TYPE (I,O,R,S,ID,OD,RD)".
075600     03  FILLER PIC X(2)  ROW 4 COLUMN 27
075700         SOURCE GETP-TYPE OBJECT GETP-TYPE.
075800
075900     03  FILLER PIC X(12) ROW 4 COLUMN 31 VALUE "FORM (A,R,S)".
076000     03  FILLER PIC X ROW 4 COLUMN 44
076100         SOURCE GETP-FORM OBJECT GETP-FORM.
076200
076300     03  FILLER PIC X(6) ROW 4 COLUMN 55 VALUE "PRNAME".
076400     03  FILLER PIC X(8) ROW 4 COLUMN 62
076500         SOURCE GETP-PRNAME OBJECT GETP-PRNAME.
076600
076700     03  FILLER PIC X(10) ROW 6 COLUMN 15 VALUE "MESSAGE ID".
076800     03  FILLER PIC X(4) ROW 6 COLUMN 28
076900         SOURCE GETP-MESSAGE-ID OBJECT GETP-MESSAGE-ID.
077000
077100     03  FILLER PIC X(14) ROW 6 COLUMN 35 VALUE "MESSAGE ISSUER".
077200     03  FILLER PIC X(6) ROW 6 COLUMN 52
077300         SOURCE GETP-MESSAGE-ISSUER OBJECT GETP-MESSAGE-ISSUER.
077400
077500     03  FILLER PIC X(14) ROW 8 COLUMN 15 VALUE "MESSAGE TEXT 1".
077600     03  FILLER PIC X(28) ROW 8 COLUMN 31
077700         SOURCE GETP-MESSAGE-TEXT-1 OBJECT GETP-MESSAGE-TEXT-1.
077800
077900     03  FILLER PIC X(14) ROW 9 COLUMN 15 VALUE "MESSAGE TEXT 2".
078000     03  FILLER PIC X(16) ROW 9 COLUMN 31
078100         SOURCE GETP-MESSAGE-TEXT-2 OBJECT GETP-MESSAGE-TEXT-2.
078200
078300     03  FILLER PIC X(10) ROW 11 COLUMN 5 VALUE "TYPE (T,U)".
078400     03  FILLER PIC X ROW 11 COLUMN 21
078500         SOURCE GETP-TXT1-TYPE OBJECT GETP-TXT1-TYPE.
078600
078700     03  FILLER PIC X(12) ROW 11 COLUMN 25 VALUE "TEXT FIELD 1".
078800     03  FILLER PIC X(45) ROW 12 COLUMN 25
078900         SOURCE GETP-TXT1-VAL OBJECT GETP-TXT1-VAL.
079000
079100     03  FILLER PIC X ROW 13 COLUMN 21
079200         SOURCE GETP-TXT2-TYPE OBJECT GETP-TXT2-TYPE.
079300
079400     03  FILLER PIC X(12) ROW 13 COLUMN 25 VALUE "TEXT FIELD 2".
079500     03  FILLER PIC X(46) ROW 14 COLUMN 25
079600         SOURCE GETP-TXT2-VAL OBJECT GETP-TXT2-VAL.
079700
079800     03  FILLER PIC X ROW 15 COLUMN 21
079900         SOURCE GETP-TXT3-TYPE OBJECT GETP-TXT3-TYPE.
080000
080100     03  FILLER PIC X(12) ROW 15 COLUMN 25 VALUE "TEXT FIELD 3".
080200     03  FILLER PIC X(49) ROW 16 COLUMN 25
080300         SOURCE GETP-TXT3-VAL OBJECT GETP-TXT3-VAL.
080400
080500     03  FILLER PIC X ROW 17 COLUMN 21
080600         SOURCE GETP-TXT4-TYPE OBJECT GETP-TXT4-TYPE.
080700
080800     03  FILLER PIC X(12) ROW 17 COLUMN 25 VALUE "TEXT FIELD 4".
080900     03  FILLER PIC X(47) ROW 18 COLUMN 25
081000         SOURCE GETP-TXT4-VAL OBJECT GETP-TXT4-VAL.
081100
081200     03  FILLER PIC X(14) ROW 19 COLUMN 5
081300         VALUE "TYPE (K,H,R,I)".
081400     03  FILLER PIC X(3) ROW 19 COLUMN 33 VALUE "KW1".
081500     03  FILLER PIC X ROW 19 COLUMN 38
081600         SOURCE GETP-KW1-TYPE OBJECT GETP-KW1-TYPE.
081700     03  FILLER PIC X(3) ROW 19 COLUMN 43 VALUE "KW2".
081800     03  FILLER PIC X ROW 19 COLUMN 48
081900         SOURCE GETP-KW2-TYPE OBJECT GETP-KW2-TYPE.
082000     03  FILLER PIC X(3) ROW 19 COLUMN 53 VALUE "KW3".
082100     03  FILLER PIC X ROW 19 COLUMN 58
082200         SOURCE GETP-KW1-TYPE OBJECT GETP-KW1-TYPE.
082300
082400     03  FILLER PIC X(25) ROW 20 COLUMN 5
082500         VALUE "DATA TYPE (A,C,I,N,L,U,H)".
082600     03  FILLER PIC X ROW 20 COLUMN 38
082700         SOURCE GETP-KW1-DATAT OBJECT GETP-KW1-DATAT.
082800     03  FILLER PIC X ROW 20 COLUMN 48
082900         SOURCE GETP-KW2-DATAT OBJECT GETP-KW2-DATAT.
083000     03  FILLER PIC X ROW 20 COLUMN 58
083100         SOURCE GETP-KW3-DATAT OBJECT GETP-KW3-DATAT.
083200
083300     03  FILLER PIC X(6) ROW 22 COLUMN 15 VALUE "PF-KEY".
083400     03  FILLER PIC X(1) ROW 22 COLUMN 30
083500         SOURCE GETP-PFKEY.
083600
083700     03  FILLER PIC X(40) ROW 21 COLUMN 40
083800         SOURCE GETP-STATUS-TEXT.
083900
084000     03  FILLER PIC X(50) ROW 24 COLUMN 15 VALUE
084100         "PRESS (ENTER) GETPARM  (1) SETUP (16) EXIT".
084200
084300******************************************************************
084400
084500 01  DATE-TITLE       PIC X(40) VALUE SPACES.
084600 01  DATE-FUNCTION    PIC X(02) VALUE SPACES.
084700
084800 01  DATE-J1          PIC X(05) VALUE SPACES.
084900 01  DATE-J2          PIC X(05) VALUE SPACES.
085000 01  DATE-J3          PIC X(05) VALUE SPACES.
085100 01  DATE-J4          PIC X(05) VALUE SPACES.
085200 01  DATE-J5          PIC X(05) VALUE SPACES.
085300 01  DATE-J6          PIC X(05) VALUE SPACES.
085400 01  DATE-J7          PIC X(05) VALUE SPACES.
085500
085600 01  DATE-G1          PIC X(06) VALUE SPACES.
085700 01  DATE-G2          PIC X(06) VALUE SPACES.
085800 01  DATE-G3          PIC X(06) VALUE SPACES.
085900 01  DATE-G4          PIC X(06) VALUE SPACES.
086000 01  DATE-G5          PIC X(06) VALUE SPACES.
086100 01  DATE-G6          PIC X(06) VALUE SPACES.
086200 01  DATE-G7          PIC X(06) VALUE SPACES.
086300
086400 01  DATE-X1          PIC X(08) VALUE SPACES.
086500 01  DATE-X2          PIC X(08) VALUE SPACES.
086600 01  DATE-X3          PIC X(08) VALUE SPACES.
086700 01  DATE-X4          PIC X(08) VALUE SPACES.
086800 01  DATE-X5          PIC X(08) VALUE SPACES.
086900 01  DATE-X6          PIC X(08) VALUE SPACES.
087000
087100 01  DATE-R1          PIC X(07) VALUE SPACES.
087200 01  DATE-R2          PIC X(07) VALUE SPACES.
087300
087400 01  DATE-RC1         PIC S9999 VALUE ZERO.
087500 01  DATE-RC2         PIC S9999 VALUE ZERO.
087600 01  DATE-RC3         PIC S9999 VALUE ZERO.
087700 01  DATE-RC4         PIC S9999 VALUE ZERO.
087800 01  DATE-RC5         PIC S9999 VALUE ZERO.
087900 01  DATE-RC6         PIC S9999 VALUE ZERO.
088000 01  DATE-RC7         PIC S9999 VALUE ZERO.
088100 01  DATE-RC8         PIC S9999 VALUE ZERO.
088200 01  DATE-RC9         PIC S9999 VALUE ZERO.
088300 01  DATE-RC10        PIC S9999 VALUE ZERO.
088400 01  DATE-RC11        PIC S9999 VALUE ZERO.
088500 01  DATE-RC12        PIC S9999 VALUE ZERO.
088600
088700 01  DATE-DIFF1       PIC S9999 VALUE ZERO.
088800 01  DATE-DIFF2       PIC S9999 VALUE ZERO.
088900 01  DATE-DIFF3       PIC S9999 VALUE ZERO.
089000
089100 01  DATE-ADD1        PIC S99999 VALUE ZERO.
089200 01  DATE-ADD2        PIC S99999 VALUE ZERO.
089300 01  DATE-ADD3        PIC S99999 VALUE ZERO.
089400
089500 01  DATE-DT1         PIC X(45) VALUE SPACES.
089600 01  DATE-DT2         PIC X(45) VALUE SPACES.
089700
089800 01  DATE-DAY1        PIC X(09) VALUE SPACES.
089900 01  DATE-DAY2        PIC X(09) VALUE SPACES.
090000
090100 01  DATE-DIFF.
090200     03 DATE-DIFF-B1  BINARY VALUE ZERO.
090300     03 DATE-DIFF-B2  BINARY VALUE ZERO.
090400
090500 01  DATE-ADD.
090600     03 DATE-ADD-B1  BINARY VALUE ZERO.
090700     03 DATE-ADD-B2  BINARY VALUE ZERO.
090800
090900 01  DATE-RC.
091000     03 DATE-RC-B1 BINARY VALUE ZERO.
091100     03 DATE-RC-B2 BINARY VALUE ZERO.
091200
091300 01  DATE-SCREEN USAGE IS DISPLAY-WS.
091400     03 FILLER PIC X(40) ROW 1 COLUMN 20 VALUE
091500        "     *** TESTING THE DATE VSSUB ***".
091600
091700     03  FILLER PIC X(40) ROW 3 COLUMN 20 SOURCE DATE-TITLE.
091800
091900     03  FILLER PIC X(09) ROW  6 COLUMN  2 VALUE " (1) <HD>".
092000     03  FILLER PIC X(09) ROW  6 COLUMN 15 VALUE "DATE/TIME".
092100     03  FILLER PIC X(45) ROW  6 COLUMN 25
092200         SOURCE DATE-DT1.
092300
092400     03  FILLER PIC X(09) ROW  7 COLUMN  2 VALUE " (2) <HL>".
092500     03  FILLER PIC X(09) ROW  7 COLUMN 15 VALUE "DATE/TIME".
092600     03  FILLER PIC X(45) ROW  7 COLUMN 25
092700         SOURCE DATE-DT2.
092800
092900     03  FILLER PIC X(09) ROW  8 COLUMN  2 VALUE " (3) <GJ>".
093000     03  FILLER PIC X(06) ROW  8 COLUMN 15
093100         SOURCE DATE-G1 OBJECT DATE-G1.
093200     03  FILLER PIC X(05) ROW  8 COLUMN 25
093300         SOURCE DATE-J1.
093400     03  FILLER PIC ----9 ROW  8 COLUMN 50
093500         SOURCE DATE-RC1.
093600
093700     03  FILLER PIC X(09) ROW  9 COLUMN  2 VALUE " (4) <JG>".
093800     03  FILLER PIC X(05) ROW  9 COLUMN 15
093900         SOURCE DATE-J2 OBJECT DATE-J2.
094000     03  FILLER PIC X(06) ROW  9 COLUMN 25
094100         SOURCE DATE-G2.
094200     03  FILLER PIC ----9 ROW  9 COLUMN 50
094300         SOURCE DATE-RC2.
094400
094500     03  FILLER PIC X(09) ROW 10 COLUMN  2 VALUE " (5) <G->".
094600     03  FILLER PIC X(06) ROW 10 COLUMN 15
094700         SOURCE DATE-G3 OBJECT DATE-G3.
094800     03  FILLER PIC X(06) ROW 10 COLUMN 25
094900         SOURCE DATE-G4 OBJECT DATE-G4.
095000     03  FILLER PIC ----9 ROW 10 COLUMN 35
095100         SOURCE DATE-DIFF1.
095200     03  FILLER PIC ----9 ROW 10 COLUMN 50
095300         SOURCE DATE-RC3.
095400
095500     03  FILLER PIC X(09) ROW 11 COLUMN  2 VALUE " (6) <J->".
095600     03  FILLER PIC X(05) ROW 11 COLUMN 15
095700         SOURCE DATE-J3 OBJECT DATE-J3.
095800     03  FILLER PIC X(05) ROW 11 COLUMN 25
095900         SOURCE DATE-J4 OBJECT DATE-J4.
096000     03  FILLER PIC ----9 ROW 11 COLUMN 35
096100         SOURCE DATE-DIFF2.
096200     03  FILLER PIC ----9 ROW 11 COLUMN 50
096300         SOURCE DATE-RC4.
096400
096500     03  FILLER PIC X(09) ROW 12 COLUMN  2 VALUE " (7) <G+>".
096600     03  FILLER PIC X(06) ROW 12 COLUMN 15
096700         SOURCE DATE-G5 OBJECT DATE-G5.
096800     03  FILLER PIC -----9 ROW 12 COLUMN 25
096900         SOURCE DATE-ADD1 OBJECT DATE-ADD1.
097000     03  FILLER PIC X(06) ROW 12 COLUMN 35
097100         SOURCE DATE-G6.
097200     03  FILLER PIC -----9 ROW 12 COLUMN 50
097300         SOURCE DATE-RC5.
097400
097500     03  FILLER PIC X(09) ROW 13 COLUMN  2 VALUE " (8) <J+>".
097600     03  FILLER PIC X(05) ROW 13 COLUMN 15
097700         SOURCE DATE-J5 OBJECT DATE-J5.
097800     03  FILLER PIC -----9 ROW 13 COLUMN 25
097900         SOURCE DATE-ADD2 OBJECT DATE-ADD2.
098000     03  FILLER PIC X(05) ROW 13 COLUMN 35
098100         SOURCE DATE-J6.
098200     03  FILLER PIC -----9 ROW 13 COLUMN 50
098300         SOURCE DATE-RC6.
098400
098500     03  FILLER PIC X(09) ROW 14 COLUMN  2 VALUE " (9) <GD>".
098600     03  FILLER PIC X(06) ROW 14 COLUMN 15
098700         SOURCE DATE-G7 OBJECT DATE-G7.
098800     03  FILLER PIC X(09) ROW 14 COLUMN 25
098900         SOURCE DATE-DAY1.
099000     03  FILLER PIC ----9 ROW 14 COLUMN 50
099100         SOURCE DATE-RC7.
099200
099300     03  FILLER PIC X(09) ROW 15 COLUMN  2 VALUE "(10) <JD>".
099400     03  FILLER PIC X(05) ROW 15 COLUMN 15
099500         SOURCE DATE-J7 OBJECT DATE-J7.
099600     03  FILLER PIC X(09) ROW 15 COLUMN 25
099700         SOURCE DATE-DAY2.
099800     03  FILLER PIC ----9 ROW 15 COLUMN 50
099900         SOURCE DATE-RC8.
100000
100100     03  FILLER PIC X(09) ROW 16 COLUMN  2 VALUE "(11) <X->".
100200     03  FILLER PIC X(08) ROW 16 COLUMN 15
100300         SOURCE DATE-X1 OBJECT DATE-X1.
100400     03  FILLER PIC X(08) ROW 16 COLUMN 25
100500         SOURCE DATE-X2 OBJECT DATE-X2.
100600     03  FILLER PIC ----9 ROW 16 COLUMN 35
100700         SOURCE DATE-DIFF3.
100800     03  FILLER PIC ----9 ROW 16 COLUMN 50
100900         SOURCE DATE-RC9.
101000
101100     03  FILLER PIC X(09) ROW 17 COLUMN  2 VALUE "(12) <X+>".
101200     03  FILLER PIC X(08) ROW 17 COLUMN 15
101300         SOURCE DATE-X3 OBJECT DATE-X3.
101400     03  FILLER PIC -----9 ROW 17 COLUMN 25
101500         SOURCE DATE-ADD3 OBJECT DATE-ADD3.
101600     03  FILLER PIC X(08) ROW 17 COLUMN 35
101700         SOURCE DATE-X4.
101800     03  FILLER PIC -----9 ROW 17 COLUMN 50
101900         SOURCE DATE-RC10.
102000
102100     03  FILLER PIC X(09) ROW  18 COLUMN  2 VALUE "(13) <XR>".
102200     03  FILLER PIC X(08) ROW  18 COLUMN 15
102300         SOURCE DATE-X5 OBJECT DATE-X5.
102400     03  FILLER PIC X(07) ROW  18 COLUMN 25
102500         SOURCE DATE-R1.
102600     03  FILLER PIC ----9 ROW  18 COLUMN 50
102700         SOURCE DATE-RC11.
102800
102900     03  FILLER PIC X(09) ROW  19 COLUMN  2 VALUE "(14) <RX>".
103000     03  FILLER PIC X(07) ROW  19 COLUMN 15
103100         SOURCE DATE-R2 OBJECT DATE-R2.
103200     03  FILLER PIC X(08) ROW  19 COLUMN 25
103300         SOURCE DATE-X6.
103400     03  FILLER PIC ----9 ROW  19 COLUMN 50
103500         SOURCE DATE-RC12.
103600
103700     03  FILLER PIC X(09) ROW 20 COLUMN  2 VALUE "(16) EXIT".
103800
103900     03  FILLER PIC X(30) ROW 22 COLUMN  2 VALUE
104000         "THE LAST FUNCTION EXECUTED WAS".
104100     03  FILLER PIC X(02) ROW 22 COLUMN 35
104200         SOURCE DATE-FUNCTION.
104300
104400     03  FILLER PIC X(35) ROW 24 COLUMN 28 VALUE
104500         "PRESS A PFKEY TO CONTINUE".
104600
104700
104800******************************************************************
104900
105000 01  DAY-DATE      PIC 9(6) VALUE ZEROS.
105100 01  DAY-DOW.
105200     03 FILLER     BINARY VALUE ZERO.
105300     03 DAY-DOW-B  BINARY VALUE ZERO.
105400
105500 01  DAY-SCREEN USAGE IS DISPLAY-WS.
105600     03 FILLER PIC X(40) ROW 1 COLUMN 20 VALUE
105700        "     *** TESTING THE DAY VSSUB ***".
105800
105900     03  FILLER PIC X(60) ROW 3 COLUMN 10 VALUE
106000        "Specify a date in YYMMDD format and DAY will ".
106100     03  FILLER PIC X(60) ROW 4 COLUMN 10 VALUE
106200        "return the day of the week 1 (Sunday) 7 (Saturday).".
106300
106400     03  FILLER PIC X(06) ROW  12 COLUMN 10 VALUE "YYMMDD".
106500     03  FILLER PIC X(06) ROW  12 COLUMN 18
106600         SOURCE DAY-DATE OBJECT DAY-DATE.
106700
106800     03  FILLER PIC X(03) ROW  14 COLUMN 10 VALUE "DAY".
106900     03  FILLER PIC ZZ    ROW  14 COLUMN 18 SOURCE DAY-DOW-B.
107000
107100     03  FILLER PIC X(20) ROW  24 COLUMN 30 VALUE "(16) to EXIT".
107200
107300******************************************************************
107400
107500 01  ASCII-STRING       PIC X(4) VALUE SPACES.
107600 01  ASCII-STRING2      PIC X(4) VALUE SPACES.
107700 01  ASCII-LEN.
107800     03 FILLER     BINARY VALUE ZERO.
107900     03 FILLER     BINARY VALUE 4.
108000 01  BIT-STRING         PIC X(32) VALUE SPACES.
108100 01  BIT-LEN.
108200     03 FILLER     BINARY VALUE ZERO.
108300     03 FILLER     BINARY VALUE 32.
108400
108500 01  BITPACK-SCREEN USAGE IS DISPLAY-WS.
108600     03 FILLER PIC X(60) ROW 1 COLUMN 10 VALUE
108700        "*** TESTING THE BITPACK/BITUNPK VSSUB ***".
108800
108900     03  FILLER PIC X(60) ROW 3 COLUMN 10 VALUE
109000        "Enter a 4 char string, BITUNPK will unpack it".
109100     03  FILLER PIC X(60) ROW 4 COLUMN 10 VALUE
109200        "into a bit string, BITPACK will then pack it back".
109300     03  FILLER PIC X(60) ROW 5 COLUMN 10 VALUE
109400        "into a 4 char string.".
109500
109600     03  FILLER PIC    X(06) ROW  12 COLUMN 2 VALUE "STRING".
109700     03  BP-STRING PIC X(04) ROW  12 COLUMN 10
109800         SOURCE ASCII-STRING OBJECT ASCII-STRING.
109900
110000     03  FILLER PIC X(09) ROW  12 COLUMN 15 VALUE "(BITUNPK)".
110100     03  FILLER PIC X(8)BX(8)BX(8)BX(8) ROW  12 COLUMN 25
110200         SOURCE BIT-STRING.
110300
110400     03  FILLER PIC X(07) ROW  14 COLUMN  2 VALUE "CONTROL".
110500     03  FILLER PIC X(04) ROW  14 COLUMN 10 VALUE "1?aç".
110600     03  FILLER PIC X(35) ROW  14 COLUMN 25 VALUE
110700         "00110001 00111111 01100001 01111110".
110800
110900     03  FILLER PIC X(09) ROW  12 COLUMN 62 VALUE "(BITPACK)".
111000     03  FILLER PIC X(04) ROW  12 COLUMN 72
111100         SOURCE ASCII-STRING2.
111200
111300     03  FILLER PIC X(20) ROW  24 COLUMN 30 VALUE "(16) to EXIT".
111400
111500 01  AHEX-STRING       PIC X(10) VALUE SPACES.
111600 01  AHEX-STRING2      PIC X(10) VALUE SPACES.
111700 01  AHEX-LEN.
111800     03 FILLER     BINARY VALUE ZERO.
111900     03 FILLER     BINARY VALUE 10.
112000 01  HEX-STRING      PIC X(20) VALUE SPACES.
112100 01  HEX-LEN.
112200     03 FILLER     BINARY VALUE ZERO.
112300     03 FILLER     BINARY VALUE 20.
112400
112500
112600 01  HEXPACK-SCREEN USAGE IS DISPLAY-WS.
112700     03 FILLER PIC X(60) ROW 1 COLUMN 10 VALUE
112800        "*** TESTING THE HEXPACK/HEXUNPK VSSUB ***".
112900
113000     03  FILLER PIC X(60) ROW 3 COLUMN 10 VALUE
113100        "Enter a 10 char string, HEXUNPK will unpack it".
113200     03  FILLER PIC X(60) ROW 4 COLUMN 10 VALUE
113300        "into a hex string, HEXPACK will then pack it back".
113400     03  FILLER PIC X(60) ROW 5 COLUMN 10 VALUE
113500        "into a 10 char string.".
113600
113700     03  FILLER PIC X(06) ROW  12 COLUMN 2 VALUE "STRING".
113800     03  HP-STRING PIC X(10) ROW  12 COLUMN 13
113900         SOURCE AHEX-STRING OBJECT AHEX-STRING.
114000
114100     03  FILLER PIC X(09) ROW  12 COLUMN 25 VALUE "(HEXUNPK)".
114200     03  FILLER PIC X(20) ROW  12 COLUMN 35
114300         SOURCE HEX-STRING.
114400
114500     03  FILLER PIC X(09) ROW  12 COLUMN 59 VALUE "(HEXPACK)".
114600     03  FILLER PIC X(10) ROW  12 COLUMN 69
114700         SOURCE AHEX-STRING2.
114800
114900     03  FILLER PIC X(07) ROW  14 COLUMN 2 VALUE "CONTROL".
115000     03  FILLER PIC X(10) ROW  14 COLUMN 13 VALUE "09?AZazç] ".
115100     03  FILLER PIC X(20) ROW  14 COLUMN 35
115200         VALUE "30393F415A617A7E5D20".
115300
115400     03  FILLER PIC X(20) ROW  24 COLUMN 30 VALUE "(16) to EXIT".
115500
115600******************************************************************
115700 01  STRING-SCREEN USAGE IS DISPLAY-WS.
115800     03 FILLER PIC X(60) ROW 1 COLUMN 10 VALUE
115900        "*** TESTING THE STRING VSSUB ***".
116000
116100     03  FILLER PIC X(60) ROW  4  COLUMN  4 VALUE
116200         "(1) CT - CENTER".
116300     03  FILLER PIC X(60) ROW  5  COLUMN  4 VALUE
116400         "(2) LJ - LEFT JUSTIFY".
116500     03  FILLER PIC X(60) ROW  6  COLUMN  4 VALUE
116600         "(3) RJ - RIGHT JUSTIFY".
116700     03  FILLER PIC X(60) ROW  7  COLUMN  4 VALUE
116800         "(4) RV - REVERSE".
116900     03  FILLER PIC X(60) ROW  8  COLUMN  4 VALUE
117000         "(5) AE - ASCII to EBCDIC".
117100     03  FILLER PIC X(60) ROW  9  COLUMN  4 VALUE
117200         "(6) EA - EBCDIC to ASCII".
117300     03  FILLER PIC X(60) ROW  10  COLUMN  4 VALUE
117400         "(7) EA - EBCDIC to ASCII (out->in)".
117500     03  FILLER PIC X(6)  ROW 15  COLUMN  1 VALUE "INSTR".
117600     03  FILLER PIC 999   ROW 15  COLUMN  8
117700         SOURCE STRING-INSTR-LEN-2 OBJECT STRING-INSTR-LEN-2.
117800     03  STRING-INSTR-X PIC X(60) ROW 15  COLUMN 12
117900         SOURCE STRING-INSTR OBJECT STRING-INSTR.
118000
118100     03  FILLER PIC X(6)  ROW 17  COLUMN  1 VALUE "OUTSTR".
118200     03  FILLER PIC 999   ROW 17  COLUMN  8
118300         SOURCE STRING-OUTSTR-LEN-2 OBJECT STRING-OUTSTR-LEN-2.
118400     03  FILLER PIC X(60) ROW 17  COLUMN 12
118500         SOURCE STRING-OUTSTR.
118600
118700     03  FILLER PIC X(6)  ROW 19  COLUMN  1 VALUE "HEXOUT".
118800     03  FILLER PIC X(60) ROW 19  COLUMN 12
118900         SOURCE STRING-HEXOUT.
119000
119100     03  FILLER PIC X(20) ROW 24  COLUMN 30 VALUE "(16) to EXIT".
119200
119300 01  STRING-FUNCTION      PIC X(2).
119400 01  STRING-INSTR         PIC X(60) VALUE SPACES.
119500 01  STRING-OUTSTR        PIC X(60) VALUE SPACES.
119600 01  STRING-HEXOUT        PIC X(120) VALUE SPACES.
119700 01  STRING-INSTR-LEN.
119800     03  STRING-INSTR-LEN-1    BINARY VALUE 0.
119900     03  STRING-INSTR-LEN-2    BINARY VALUE 60.
120000 01  STRING-OUTSTR-LEN.
120100     03  STRING-OUTSTR-LEN-1   BINARY VALUE 0.
120200     03  STRING-OUTSTR-LEN-2   BINARY VALUE 60.
120300
120400******************************************************************
120500
120600 01  LINKPROC-TITLE       PIC X(40) VALUE SPACES.
120700
120800 01  LINKPROC-FILE        PIC X(08) VALUE "PRTARGSH".
120900 01  LINKPROC-LIB         PIC X(08) VALUE "TESTACU".
121000 01  LINKPROC-VOL         PIC X(06) VALUE "SOURCE".
121100
121200 01  LINKPROC-RETURN.
121300     03 LINKPROC-RETURN-1 BINARY    VALUE ZERO.
121400     03 LINKPROC-RETURN-2 BINARY    VALUE ZERO.
121500 01  LINKPROC-RETURN-X    PIC S99999 VALUE ZERO.
121600
121700 01  LINKPROC-COMP.
121800     03 LINKPROC-COMP-1 BINARY    VALUE ZERO.
121900     03 LINKPROC-COMP-2 BINARY    VALUE ZERO.
122000 01  LINKPROC-COMP-X    PIC S99999 VALUE ZERO.
122100
122200 01  LINKPROC-PCNT        BINARY    VALUE 8.
122300 01  LINKPROC-PCNT-X      PIC S9999 VALUE 8.
122400
122500 01  LINKPROC-PLEN1       BINARY    VALUE ZERO.
122600 01  LINKPROC-PLEN2       BINARY    VALUE ZERO.
122700 01  LINKPROC-PLEN3       BINARY    VALUE ZERO.
122800 01  LINKPROC-PLEN4       BINARY    VALUE ZERO.
122900 01  LINKPROC-PLEN5       BINARY    VALUE ZERO.
123000 01  LINKPROC-PLEN6       BINARY    VALUE ZERO.
123100 01  LINKPROC-PLEN7       BINARY    VALUE ZERO.
123200 01  LINKPROC-PLEN8       BINARY    VALUE ZERO.
123300
123400 01  LINKPROC-PLEN1-X     PIC S9999 VALUE 4.
123500 01  LINKPROC-PLEN2-X     PIC S9999 VALUE 12.
123600 01  LINKPROC-PLEN3-X     PIC S9999 VALUE 5.
123700 01  LINKPROC-PLEN4-X     PIC S9999 VALUE 7.
123800 01  LINKPROC-PLEN5-X     PIC S9999 VALUE ZERO.
123900 01  LINKPROC-PLEN6-X     PIC S9999 VALUE ZERO.
124000 01  LINKPROC-PLEN7-X     PIC S9999 VALUE ZERO.
124100 01  LINKPROC-PLEN8-X     PIC S9999 VALUE ZERO.
124200
124300 01  LINKPROC-PTXT1       PIC X(60) VALUE "ARG1".
124400 01  LINKPROC-PTXT2       PIC X(60) VALUE "A SPACE ARG".
124500 01  LINKPROC-PTXT3       PIC X(60) VALUE SPACES.
124600 01  LINKPROC-PTXT4       PIC X(60) VALUE "LASTARG".
124700 01  LINKPROC-PTXT5       PIC X(60) VALUE SPACES.
124800 01  LINKPROC-PTXT6       PIC X(60) VALUE SPACES.
124900 01  LINKPROC-PTXT7       PIC X(60) VALUE SPACES.
125000 01  LINKPROC-PTXT8       PIC X(60) VALUE SPACES.
125100
125200
125300 01  LINKPROC-SCREEN USAGE IS DISPLAY-WS.
125400     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
125500        " *** TESTING THE LINKPROC VSSUB ***".
125600
125700     03  FILLER PIC X(40) ROW 4 COLUMN 20
125800         SOURCE LINKPROC-TITLE.
125900
126000     03  FILLER PIC X(4) ROW 6 COLUMN 15 VALUE "FILE".
126100     03  FILLER PIC X(8) ROW 6 COLUMN 20
126200         SOURCE LINKPROC-FILE OBJECT LINKPROC-FILE.
126300
126400     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
126500     03  FILLER PIC X(8) ROW 6 COLUMN 38
126600         SOURCE LINKPROC-LIB OBJECT LINKPROC-LIB.
126700
126800     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
126900     03  FILLER PIC X(6) ROW 6 COLUMN 55
127000         SOURCE LINKPROC-VOL OBJECT LINKPROC-VOL.
127100
127200     03  FILLER PIC X(07) ROW  8 COLUMN  5
127300         VALUE "PARMCNT".
127400     03  FILLER PIC ----9 ROW  8 COLUMN 20
127500         SOURCE LINKPROC-PCNT-X.
127600
127700     03  FILLER PIC X(03) ROW 9 COLUMN  6 VALUE "LEN".
127800     03  FILLER PIC X(04) ROW 9 COLUMN 15 VALUE "TEXT".
127900
128000     03  FILLER PIC X(02) ROW 10 COLUMN  2 VALUE "P1".
128100     03  FILLER PIC ----9 ROW 10 COLUMN  5
128200         SOURCE LINKPROC-PLEN1-X
128300         OBJECT LINKPROC-PLEN1-X.
128400     03  FILLER PIC X(60) ROW 10 COLUMN  15
128500         SOURCE LINKPROC-PTXT1
128600         OBJECT LINKPROC-PTXT1.
128700
128800     03  FILLER PIC X(02) ROW 11 COLUMN  2 VALUE "P2".
128900     03  FILLER PIC ----9 ROW 11 COLUMN  5
129000         SOURCE LINKPROC-PLEN2-X
129100         OBJECT LINKPROC-PLEN2-X.
129200     03  FILLER PIC X(60) ROW 11 COLUMN  15
129300         SOURCE LINKPROC-PTXT2
129400         OBJECT LINKPROC-PTXT2.
129500
129600     03  FILLER PIC X(02) ROW 12 COLUMN  2 VALUE "P3".
129700     03  FILLER PIC ----9 ROW 12 COLUMN  5
129800         SOURCE LINKPROC-PLEN3-X
129900         OBJECT LINKPROC-PLEN3-X.
130000     03  FILLER PIC X(60) ROW 12 COLUMN  15
130100         SOURCE LINKPROC-PTXT3
130200         OBJECT LINKPROC-PTXT3.
130300
130400     03  FILLER PIC X(02) ROW 13 COLUMN  2 VALUE "P4".
130500     03  FILLER PIC ----9 ROW 13 COLUMN  5
130600         SOURCE LINKPROC-PLEN4-X
130700         OBJECT LINKPROC-PLEN4-X.
130800     03  FILLER PIC X(60) ROW 13 COLUMN  15
130900         SOURCE LINKPROC-PTXT4
131000         OBJECT LINKPROC-PTXT4.
131100
131200     03  FILLER PIC X(02) ROW 14 COLUMN  2 VALUE "P5".
131300     03  FILLER PIC ----9 ROW 14 COLUMN  5
131400         SOURCE LINKPROC-PLEN5-X
131500         OBJECT LINKPROC-PLEN5-X.
131600     03  FILLER PIC X(60) ROW 14 COLUMN  15
131700         SOURCE LINKPROC-PTXT5
131800         OBJECT LINKPROC-PTXT5.
131900
132000     03  FILLER PIC X(02) ROW 15 COLUMN  2 VALUE "P6".
132100     03  FILLER PIC ----9 ROW 15 COLUMN  5
132200         SOURCE LINKPROC-PLEN6-X
132300         OBJECT LINKPROC-PLEN6-X.
132400     03  FILLER PIC X(60) ROW 15 COLUMN  15
132500         SOURCE LINKPROC-PTXT6
132600         OBJECT LINKPROC-PTXT6.
132700
132800     03  FILLER PIC X(02) ROW 16 COLUMN  2 VALUE "P7".
132900     03  FILLER PIC ----9 ROW 16 COLUMN  5
133000         SOURCE LINKPROC-PLEN7-X
133100         OBJECT LINKPROC-PLEN7-X.
133200     03  FILLER PIC X(60) ROW 16 COLUMN  15
133300         SOURCE LINKPROC-PTXT7
133400         OBJECT LINKPROC-PTXT7.
133500
133600     03  FILLER PIC X(02) ROW 17 COLUMN  2 VALUE "P8".
133700     03  FILLER PIC ----9 ROW 17 COLUMN  5
133800         SOURCE LINKPROC-PLEN8-X
133900         OBJECT LINKPROC-PLEN8-X.
134000     03  FILLER PIC X(60) ROW 17 COLUMN  15
134100         SOURCE LINKPROC-PTXT8
134200         OBJECT LINKPROC-PTXT8.
134300
134400     03  FILLER PIC X(11) ROW 20 COLUMN 40 VALUE "RETURN-CODE".
134500     03  FILLER PIC -----9 ROW 20 COLUMN 55
134600         SOURCE LINKPROC-RETURN-X.
134700
134800     03  FILLER PIC X(11) ROW 21 COLUMN 40 VALUE "COMP CODE".
134900     03  FILLER PIC -----9 ROW 21 COLUMN 55
135000         SOURCE LINKPROC-COMP-X.
135100
135200     03  FILLER PIC X(26) ROW 24 COLUMN 28 VALUE
135300         "PRESS (ENTER) TO CONTINUE".
135400
135500******************************************************************
135600
135700 01  LINK-TITLE       PIC X(40) VALUE SPACES.
135800
135900 01  LINK-FILE        PIC X(08) VALUE SPACES.
136000 01  LINK-LIB         PIC X(08) VALUE SPACES.
136100 01  LINK-VOL         PIC X(06) VALUE SPACES.
136200 01  LINK-EXT         PIC X(03) VALUE SPACES.
136300 01  LINK-EXT-FULL    PIC X(39) VALUE SPACES.
136400
136500 01  LINK-TYPE        PIC X(01) VALUE SPACES.
136600 01  LINK-SPECIAL     PIC X(01) VALUE SPACES.
136700 01  LINK-EXT-OPT     PIC X(02) VALUE SPACES.
136800 01  LINK-PARM-CNT.
136900     03 LINK-PARM-CNT-1 BINARY  VALUE ZERO.
137000     03 LINK-PARM-CNT-2 BINARY  VALUE ZERO.
137100 01  LINK-PARM-CNT-X  PIC 99    VALUE ZERO.
137200 01  LINK-CANCEL-FLAG PIC X(01) VALUE SPACES.
137300 01  LINK-MESSAGE     PIC X(27) VALUE SPACES.
137400 01  LINK-MESS-LEN.
137500     03 LINK-MESS-LEN-1 BINARY  VALUE ZERO.
137600     03 LINK-MESS-LEN-2 BINARY  VALUE ZERO.
137700 01  LINK-MESS-LEN-X  PIC 99    VALUE ZERO.
137800 01  LINK-HELP        PIC X(01) VALUE SPACES.
137900 01  LINK-RESERVED    PIC X(02) VALUE SPACES.
138000 01  LINK-COMP-CODE.
138100     03 LINK-COMP-CODE-1 BINARY VALUE ZERO.
138200     03 LINK-COMP-CODE-2 BINARY VALUE ZERO.
138300 01  LINK-COMP-CODE-X PIC 9999  VALUE ZERO.
138400 01  LINK-RETURN.
138500     03 LINK-RETURN-1 BINARY    VALUE ZERO.
138600     03 LINK-RETURN-2 BINARY    VALUE ZERO.
138700 01  LINK-RETURN-X    PIC S9999 VALUE ZERO.
138800
138900 01  LINK-SCREEN USAGE IS DISPLAY-WS.
139000     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
139100        "     *** TESTING THE LINK VSSUB ***".
139200
139300     03  FILLER PIC X(40) ROW 4 COLUMN 20 SOURCE LINK-TITLE.
139400
139500     03  FILLER PIC X(4) ROW 6 COLUMN 15 VALUE "FILE".
139600     03  S-LINK-FILE PIC X(8) ROW 6 COLUMN 20
139700         SOURCE LINK-FILE OBJECT LINK-FILE.
139800
139900     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
140000     03  S-LINK-LIB PIC X(8) ROW 6 COLUMN 38
140100         SOURCE LINK-LIB OBJECT LINK-LIB.
140200
140300     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
140400     03  S-LINK-VOL PIC X(6) ROW 6 COLUMN 55
140500         SOURCE LINK-VOL OBJECT LINK-VOL.
140600
140700     03  FILLER PIC X(10) ROW 6 COLUMN 63 VALUE "WISPFILEXT".
140800     03  S-LINK-EXT PIC X(3) ROW 6 COLUMN 75
140900         SOURCE LINK-EXT OBJECT LINK-EXT.
141000
141100     03  FILLER PIC X(04) ROW  8 COLUMN  5 VALUE "TYPE".
141200     03  S-LINK-TYPE PIC X(01) ROW  8 COLUMN 20
141300         SOURCE LINK-TYPE OBJECT LINK-TYPE.
141400
141500     03  FILLER PIC X(07) ROW  8 COLUMN 40 VALUE "SPECIAL".
141600     03  S-LINK-SPECIAL PIC X(01) ROW  8 COLUMN 55
141700         SOURCE LINK-SPECIAL OBJECT LINK-SPECIAL.
141800
141900     03  FILLER PIC X(07) ROW 10 COLUMN  5 VALUE "EXT-OPT".
142000     03  S-LINK-EXT-OPT PIC X(02) ROW 10 COLUMN 20
142100         SOURCE LINK-EXT-OPT OBJECT LINK-EXT-OPT.
142200
142300     03  FILLER PIC X(10) ROW 10 COLUMN 40 VALUE "PARM-CNT".
142400     03  FILLER PIC Z9    ROW 10 COLUMN 55
142500         SOURCE LINK-PARM-CNT-X.
142600
142700     03  FILLER PIC X(11) ROW 12 COLUMN  5 VALUE "CANCEL-FLAG".
142800     03  S-LINK-CANCEL-FLAG PIC X(01) ROW 12 COLUMN 20
142900         SOURCE LINK-CANCEL-FLAG OBJECT LINK-CANCEL-FLAG.
143000
143100     03  FILLER PIC X(07) ROW 14 COLUMN  5 VALUE "MESSAGE".
143200     03  S-LINK-MESSAGE PIC X(27) ROW 14 COLUMN 20
143300         SOURCE LINK-MESSAGE OBJECT LINK-MESSAGE.
143400
143500     03  FILLER PIC X(08) ROW 14 COLUMN 50 VALUE "MESS-LEN".
143600     03  S-LINK-MESS-LEN-X PIC Z9    ROW 14 COLUMN 60
143700         SOURCE LINK-MESS-LEN-X OBJECT LINK-MESS-LEN-X.
143800
143900     03  FILLER PIC X(04) ROW 16 COLUMN  5 VALUE "HELP".
144000     03  S-LINK-HELP PIC X(01) ROW 16 COLUMN 20
144100         SOURCE LINK-HELP OBJECT LINK-HELP.
144200
144300     03  FILLER PIC X(09) ROW 20 COLUMN  5 VALUE "COMP-CODE".
144400     03  FILLER PIC ----9 ROW 20 COLUMN 20
144500         SOURCE LINK-COMP-CODE-X.
144600
144700     03  FILLER PIC X(11) ROW 20 COLUMN 40 VALUE "RETURN-CODE".
144800     03  FILLER PIC ----9 ROW 20 COLUMN 55
144900         SOURCE LINK-RETURN-X.
145000
145100     03  FILLER PIC X(40) ROW 24 COLUMN 20 VALUE
145200         "PRESS (ENTER) TO CONTINUE; (16) EXIT".
145300
145400******************************************************************
145500
145600 01  WCHAIN-SCREEN USAGE IS DISPLAY-WS.
145700     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
145800        "     *** TESTING THE WCHAIN VSSUB ***".
145900
146000     03  FILLER PIC X(40) ROW 4 COLUMN 20 SOURCE WCHAIN-ERROR.
146100
146200     03  FILLER PIC X(4) ROW 6 COLUMN 15 VALUE "FILE".
146300     03  FILLER PIC X(8) ROW 6 COLUMN 20
146400         SOURCE WCHAIN-FILE OBJECT WCHAIN-FILE.
146500
146600     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
146700     03  FILLER PIC X(8) ROW 6 COLUMN 38
146800         SOURCE WCHAIN-LIB OBJECT WCHAIN-LIB.
146900
147000     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
147100     03  FILLER PIC X(6) ROW 6 COLUMN 55
147200         SOURCE WCHAIN-VOL OBJECT WCHAIN-VOL.
147300
147400     03  FILLER PIC X(26) ROW 24 COLUMN 28 VALUE
147500         "PRESS (ENTER) TO CONTINUE".
147600
147700 01  WCHAIN-VOL   PIC X(6) VALUE SPACES.
147800 01  WCHAIN-LIB   PIC X(8) VALUE SPACES.
147900 01  WCHAIN-FILE  PIC X(8) VALUE SPACES.
148000 01  WCHAIN-ERROR PIC X(40) VALUE SPACES.
148100
148200******************************************************************
148300
148400 01  READFDR-SCREEN USAGE IS DISPLAY-WS.
148500     03  FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
148600         " *** TESTING THE READFDR/4 ROUTINE *** ".
148700
148800     03  FILLER PIC X(60) ROW 4 COLUMN 10 VALUE
148900         "This tests the Field Request Mode of READFDR/4 VSSUB.".
149000     03  FILLER PIC X(60) ROW 5 COLUMN 10 VALUE
149100         "Enter the file/lib/vol and the FUNCTION to test then".
149200     03  FILLER PIC X(60) ROW 6 COLUMN 10 VALUE
149300         "press (1) if the receiver is an INT(4) or (2) if CHAR.".
149400
149500     03  FILLER PIC X(8) ROW 8 COLUMN 15 VALUE "FUNCTION".
149600     03  FILLER PIC X(2) ROW 8 COLUMN 25
149700         SOURCE READFDR-FUNCTION OBJECT READFDR-FUNCTION.
149800
149900     03  FILLER PIC X(8) ROW 8 COLUMN 40 VALUE "MODE".
150000     03  FILLER PIC X(1) ROW 8 COLUMN 50 VALUE "0".
150100
150200     03  FILLER PIC X(4) ROW 10 COLUMN 15 VALUE "FILE".
150300     03  FILLER PIC X(8) ROW 10 COLUMN 20
150400         SOURCE READFDR-FILE OBJECT READFDR-FILE.
150500
150600     03  FILLER PIC X(7) ROW 10 COLUMN 30 VALUE "LIBRARY".
150700     03  FILLER PIC X(8) ROW 10 COLUMN 38
150800         SOURCE READFDR-LIB OBJECT READFDR-LIB.
150900
151000     03  FILLER PIC X(6) ROW 10 COLUMN 48 VALUE "VOLUME".
151100     03  FILLER PIC X(6) ROW 10 COLUMN 55
151200         SOURCE READFDR-VOL OBJECT READFDR-VOL.
151300
151400     03  FILLER PIC X(16) ROW 12 COLUMN 8 
                                          VALUE "(1) (4) INT(4)".
151500     03  FILLER PIC -(8)9 ROW 12 COLUMN 28
151600         SOURCE READFDR-INT4-X.
151700
151800     03  FILLER PIC X(18) ROW 14 COLUMN 8
151900                                    VALUE "(2) (5) CHAR(50)".
152000     03  FILLER PIC X(50) ROW 14 COLUMN 28
152100         SOURCE READFDR-CHAR50.
152200
152300     03  FILLER PIC X(17) ROW 16 COLUMN 8 
                                          VALUE "(3) (6) NUM(18)".
152400     03  FILLER PIC 9(18) ROW 16 COLUMN 28
152500         SOURCE READFDR-NUM18.
           03  FILLER PIC X(60) ROW 18 COLUMN 8 VALUE
               "Pfkeys (1) (2) (3) call READFDR".
           03  FILLER PIC X(60) ROW 19 COLUMN 8 VALUE
               "Pfkeys (4) (5) (6) call READFDR4".
152600
152700     03  FILLER PIC X(11) ROW 22 COLUMN 35 VALUE "RETURN-CODE".
152800     03  FILLER PIC ----9 ROW 22 COLUMN 47
152900         SOURCE READFDR-RC-X.
153000
153100     03  FILLER PIC X(35) ROW 24 COLUMN 28 VALUE
153200         "(8) Auto-test  (16) EXIT".
153300
153400 01  READFDR-TITLE       PIC X(40) VALUE SPACES.
153500 01  READFDR-FILE        PIC X(8) VALUE SPACES.
153600 01  READFDR-LIB         PIC X(8) VALUE SPACES.
153700 01  READFDR-VOL         PIC X(6) VALUE SPACES.
153800 01  READFDR-FUNCTION    PIC X(2) VALUE "RC".
153900 01  READFDR-CHAR50      PIC X(50) VALUE SPACES.
       01  READFDR-CHAR1       PIC X     VALUE SPACES.
       01  READFDR-CHAR8       PIC X(8)  VALUE SPACES.
154000 01  READFDR-NUM18       PIC 9(18) VALUE ZERO.
154100 01  READFDR-MODE.
154200     03  READFDR-MODE-B1   BINARY   VALUE ZERO.
154300     03  READFDR-MODE-B2   BINARY   VALUE ZERO.
154400 01  READFDR-INT4-X        PIC S9(8) VALUE ZERO.
154500 01  READFDR-INT4.
154600     10  READFDR-INT4-B1   BINARY   VALUE ZERO.
154700     10  READFDR-INT4-B2   BINARY   VALUE ZERO.
       01  FILLER REDEFINES READFDR-INT4.
           05  READFDR-INT4-BIG  BINARY PIC S9(8).
       01  INT4-SWAP BINARY PIC S9(8) VALUE ZERO.

154800 01  READFDR-RC-X        PIC S9999 VALUE ZERO.
154900 01  READFDR-RC.
155000     03  READFDR-RC-B1   BINARY   VALUE ZERO.
155100     03  READFDR-RC-B2   BINARY   VALUE ZERO.
155101 01  READFDR-FAILED  PIC 9999 VALUE ZERO.
       01  READFDR-TESTED  PIC 9999 VALUE ZERO.
       01  READFDR-EXPECT.
           03  READFDR-TEST-ID            PIC 9999.
           03  READFDR-EXPECT-CHAR1       PIC X.
           03  READFDR-EXPECT-CHAR8       PIC X(8).
           03  READFDR-EXPECT-NUM18       PIC 9(18).
           03  READFDR-EXPECT-INT4-X      PIC S9(4).
           03  READFDR-EXPECT-RC-X        PIC S9(4).

       01  READFDR-IX      PIC X.
           88  READFDR-IX-CISAM   VALUE "C".
           88  READFDR-IX-VISION  VALUE "V".
           88  READFDR-IX-MFFH    VALUE "M".
           88  READFDR-IX-UNKNOWN VALUE "U".
           88  READFDR-IX-HAS-RC  VALUE "C", "V".
           
155200
155300******************************************************************
155400
155500 01  MOUNT-SCREEN USAGE IS DISPLAY-WS.
155600     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
155700        "     *** TESTING THE MOUNT VSSUB ***".
155800
155900     03  FILLER PIC X(40) ROW 4 COLUMN 20 SOURCE MOUNT-ERROR.
156000
156100     03  FILLER PIC X(6) ROW 6 COLUMN 15 VALUE "DEVICE".
156200     03  FILLER PIC X(8) ROW 6 COLUMN 20
156300         SOURCE MOUNT-DEVICE OBJECT MOUNT-DEVICE.
156400
156500     03  FILLER PIC X(6) ROW 6 COLUMN 30 VALUE "VOLUME".
156600     03  FILLER PIC X(6) ROW 6 COLUMN 38
156700         SOURCE MOUNT-VOL OBJECT MOUNT-VOL.
156800
156900     03  FILLER PIC X(6) ROW 6 COLUMN 45 VALUE "SET ID".
157000     03  FILLER PIC X(8) ROW 6 COLUMN 53
157100         SOURCE MOUNT-SETID OBJECT MOUNT-SETID.
157200
157300     03  FILLER PIC X(13) ROW 8 COLUMN 15 VALUE "LABEL (S,N,I)".
157400     03  FILLER PIC X(1) ROW 8 COLUMN 30
157500         SOURCE MOUNT-LABEL OBJECT MOUNT-LABEL.
157600
157700     03  FILLER PIC X(15) ROW 8 COLUMN 33
157800         VALUE "USAGE (S,E,P,R)".
157900     03  FILLER PIC X(1)  ROW 8 COLUMN 50
158000         SOURCE MOUNT-USAGE OBJECT MOUNT-USAGE.
158100
158200     03  FILLER PIC X(16) ROW 8 COLUMN 55
158300         VALUE "DRIVE TYPE (F,R)".
158400     03  FILLER PIC X(1) ROW 8 COLUMN 75
158500         SOURCE MOUNT-DEVICE-TYPE OBJECT MOUNT-DEVICE-TYPE.
158600
158700     03  FILLER PIC X(18) ROW 10 COLUMN 15
158800           VALUE "SYSTEM  USE (0-15)".
158900     03  FILLER PIC X(8) ROW 10 COLUMN 35
159000         SOURCE MOUNT-SETID OBJECT MOUNT-SETID.
161100
161200     03  FILLER PIC X(26) ROW 24 COLUMN 28 VALUE
161300         "PRESS (ENTER) TO CONTINUE".
161400
161500 01  MOUNT-DEVICE.
161600     05  FILLER            BINARY   VALUE 0.
161700     05  MOUNT-DEVICE-R-2  BINARY   VALUE -1.
161701 01  MOUNT-DEVICE-TYPE     PIC X VALUE SPACES.
161800 01  MOUNT-VOL             PIC X(6) VALUE SPACES.
161900 01  MOUNT-SETID.
162000     05  FILLER            BINARY   VALUE 0.
162100     05  MOUNT-SETID-R-2   BINARY   VALUE 0.
162200 01  MOUNT-LABEL           PIC X(1) VALUE "S".
162300 01  MOUNT-USAGE           PIC X(1) VALUE "S".
162400 01  MOUNT-DRIVE-TYPE      PIC X(1) VALUE "R".
162500 01  MOUNT-SYS-USE-OPT.
162600     05  FILLER              BINARY   VALUE 0.
162700     05  MNT-SYS-USE-OPT-R-2 BINARY   VALUE 0.
162800 01  MOUNT-BYPASS-OPT      PIC X(1) VALUE "S".
162900 01  MOUNT-MESSAGE-OPT     PIC X(1) VALUE "M".
163000 01  MOUNT-DISPLAY-OPT     PIC X(1) VALUE "D".
163100 01  MOUNT-ADDRESS         PIC X(1) VALUE "S".
163200 01  MOUNT-RC.
163300     03  MOUNT-RC-B1   BINARY   VALUE ZERO.
163400     03  MOUNT-RC-B2   BINARY   VALUE ZERO.
163500 01  MOUNT-ERROR           PIC X(40) VALUE SPACES.
163600
163700******************************************************************
163800
163900 01  SUBMIT-SCREEN USAGE IS DISPLAY-WS.
164000     03  FILLER PIC X(40) ROW 3 COLUMN 20 VALUE
164100         "   *** TESTING THE SUBMIT ROUTINE ***   ".
164200
164300     03  FILLER PIC X(40) ROW 5 COLUMN 20
164400         SOURCE SUBMIT-TITLE.
164500
164600     03  FILLER PIC X(4) ROW 10 COLUMN 15 VALUE "FILE".
164700     03  FILLER PIC X(8) ROW 10 COLUMN 20
164800         SOURCE SUBMIT-FILE OBJECT SUBMIT-FILE.
164900
165000     03  FILLER PIC X(7) ROW 10 COLUMN 30 VALUE "LIBRARY".
165100     03  FILLER PIC X(8) ROW 10 COLUMN 38
165200         SOURCE SUBMIT-LIB OBJECT SUBMIT-LIB.
165300
165400     03  FILLER PIC X(6) ROW 10 COLUMN 48 VALUE "VOLUME".
165500     03  FILLER PIC X(6) ROW 10 COLUMN 55
165600         SOURCE SUBMIT-VOL OBJECT SUBMIT-VOL.
165700
165800     03  FILLER PIC X(8) ROW 14 COLUMN  5 VALUE "JOB NAME".
165900     03  FILLER PIC X(8) ROW 14 COLUMN 25
166000         SOURCE SUBMIT-NAME OBJECT SUBMIT-NAME.
166100
166200     03  FILLER PIC X(14) ROW 14 COLUMN 40
166300         VALUE "STATUS (R,H, )".
166400     03  FILLER PIC X(1)  ROW 14 COLUMN 60
166500         SOURCE SUBMIT-STATUS OBJECT SUBMIT-STATUS.
166600
166700     03  FILLER PIC X(18) ROW 16 COLUMN  5 VALUE
166800         "JOB DISP (D,R,P,O)".
166900     03  FILLER PIC X(1)  ROW 16 COLUMN 25
167000         SOURCE SUBMIT-DISP OBJECT SUBMIT-DISP.
167100
167200     03  FILLER PIC X(9)  ROW 16 COLUMN 40 VALUE "JOB CLASS".
167300     03  FILLER PIC X(1)  ROW 16 COLUMN 60
167400         SOURCE SUBMIT-CLASS OBJECT SUBMIT-CLASS.
167500
167600     03  FILLER PIC X(12) ROW 18 COLUMN  5 VALUE "ABORT ACTION".
167700     03  FILLER PIC X(1)  ROW 18 COLUMN 25
167800         SOURCE SUBMIT-ABORT OBJECT SUBMIT-ABORT.
167900
168000     03  FILLER PIC X(14) ROW 18 COLUMN 40
168100         VALUE "CPU TIME LIMIT".
168200     03  FILLER PIC ----9 ROW 18 COLUMN 60
168300         SOURCE SUBMIT-TIME-X OBJECT SUBMIT-TIME-X.
168400
168500     03  FILLER PIC X(18) ROW 20 COLUMN  5 VALUE
168600         "LIMIT FLAG (C,P,W)".                                    34567890
168700     03  FILLER PIC X(1)  ROW 20 COLUMN 25
168800         SOURCE SUBMIT-LIMIT OBJECT SUBMIT-LIMIT.
168900
169000     03  FILLER PIC X(16) ROW 22 COLUMN  5
169100         VALUE "SHORT SUBMIT (X)".
169200     03  FILLER PIC X(1)  ROW 22 COLUMN 22
169300         SOURCE SUBMIT-SHORT OBJECT SUBMIT-SHORT.
169400
169500     03  FILLER PIC X(11) ROW 22 COLUMN 35 VALUE "RETURN-CODE".
169600     03  FILLER PIC ----9 ROW 22 COLUMN 47
169700         SOURCE SUBMIT-RC-X.
169800
169900     03  FILLER PIC X(60) ROW 24 COLUMN 10 SOURCE SUBMIT-FOOTER.
170000
170100 01  SUBMIT-TITLE       PIC X(40) VALUE SPACES.
170200 01  SUBMIT-FOOTER      PIC X(60) VALUE SPACES.
170300 01  SUBMIT-FILE        PIC X(8) VALUE "QABCKGRD".
170400 01  SUBMIT-LIB         PIC X(8) VALUE "TESTxxx".
170500 01  SUBMIT-VOL         PIC X(6) VALUE "SOURCE".
170600 01  SUBMIT-NAME        PIC X(8) VALUE "TESTSBMT".
170700 01  SUBMIT-STATUS      PIC X(1) VALUE "R".
170800 01  SUBMIT-DISP        PIC X(1) VALUE "D".
170900 01  SUBMIT-CLASS       PIC X(1) VALUE " ".
171000 01  SUBMIT-ABORT       PIC X(1) VALUE "N".
171100 01  SUBMIT-TIME-X      PIC S9999 VALUE ZERO.
171200 01  SUBMIT-TIME.
171300     03  SUBMIT-TIME-B1 BINARY   VALUE ZERO.
171400     03  SUBMIT-TIME-B2 BINARY   VALUE ZERO.
171500 01  SUBMIT-LIMIT       PIC X(1) VALUE "C".
171600 01  SUBMIT-RC-X        PIC S9999 VALUE ZERO.
171700 01  SUBMIT-RC.
171800     03  SUBMIT-RC-B1   BINARY   VALUE ZERO.
171900     03  SUBMIT-RC-B2   BINARY   VALUE ZERO.
172000 01  SUBMIT-SHORT       PIC X(1) VALUE SPACE.
172100     88 USE-SHORT-SUBMIT         VALUE "X".
172200
172300******************************************************************
172400 01  SUBMIT-PARAMETER-SCREEN USAGE IS DISPLAY-WS.
172500     03  FILLER PIC X(37) ROW 1 COLUMN 20 VALUE
172600         "   *** ENTER SUBMIT PARAMETERS ***   ".
172700
172800     03  FILLER OCCURS 8 TIMES.
172900       05  SUB-SCRN-ITEM PIC X(76) ROW 6 COLUMN 2
173000           SOURCE SUBMIT-PARMS OBJECT SUBMIT-PARMS.
173100       05  FILLER PIC X(76) SOURCE SUBMIT-BLANK-LINE
173200                  ROW 7 COLUMN 2.
173300
173400     03  FILLER PIC X(26) ROW 24 COLUMN 28 VALUE
173500         "PRESS (ENTER) TO CONTINUE".
173600
173700 01  SUBMIT-PARMS-ARRAY.
173800     03  SUBMIT-PARMS PIC X(76) OCCURS 8 TIMES VALUE SPACES.
173900     03  SUBMIT-BLANK-LINE PIC X(76) OCCURS 8 TIMES VALUE SPACES.
174000
174100 01  SUBMIT-PARMS-LENGTH BINARY VALUE 76.
174200 01  SUBMIT-PARMS-COUNT  BINARY VALUE 8.
174300
174400******************************************************************
174500
174600 01  EXTRACT-SCREEN USAGE IS DISPLAY-WS.
174700     03 FILLER PIC X(35) ROW 1 COLUMN 20 VALUE
174800        "*** TESTING THE EXTRACT VSSUB ***".
174900
175000     03 FILLER PIC X(50) ROW 3 COLUMN 25 VALUE
175100        "Possible call combinations:".
175200     03 FILLER PIC X(50) ROW 4 COLUMN 25 VALUE
175300        "(1) - KW1, FLD1, ID   (OLD WISP CALL)".
175400     03 FILLER PIC X(50) ROW 5 COLUMN 25 VALUE
175500        "(2) - KW1, FLD1, LEN1".
175600     03 FILLER PIC X(50) ROW 6 COLUMN 25 VALUE
175700        "(3) - KW1, FLD1".
175800     03 FILLER PIC X(50) ROW 7 COLUMN 25 VALUE
175900        "(4) - KW1, FLD1, KW2, FLD2".
176000     03 FILLER PIC X(50) ROW 8 COLUMN 25 VALUE
176100        "(5) - KW1, FLD1, LEN1, KW2, FLD2".
176200     03 FILLER PIC X(50) ROW 9 COLUMN 25 VALUE
176300        "(6) - KW3, FLD3-int(4)".
176400     03 FILLER PIC X(21) ROW 11 COLUMN 15 VALUE
176500        "AVAILABLE PARAMETERS:".
176600     03  FILLER PIC X(7) ROW 12 COLUMN 40 VALUE "PROG ID".
176700     03  FILLER PIC X(8) ROW 12 COLUMN 50
176800         SOURCE WISP-APPLICATION-NAME.
176900
177000     03  FILLER PIC X(9) ROW 13 COLUMN 1 VALUE "Keyword 1".
177100     03  FILLER PIC X(2) ROW 13 COLUMN 11
177200         SOURCE EXT-KW-1 OBJECT EXT-KW-1.
177300
177400     03  FILLER PIC X(9) ROW 14 COLUMN 1 VALUE "PIC X(59)".
177500     03  FILLER PIC X(59) ROW 14 COLUMN 11
177600         SOURCE EXT-RECVR-1.
177700
177800     03  FILLER PIC X(9) ROW 15 COLUMN 1 VALUE "Length  1".
177900     03  FILLER PIC 9(02) ROW 15 COLUMN 11
178000         SOURCE EXT-RLEN-1 OBJECT EXT-RLEN-1.
178100
178200     03  FILLER PIC X(9) ROW 16 COLUMN 1 VALUE "Keyword 2".
178300     03  FILLER PIC X(2) ROW 16 COLUMN 11
178400         SOURCE EXT-KW-2 OBJECT EXT-KW-2.
178500
178600     03  FILLER PIC X(9) ROW 17 COLUMN 1 VALUE "PIC X(59)".
178700     03  FILLER PIC X(59) ROW 17 COLUMN 11
178800         SOURCE EXT-RECVR-2.
178900
179000     03  FILLER PIC X(9) ROW 18 COLUMN 1 VALUE "Length  2".
179100     03  FILLER PIC 9(02) ROW 18 COLUMN 11
179200         SOURCE EXT-RLEN-2 OBJECT EXT-RLEN-2.
179300
179400     03  FILLER PIC X(9) ROW 19 COLUMN 1 VALUE "Keyword 3".
179500     03  FILLER PIC X(2) ROW 19 COLUMN 11
179600         SOURCE EXT-KW-3 OBJECT EXT-KW-3.
179700
179800     03  FILLER PIC X(9) ROW 20 COLUMN 1 VALUE "S9(4)    ".
179900     03  FILLER PIC ----9 ROW 20 COLUMN 11
180000         SOURCE EXT-RECVR-3.
180100
180200     03 FILLER PIC X(53) ROW 23 COLUMN 05 VALUE
180300        "SEE CALL OPTIONS ABOVE - PUSH PFKEY FOR DESIRED CALL,".
180400
180500     03 FILLER PIC X(15) ROW 23 COLUMN 60 VALUE
180600        "(16) TO EXIT".
180700
180800 01  EXT-KW-1        PIC X(02) VALUE SPACES.
180900 01  EXT-RECVR-1     PIC X(59) VALUE SPACES.
181000 01  EXT-LENGTH-1.
181100     03  FILLER            BINARY    VALUE 0.
181200     03  EXT-RLEN-1        BINARY    VALUE 0.
181300 01  EXT-KW-2        PIC X(02) VALUE SPACES.
181400 01  EXT-RECVR-2     PIC X(59) VALUE SPACES.
181500 01  EXT-LENGTH-2.
181600     03  FILLER            BINARY    VALUE 0.
181700     03  EXT-RLEN-2        BINARY    VALUE 0.
181800 01  EXT-KW-3        PIC X(02) VALUE SPACES.
181900 01  EXT-RECVR-3-X.
182000     03  FILLER             BINARY    VALUE 0.
182100     03  EXT-RECVR-3        BINARY    VALUE 0.
182200 01  KW-PL  PIC XX VALUE "PL".
182300******************************************************************
182400
182500 01  PRINT-SCREEN USAGE IS DISPLAY-WS.
182600     03 FILLER PIC X(33) ROW 1 COLUMN 25 VALUE
182700        "*** TESTING THE PRINT VSSUB ***".
182800
182900     03 FILLER PIC X(52) ROW 4 COLUMN 1 VALUE
183000        "NOTE: parameters 'LIBRARY' through 'FORM NUMBER' are".
183100     03 FILLER PIC X(25) ROW 4 COLUMN 54 VALUE
183200        "optional, however, if any".
183300     03 FILLER PIC X(55) ROW 5 COLUMN 7 VALUE
183400        "are present, all preceeding parameters must be present.".
183500     03 FILLER PIC X(21) ROW 7 COLUMN 25 VALUE
183600        "AVAILABLE PARAMETERS:".
183700     03  FILLER PIC X(04) ROW 9 COLUMN 5 VALUE "FILE".
183800     03  FILLER PIC X(08) ROW 9 COLUMN 20
183900         SOURCE PRINT-FILE OBJECT PRINT-FILE.
184000
184100     03  FILLER PIC X(07) ROW 10 COLUMN 5 VALUE "LIBRARY".
184200     03  FILLER PIC X(08) ROW 10 COLUMN 20
184300         SOURCE PRINT-LIB OBJECT PRINT-LIB.
184400
184500     03  FILLER PIC X(06) ROW 11 COLUMN 5 VALUE "VOLUME".
184600     03  FILLER PIC X(06) ROW 11 COLUMN 20
184700         SOURCE PRINT-VOL OBJECT PRINT-VOL.
184800
184900     03  FILLER PIC X(10) ROW 12 COLUMN 5 VALUE "PRINT_MODE".
185000     03  FILLER PIC X(01) ROW 12 COLUMN 20
185100         SOURCE PRINT-MODE OBJECT PRINT-MODE.
185200
185300     03  FILLER PIC X(11) ROW 13 COLUMN 5 VALUE "DISPOSITION".
185400     03  FILLER PIC X(02) ROW 13 COLUMN 20
185500         SOURCE PRINT-DISP OBJECT PRINT-DISP.
185600
185700     03  FILLER PIC X(10) ROW 14 COLUMN 5 VALUE "COPY_COUNT".
185800     03  FILLER PIC 9(03) ROW 14 COLUMN 20
185900         SOURCE PRINT-COPY-CNT OBJECT PRINT-COPY-CNT.
186000
186100     03  FILLER PIC X(11) ROW 15 COLUMN 5 VALUE "PRINT_CLASS".
186200     03  FILLER PIC X(01) ROW 15 COLUMN 20
186300         SOURCE PRINT-CLASS OBJECT PRINT-CLASS.
186400
186500     03  FILLER PIC X(11) ROW 16 COLUMN 5 VALUE "FORM_NUMBER".
186600     03  FILLER PIC 9(03) ROW 16 COLUMN 20
186700         SOURCE PRINT-FORM-NUM OBJECT PRINT-FORM-NUM.
186800
186900     03  FILLER PIC X(54) ROW 18 COLUMN 1 VALUE
187000         "RETURN_CODE -           Not valid/meaningful for PRINT".
187100     03  FILLER PIC 9(04) ROW 18 COLUMN 15
187200         SOURCE PRINT-RET-CODE.
187300
187400     03 FILLER PIC X(40) ROW 20 COLUMN 5
187500        SOURCE PRINT-MESG.
187600
187700     03 FILLER PIC X(43) ROW 23 COLUMN 10 VALUE
187800        "PRESS (ENTER) TO CALL PRINT, (16) TO EXIT".
187900
188000 01  PRINT-FILE      PIC X(08) VALUE SPACES.
188100 01  PRINT-LIB       PIC X(08) VALUE "LIBSPOOL".
188200 01  PRINT-VOL       PIC X(06) VALUE "VOLSPL".
188300 01  PRINT-MODE      PIC X(01) VALUE "S".
188400 01  PRINT-DISP      PIC X(02) VALUE "DS".
188500 01  PRINT-COPY-COUNT.
188600     03  FILLER            BINARY    VALUE 0.
188700     03  PRINT-COPY-CNT    BINARY    VALUE 1.
188800 01  PRINT-CLASS     PIC X(01) VALUE "A".
188900 01  PRINT-FORM-NUMBER.
189000     03  FILLER            BINARY    VALUE 0.
189100     03  PRINT-FORM-NUM    BINARY    VALUE 0.
189200 01  PRINT-RETURN-CODE.
189300     03  FILLER            BINARY    VALUE 0.
189400     03  PRINT-RET-CODE    BINARY    VALUE 0.
189500 01  PRINT-MESG      PIC X(40) VALUE SPACES.
189600
189700******************************************************************
189800
189900 01  BELL-PAUSE-SCREEN USAGE IS DISPLAY-WS.
190000     03 FILLER PIC X(39) ROW 1 COLUMN 20 VALUE
190100        "*** TESTING THE BELL/PAUSE VSSUBS ***".
190200
190300     03 FILLER PIC X(36) ROW 4 COLUMN 25 VALUE
190400        "(1) = Call BELL     (2) = Call PAUSE".
190500     03 FILLER PIC X(25) ROW 7 COLUMN 05 VALUE
190600        "Enter the period of time:".
190700     03  FILLER PIC 9(03) ROW 7 COLUMN 46
190800         SOURCE BELL-PAUSE-TIME OBJECT BELL-PAUSE-TIME.
190900     03 FILLER PIC X(40) ROW 20 COLUMN 5
191000        SOURCE BELL-PAUSE-MESG.
191100     03 FILLER PIC X(39) ROW 23 COLUMN 10 VALUE
191200        "HIT APPROPRIATE PF KEY, (16) TO EXIT".
191300
191400 01  BELL-PAUSE-TIME-LEN.
191500     03  FILLER            BINARY    VALUE 0.
191600     03  BELL-PAUSE-TIME   BINARY    VALUE 0.
191700 01  BELL-PAUSE-MESG      PIC X(40) VALUE SPACES.
191800
191900
192000******************************************************************
192100
192200 01  SORTCALL-SCREEN USAGE IS DISPLAY-WS.
192300     03 FILLER PIC X(46) ROW 1 COLUMN 17 VALUE
192400        "*** TESTING THE SORTCALL/WISPSORT VSSUBS ***".
192500
192600     03 FILLER PIC X(24) ROW 4 COLUMN 27 VALUE
192700        "FILE     LIBRARY  VOLUME".
192800
192900     03 FILLER PIC X(6) ROW 5 COLUMN 20 VALUE "INPUT ".
193000     03 FILLER PIC X(8) ROW 5 COLUMN 27
193100        SOURCE SC-INFILE   OBJECT SC-INFILE.
193200     03 FILLER PIC X(8) ROW 5 COLUMN 36
193300        SOURCE SC-INLIB    OBJECT SC-INLIB.
193400     03 FILLER PIC X(6) ROW 5 COLUMN 45
193500        SOURCE SC-INVOL    OBJECT SC-INVOL.
193600
193700     03 FILLER PIC X(6) ROW 6 COLUMN 20 VALUE "OUTPUT".
193800     03 FILLER PIC X(8) ROW 6 COLUMN 27
193900        SOURCE SC-OUTFILE   OBJECT SC-OUTFILE.
194000     03 FILLER PIC X(8) ROW 6 COLUMN 36
194100        SOURCE SC-OUTLIB    OBJECT SC-OUTLIB.
194200     03 FILLER PIC X(6) ROW 6 COLUMN 45
194300        SOURCE SC-OUTVOL    OBJECT SC-OUTVOL.
194400
194500     03 FILLER PIC X(26) ROW 8 COLUMN 27 VALUE
194600        "POSITION LENGTH TYPE ORDER".
194700
194800     03 FILLER PIC X(4) ROW  9 COLUMN 20 VALUE "KEY1".
194900     03 FILLER PIC X(4) ROW 10 COLUMN 20 VALUE "KEY2".
195000     03 FILLER PIC X(4) ROW 11 COLUMN 20 VALUE "KEY3".
195100     03 FILLER PIC X(4) ROW 12 COLUMN 20 VALUE "KEY4".
195200     03 FILLER PIC X(4) ROW 13 COLUMN 20 VALUE "KEY5".
195300     03 FILLER PIC X(4) ROW 14 COLUMN 20 VALUE "KEY6".
195400     03 FILLER PIC X(4) ROW 15 COLUMN 20 VALUE "KEY7".
195500     03 FILLER PIC X(4) ROW 16 COLUMN 20 VALUE "KEY8".
195600     03 FILLER PIC ZZZZ ROW  9 COLUMN 27
195700        SOURCE SC-POS1      OBJECT SC-POS1.
195800     03 FILLER PIC ZZZZ ROW 10 COLUMN 27
195900        SOURCE SC-POS2      OBJECT SC-POS2.
196000     03 FILLER PIC ZZZZ ROW 11 COLUMN 27
196100        SOURCE SC-POS3      OBJECT SC-POS3.
196200     03 FILLER PIC ZZZZ ROW 12 COLUMN 27
196300        SOURCE SC-POS4      OBJECT SC-POS4.
196400     03 FILLER PIC ZZZZ ROW 13 COLUMN 27
196500        SOURCE SC-POS5      OBJECT SC-POS5.
196600     03 FILLER PIC ZZZZ ROW 14 COLUMN 27
196700        SOURCE SC-POS6      OBJECT SC-POS6.
196800     03 FILLER PIC ZZZZ ROW 15 COLUMN 27
196900        SOURCE SC-POS7      OBJECT SC-POS7.
197000     03 FILLER PIC ZZZZ ROW 16 COLUMN 27
197100        SOURCE SC-POS8      OBJECT SC-POS8.
197200
197300     03 FILLER PIC ZZZ  ROW  9 COLUMN 36
197400        SOURCE SC-LEN1      OBJECT SC-LEN1.
197500     03 FILLER PIC ZZZ  ROW 10 COLUMN 36
197600        SOURCE SC-LEN2      OBJECT SC-LEN2.
197700     03 FILLER PIC ZZZ  ROW 11 COLUMN 36
197800        SOURCE SC-LEN3      OBJECT SC-LEN3.
197900     03 FILLER PIC ZZZ  ROW 12 COLUMN 36
198000        SOURCE SC-LEN4      OBJECT SC-LEN4.
198100     03 FILLER PIC ZZZ  ROW 13 COLUMN 36
198200        SOURCE SC-LEN5      OBJECT SC-LEN5.
198300     03 FILLER PIC ZZZ  ROW 14 COLUMN 36
198400        SOURCE SC-LEN6      OBJECT SC-LEN6.
198500     03 FILLER PIC ZZZ  ROW 15 COLUMN 36
198600        SOURCE SC-LEN7      OBJECT SC-LEN7.
198700     03 FILLER PIC ZZZ  ROW 16 COLUMN 36
198800        SOURCE SC-LEN8      OBJECT SC-LEN8.
198900
199000     03 FILLER PIC X    ROW  9 COLUMN 43
199100        SOURCE SC-TYPE1     OBJECT SC-TYPE1.
199200     03 FILLER PIC X    ROW 10 COLUMN 43
199300        SOURCE SC-TYPE2     OBJECT SC-TYPE2.
199400     03 FILLER PIC X    ROW 11 COLUMN 43
199500        SOURCE SC-TYPE3     OBJECT SC-TYPE3.
199600     03 FILLER PIC X    ROW 12 COLUMN 43
199700        SOURCE SC-TYPE4     OBJECT SC-TYPE4.
199800     03 FILLER PIC X    ROW 13 COLUMN 43
199900        SOURCE SC-TYPE5     OBJECT SC-TYPE5.
200000     03 FILLER PIC X    ROW 14 COLUMN 43
200100        SOURCE SC-TYPE6     OBJECT SC-TYPE6.
200200     03 FILLER PIC X    ROW 15 COLUMN 43
200300        SOURCE SC-TYPE7     OBJECT SC-TYPE7.
200400     03 FILLER PIC X    ROW 16 COLUMN 43
200500        SOURCE SC-TYPE8     OBJECT SC-TYPE8.
200600
200700     03 FILLER PIC X    ROW  9 COLUMN 48
200800        SOURCE SC-ORDER1    OBJECT SC-ORDER1.
200900     03 FILLER PIC X    ROW 10 COLUMN 48
201000        SOURCE SC-ORDER2    OBJECT SC-ORDER2.
201100     03 FILLER PIC X    ROW 11 COLUMN 48
201200        SOURCE SC-ORDER3    OBJECT SC-ORDER3.
201300     03 FILLER PIC X    ROW 12 COLUMN 48
201400        SOURCE SC-ORDER4    OBJECT SC-ORDER4.
201500     03 FILLER PIC X    ROW 13 COLUMN 48
201600        SOURCE SC-ORDER5    OBJECT SC-ORDER5.
201700     03 FILLER PIC X    ROW 14 COLUMN 48
201800        SOURCE SC-ORDER6    OBJECT SC-ORDER6.
201900     03 FILLER PIC X    ROW 15 COLUMN 48
202000        SOURCE SC-ORDER7    OBJECT SC-ORDER7.
202100     03 FILLER PIC X    ROW 16 COLUMN 48
202200        SOURCE SC-ORDER8    OBJECT SC-ORDER8.
202300
202400     03 FILLER PIC X(15) ROW 18 COLUMN 3 VALUE "(WISPSORT ONLY)".
202500     03 FILLER PIC X(8)  ROW 18 COLUMN 20 VALUE "FILETYPE".
202600     03 FILLER PIC X     ROW 18 COLUMN 29
202700        SOURCE SC-FILETYPE    OBJECT SC-FILETYPE.
202800     03 FILLER PIC X(7)  ROW 18 COLUMN 32 VALUE "RECSIZE".
202900     03 FILLER PIC ZZZZ9 ROW 18 COLUMN 40
203000        SOURCE SC-RECSIZE-N    OBJECT SC-RECSIZE-N.
203100     03 FILLER PIC X(8)  ROW 18 COLUMN 47 VALUE "SORTCODE".
203200     03 FILLER PIC ZZZZ9 ROW 18 COLUMN 56
203300        SOURCE SC-SORTCODE-Z.
203400     03 FILLER PIC X(10) ROW 20 COLUMN 20 VALUE "RETURNCODE".
203500     03 SORTCALL-RC-S PIC ZZZZ9 ROW 20 COLUMN 31
203600        SOURCE SC-RETURNCODE-N.
203700
203750     03 FILLER PIC X(50) ROW 23 COLUMN 25 VALUE
203770        "(1) DISPLAY-out (8) Auto-Test".
203800     03 FILLER PIC X(50) ROW 24 COLUMN 25 VALUE
203900        "(ENTER) continue (16) to EXIT".
204000
       01  SC-FILESTAT		       PIC XX.
       
       01  SORTCALL-TEST-DATA.
	   03  SORTCALL-TEST-STATUS    PIC X.
	       88 SORTCALL-TEST-FAILED VALUE "F".
	       88 SORTCALL-TEST-OK     VALUE "P".
	   03  SORTCALL-TEST-ID	       PIC 9(4) VALUE ZERO.
	   03  SORTCALL-TESTED	       PIC 9(4) VALUE ZERO.
	   03  SORTCALL-FAILED	       PIC 9(4) VALUE ZERO.
	   
	   03  SORTCALL-INFILE	       PIC X(8).
	   03  SORTCALL-RECCNT	       PIC 9(5).
	   03  SORTCALL-LAST-KEY       PIC 9(10).
	   03  SORTCALL-MAX-KEY	       PIC 9(10).
	   
204100 01  SC-PARMS.
204200     03  SC-INFILE              PIC X(8) VALUE "BFILE".
204300     03  SC-INLIB               PIC X(8) VALUE "LIBOUT".
204400     03  SC-INVOL               PIC X(6) VALUE "VOLOUT".
204500     03  SC-OUTFILE             PIC X(8) VALUE "BFILEX".
204600     03  SC-OUTLIB              PIC X(8) VALUE "LIBOUT".
204700     03  SC-OUTVOL              PIC X(6) VALUE "VOLOUT".
204800     03  SC-POS1                PIC Z(4) VALUE "1".
204900     03  SC-LEN1                PIC Z(3) VALUE "1".
205000     03  SC-TYPE1               PIC X    VALUE "C".
205100     03  SC-ORDER1              PIC X    VALUE "A".
205200     03  SC-POS2                PIC Z(4) VALUE "2".
205300     03  SC-LEN2                PIC Z(3) VALUE "1".
205400     03  SC-TYPE2               PIC X    VALUE "C".
205500     03  SC-ORDER2              PIC X    VALUE "D".
205600     03  SC-POS3                PIC Z(4) VALUE ZERO.
205700     03  SC-LEN3                PIC Z(3) VALUE ZERO.
205800     03  SC-TYPE3               PIC X    VALUE "C".
205900     03  SC-ORDER3              PIC X    VALUE "A".
206000     03  SC-POS4                PIC Z(4) VALUE ZERO.
206100     03  SC-LEN4                PIC Z(3) VALUE ZERO.
206200     03  SC-TYPE4               PIC X    VALUE "C".
206300     03  SC-ORDER4              PIC X    VALUE "A".
206400     03  SC-POS5                PIC Z(4) VALUE ZERO.
206500     03  SC-LEN5                PIC Z(3) VALUE ZERO.
206600     03  SC-TYPE5               PIC X    VALUE "C".
206700     03  SC-ORDER5              PIC X    VALUE "A".
206800     03  SC-POS6                PIC Z(4) VALUE ZERO.
206900     03  SC-LEN6                PIC Z(3) VALUE ZERO.
207000     03  SC-TYPE6               PIC X    VALUE "C".
207100     03  SC-ORDER6              PIC X    VALUE "A".
207200     03  SC-POS7                PIC Z(4) VALUE ZERO.
207300     03  SC-LEN7                PIC Z(3) VALUE ZERO.
207400     03  SC-TYPE7               PIC X    VALUE "C".
207500     03  SC-ORDER7              PIC X    VALUE "A".
207600     03  SC-POS8                PIC Z(4) VALUE ZERO.
207700     03  SC-LEN8                PIC Z(3) VALUE ZERO.
207800     03  SC-TYPE8               PIC X    VALUE "C".
207900     03  SC-ORDER8              PIC X    VALUE "A".
208000
208100 01  SC-FILETYPE                PIC X VALUE "I".
208200
208300 01  SC-RECSIZE.
208400     03  SC-RECSIZE-B1  BINARY VALUE 0.
208500     03  SC-RECSIZE-B2  BINARY VALUE 0.
208600 01  SC-RECSIZE-N               PIC 9999.
208700
208800 01  SC-SORTCODE.
208900     03  SC-SORTCODE-B1  BINARY VALUE 0.
209000     03  SC-SORTCODE-B2  BINARY VALUE 0.
209100 01  SC-SORTCODE-Z              PIC Z(5).
209200
209300 01  SC-RETURNCODE.
209400     03  SC-RETURNCODE-B1  BINARY VALUE 0.
209500     03  SC-RETURNCODE-B2  BINARY VALUE 0.
209600 01  SC-RETURNCODE-N            PIC 9999.
209700
209800******************************************************************
209900
210000 01  SCRATCH-SCREEN USAGE IS DISPLAY-WS.
210100     03 FILLER PIC X(35) ROW 1 COLUMN 20 VALUE
210200        "*** TESTING THE SCRATCH VSSUB ***".
210300
210400     03  FILLER PIC X(04) ROW 4 COLUMN  1 VALUE "TYPE".
210500     03  FILLER PIC X(01) ROW 4 COLUMN 17
210600         SOURCE SCRATCH-TYPE OBJECT SCRATCH-TYPE.
210700     03  FILLER PIC X(16) ROW 4 COLUMN 40 VALUE
210800         "F = File Scratch".
210900     03  FILLER PIC X(19) ROW 5 COLUMN 40 VALUE
211000         "L = Library Scratch".
211100
211200     03  FILLER PIC X(09) ROW 7 COLUMN  1 VALUE "FILE NAME".
211300     03  FILLER PIC X(08) ROW 7 COLUMN 17
211400         SOURCE SCRATCH-FNAME OBJECT SCRATCH-FNAME.
211500     03  FILLER PIC X(36) ROW 7 COLUMN 40 VALUE
211600         "Must be included, ignored if TYPE L.".
211700
211800     03  FILLER PIC X(10) ROW 8 COLUMN 1 VALUE "WISPFILEXT".
211900     03  SCRATCH-EXT-TEXT PIC X(39) ROW 8 COLUMN 17
212000         SOURCE SCRATCH-EXT OBJECT SCRATCH-EXT.
212100
212200     03  FILLER PIC X(7) ROW 9 COLUMN  1 VALUE "LIBRARY".
212300     03  FILLER PIC X(8) ROW 9 COLUMN 17
212400         SOURCE SCRATCH-LIBNAME OBJECT SCRATCH-LIBNAME.
212500
212600     03  FILLER PIC X(6) ROW 10 COLUMN  1 VALUE "VOLUME".
212700     03  FILLER PIC X(6) ROW 10 COLUMN 17
212800         SOURCE SCRATCH-VOL OBJECT SCRATCH-VOL.
212900
213000     03  FILLER PIC X(15) ROW 12 COLUMN  1 VALUE
213100         "EXP. DATE CHECK".
213200     03  FILLER PIC X(01) ROW 12 COLUMN 17
213300         SOURCE SCRATCH-EXP-DATE-CHECK
213400         OBJECT SCRATCH-EXP-DATE-CHECK.
213500     03  FILLER PIC X(22) ROW 12 COLUMN 40 VALUE
213600         "B = Bypass date check.".
213700     03  FILLER PIC X(17) ROW 13 COLUMN 40 VALUE
213800         "blank = No bypass".
213900     03  FILLER PIC X(40) ROW 14 COLUMN 40 VALUE
214000         "(optional unless ACCESS flag is present)".
214100
214200     03  FILLER PIC X(11) ROW 16 COLUMN  1 VALUE "ACCESS FLAG".
214300     03  FILLER PIC X(01) ROW 16 COLUMN 17
214400         SOURCE SCRATCH-ACCESS-LIMITS-FLAG
214500         OBJECT SCRATCH-ACCESS-LIMITS-FLAG.
214600     03  FILLER PIC X(18) ROW 16 COLUMN 40 VALUE
214700         "L = Limit to users".
214800     03  FILLER PIC X(39) ROW 17 COLUMN 40 VALUE
214900         "blank = programs full access (optional)".
215000
215100     03  FILLER PIC X(11) ROW 20 COLUMN  1 VALUE "RETURN-CODE".
215200     03  SCRATCH-RC-S PIC ZZZ9 ROW 20 COLUMN 17
215300         SOURCE SCRATCH-RET-CODE.
215400
215500     03 FILLER PIC X(44) ROW 23 COLUMN 05 VALUE
215600        "PRESS (ENTER) TO CALL SCRATCH, (16) TO EXIT".
215700
215800 01  SCRATCH-TYPE               PIC X(01) VALUE "F".
215810 01  SCRATCH-TYPE-FILE          PIC X(01) VALUE "F".
215820 01  SCRATCH-TYPE-LIBRARY       PIC X(01) VALUE "L".
215900 01  SCRATCH-FNAME              PIC X(08) VALUE SPACES.
216000 01  SCRATCH-EXT                PIC X(39) VALUE SPACES.
216100 01  SCRATCH-LIBNAME            PIC X(08) VALUE "LIBSPOOL".
216200 01  SCRATCH-VOL                PIC X(06) VALUE "VOLSPL".
216300 01  SCRATCH-EXP-DATE-CHECK     PIC X(01) VALUE SPACES.
216400 01  SCRATCH-ACCESS-LIMITS-FLAG PIC X(01) VALUE SPACES.
216500 01  SCRATCH-RETURN-CODE.
216600     03  FILLER                 BINARY    VALUE 0.
216700     03  SCRATCH-RET-CODE       BINARY    VALUE 0.
216800
216900******************************************************************
217000 01  SET-KW                     PIC X(02)  VALUE SPACES.
217100 01  SET-VALX                   PIC X(20)  VALUE SPACES.
217200 01  SET-VALB.
217300     03  SET-VALB-1                BINARY  VALUE 0.
217400     03  SET-VALB-2                BINARY  VALUE 0.
217500 01  SET-SCREEN USAGE IS DISPLAY-WS.
217600     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
217700        "     *** TESTING the SET VSSUB ***".
217800
217900     03 FILLER PIC X(11) ROW 5 COLUMN 5 VALUE "    KEYWORD".
218000     03 FILLER PIC X(02) ROW 5 COLUMN 22
218100        SOURCE SET-KW OBJECT SET-KW.
218200     03 FILLER PIC X(15) ROW 7 COLUMN 5 VALUE "(1) VALUE X(20)".
218300     03 FILLER PIC X(20) ROW 7 COLUMN 22  OBJECT SET-VALX.
218400     03 FILLER PIC X(15) ROW 8 COLUMN 5 VALUE "(2) VALUE 9(05)".
218500     03 FILLER PIC 9(05) ROW 8 COLUMN 22  OBJECT SET-VALB-2.
218600
218700     03  FILLER PIC X(29) ROW 21 COLUMN 25 VALUE
218800         "Enter the appropriate PF key:".
218900
219000     03  FILLER PIC X(27) ROW 22 COLUMN 25 VALUE
219100         "(1) = Alpha   (2) = Int".
219200
219300     03  FILLER PIC X(40) ROW 24 COLUMN 20 VALUE
219400         "PRESS (ENTER) TO CONTINUE, (16) TO EXIT".
219500
219600******************************************************************
219700
219800 01  RENAME-SCREEN USAGE IS DISPLAY-WS.
219900     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
220000        "     *** TESTING the RENAME VSSUB ***".
220100
220200     03  FILLER PIC X(30) ROW 4 COLUMN 28
220300         SOURCE RENAME-TITLE.
220400
220500     03  FILLER PIC X(4) ROW 6 COLUMN 15 VALUE "FILE".
220600     03  FILLER PIC X(8) ROW 6 COLUMN 20
220700         SOURCE RENAME-FILE OBJECT RENAME-FILE.
220800
220900     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
221000     03  FILLER PIC X(8) ROW 6 COLUMN 38
221100         SOURCE RENAME-LIB OBJECT RENAME-LIB.
221200
221300     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
221400     03  FILLER PIC X(6) ROW 6 COLUMN 55
221500         SOURCE RENAME-VOL OBJECT RENAME-VOL.
221600
221700     03  FILLER PIC X(10) ROW 7 COLUMN 15 VALUE "WISPFILEXT".
221800     03  RENAME-EXTENTION PIC X(3) ROW 7 COLUMN 26
221900         SOURCE RENAME-EXT OBJECT RENAME-EXT.
222000
222100     03  FILLER PIC X(8) ROW 9 COLUMN 11 VALUE "NEW FILE".
222200     03  FILLER PIC X(8) ROW 9 COLUMN 20
222300         SOURCE RENAME-NEW-FILE OBJECT RENAME-NEW-FILE.
222400
222500     03  FILLER PIC X(11) ROW 9 COLUMN 30 VALUE "NEW LIBRARY".
222600     03  FILLER PIC X(8) ROW 9 COLUMN 42
222700         SOURCE RENAME-NEW-LIB OBJECT RENAME-NEW-LIB.
222800
222900     03  FILLER PIC X(6) ROW 11 COLUMN 15 VALUE "BYPASS".
223000     03  FILLER PIC X(1) ROW 11 COLUMN 22
223100         SOURCE RENAME-BYPASS OBJECT RENAME-BYPASS.
223200
223300     03  FILLER PIC X(6) ROW 11 COLUMN 30 VALUE "ACCESS".
223400     03  FILLER PIC X(1) ROW 11 COLUMN 38
223500         SOURCE RENAME-ACCESS OBJECT RENAME-ACCESS.
223600
223700     03  FILLER PIC X(4) ROW 11 COLUMN 48 VALUE "OPEN".
223800     03  FILLER PIC X(1) ROW 11 COLUMN 53
223900         SOURCE RENAME-OPEN OBJECT RENAME-OPEN.
224000
224100     03  FILLER PIC X(11) ROW 14 COLUMN 15 VALUE "RETURN-CODE".
224200     03  FILLER PIC -----9 ROW 14 COLUMN 27
224300         SOURCE RENAME-RETURN-X.
224400
224500     03  FILLER PIC X(29) ROW 21 COLUMN 25 VALUE
224600         "Enter the appropriate PF key:".
224700
224800     03  FILLER PIC X(27) ROW 22 COLUMN 25 VALUE
224900         "(1) = F   (2) = L   (3) = G".
225000
225100     03  FILLER PIC X(45) ROW 24 COLUMN 20 VALUE
225200         "(ENTER) CONTINUE, (8) AUTOTEST (16) TO EXIT".
225300
225400 01  RENAME-TITLE                 PIC X(40) VALUE SPACES.
225500 01  RENAME-TYPE                  PIC X(1) VALUE SPACES.
225600 01  RENAME-FILE                  PIC X(8) VALUE SPACES.
225700 01  RENAME-EXT                   PIC X(3) VALUE SPACES.
225800 01  RENAME-EXT-FULL              PIC X(39) VALUE SPACES.
225900 01  RENAME-LIB                   PIC X(8) VALUE SPACES.
226000 01  RENAME-VOL                   PIC X(6) VALUE SPACES.
226100 01  RENAME-NEW-FILE              PIC X(8) VALUE SPACES.
226200 01  RENAME-NEW-LIB               PIC X(8) VALUE SPACES.
226300 01  RENAME-BYPASS                PIC X(1) VALUE SPACES.
226400 01  RENAME-ACCESS                PIC X(1) VALUE SPACES.
226500 01  RENAME-OPEN                  PIC X(1) VALUE SPACES.
226600 01  RENAME-RETURN.
226700     03 RENAME-RETURN-1           BINARY    VALUE ZERO.
226800     03 RENAME-RETURN-2           BINARY    VALUE ZERO.
226900 01  RENAME-RETURN-X              PIC S99999 VALUE ZERO.
226901 01  RENAME-FAILED PIC 9999.
227000
227100******************************************************************
227200
227300 01  FILECOPY-SCREEN USAGE IS DISPLAY-WS.
227400     03 FILLER PIC X(40) ROW 2 COLUMN 20 VALUE
227500        "*** TESTING the FILECOPY VSSUB ***".
227600
227700     03  FILLER PIC X(30) ROW 4 COLUMN 28
227800         SOURCE FILECOPY-TITLE.
227900
228000     03  FILLER PIC X(3) ROW 6 COLUMN 5 VALUE "OLD".
228100     03  FILLER PIC X(4) ROW 6 COLUMN 15 VALUE "FILE".
228200     03  FILLER PIC X(8) ROW 6 COLUMN 20
228300         SOURCE FILECOPY-OFILE OBJECT FILECOPY-OFILE.
228400
228500     03  FILLER PIC X(7) ROW 6 COLUMN 30 VALUE "LIBRARY".
228600     03  FILLER PIC X(8) ROW 6 COLUMN 38
228700         SOURCE FILECOPY-OLIB OBJECT FILECOPY-OLIB.
228800
228900     03  FILLER PIC X(6) ROW 6 COLUMN 48 VALUE "VOLUME".
229000     03  FILLER PIC X(6) ROW 6 COLUMN 55
229100         SOURCE FILECOPY-OVOL OBJECT FILECOPY-OVOL.
229200
229300     03  FILLER PIC X(3) ROW 8 COLUMN 5 VALUE "NEW".
229400     03  FILLER PIC X(4) ROW 8 COLUMN 15 VALUE "FILE".
229500     03  FILLER PIC X(8) ROW 8 COLUMN 20
229600         SOURCE FILECOPY-NFILE OBJECT FILECOPY-NFILE.
229700
229800     03  FILLER PIC X(7) ROW 8 COLUMN 30 VALUE "LIBRARY".
229900     03  FILLER PIC X(8) ROW 8 COLUMN 38
230000         SOURCE FILECOPY-NLIB OBJECT FILECOPY-NLIB.
230100
230200     03  FILLER PIC X(6) ROW 8 COLUMN 48 VALUE "VOLUME".
230300     03  FILLER PIC X(6) ROW 8 COLUMN 55
230400         SOURCE FILECOPY-NVOL OBJECT FILECOPY-NVOL.
230500
230600     03  FILLER PIC X(11) ROW 14 COLUMN 15 VALUE "RETURN-CODE".
230700     03  FILLER PIC -----9 ROW 14 COLUMN 27
230800         SOURCE FILECOPY-RETURN-X.
230900
231000     03  FILLER PIC X(40) ROW 24 COLUMN 20 VALUE
231100         "PRESS (ENTER) TO CONTINUE, (16) TO EXIT".
231200
231300 01  FILECOPY-TITLE                 PIC X(40) VALUE SPACES.
231400 01  FILECOPY-OFILE                 PIC X(8) VALUE "BFILE".
231500 01  FILECOPY-OLIB                  PIC X(8) VALUE "LIBOUT".
231600 01  FILECOPY-OVOL                  PIC X(6) VALUE "VOLOUT".
231700 01  FILECOPY-NFILE                 PIC X(8) VALUE "COPY".
231800 01  FILECOPY-NLIB                  PIC X(8) VALUE "LIBRN".
231900 01  FILECOPY-NVOL                  PIC X(6) VALUE "VOLOUT".
232000 01  FILECOPY-RETURN.
232100     03 FILECOPY-RETURN-1           BINARY    VALUE ZERO.
232200     03 FILECOPY-RETURN-2           BINARY    VALUE ZERO.
232300 01  FILECOPY-RETURN-X              PIC S99999 VALUE ZERO.
232400
232500/*****************************************************************
232600*                                                                *
232700*                   DISPLAY DEFINITIONS                          *
232800*                                                                *
232900******************************************************************
233000*
233100
233200 01  LINK-FAILED-SCREEN USAGE IS DISPLAY-WS.
233300     03  FILLER PIC X(29) ROW 5 COLUMN 20
233400         VALUE
233500         "THE DYNAMIC LINK/CALL FAILED!".
233600
233700******************************************************************
233800
233900 01  GETPARM-DONE-SCREEN USAGE IS DISPLAY-WS.
234000     03  FILLER PIC X(29) ROW 5 COLUMN 20
234100         VALUE
234200         "THE GETPARM HAS FINISHED.    ".
234300
234400******************************************************************
234500
234600 01  LINK-PARAMETER-SCREEN USAGE IS DISPLAY-WS.
234700     03  FILLER PIC X(40) ROW 5 COLUMN 20
234800         VALUE
234900         "THE PARAMETERS TO THE DYNAMIC LINK.     ".
235000
235100     03  FILLER PIC X(8)  ROW 10 COLUMN 30 VALUE "LINKARG1".
235200     03  FILLER PIC X(10) ROW 10 COLUMN 40
235300         SOURCE LINKARG1 OBJECT LINKARG1.
235400
235500     03  FILLER PIC X(8)  ROW 12 COLUMN 30 VALUE "LINKARG2".
235600     03  FILLER PIC X(10) ROW 12 COLUMN 40
235700         SOURCE LINKARG2 OBJECT LINKARG2.
235800
235900     03  FILLER PIC X(8)  ROW 14 COLUMN 30 VALUE "LINKARG3".
236000     03  FILLER PIC X(10) ROW 14 COLUMN 40
236100         SOURCE LINKARG3 OBJECT LINKARG3.
236200
236300******************************************************************
236400
236500 01  FILE-LIB-VOL USAGE IS DISPLAY-WS.
236600     03  FILLER PIC X(40) ROW 5 COLUMN 20
236700         SOURCE FLV-TITLE.
236800
236900     03  FILLER PIC X(4) ROW 12 COLUMN 15 VALUE "FILE".
237000     03  FILLER PIC X(8) ROW 12 COLUMN 20
237100         SOURCE FLV-FILE OBJECT FLV-FILE.
237200
237300     03  FILLER PIC X(7) ROW 12 COLUMN 30 VALUE "LIBRARY".
237400     03  FILLER PIC X(8) ROW 12 COLUMN 38
237500         SOURCE FLV-LIB OBJECT FLV-LIB.
237600
237700     03  FILLER PIC X(6) ROW 12 COLUMN 48 VALUE "VOLUME".
237800     03  FILLER PIC X(6) ROW 12 COLUMN 55
237900         SOURCE FLV-VOL OBJECT FLV-VOL.
238000
238100******************************************************************
238200
238300 01  SUBROUTINE-SCREEN USAGE IS DISPLAY-WS.
238400     03  FILLER  PIC X(11) ROW 1 COLUMN 20 VALUE
238500         "TRY THINGS:".
238600     03  FILLER  PIC X(35) ROW 1 COLUMN 60 VALUE
238700         "VSSUBS-SCREEN".
238800     03  FILLER  PIC X(35) ROW 3 COLUMN 2 VALUE
238900         "(1)  READFDR(4).".
239000     03  FILLER  PIC X(35) ROW 4 COLUMN 2 VALUE
239100         "(2)  FIND.".
239200     03  FILLER  PIC X(35) ROW 5 COLUMN 2 VALUE
239300         "(3)  PUTPARM & LINK TO DISPLAY".
239400     03  FILLER  PIC X(35) ROW 6 COLUMN 2 VALUE
239500         "(4)  DAY".
239600     03  FILLER  PIC X(38) ROW 7 COLUMN 2 VALUE
239700         "(5)  GETPARM (UNIX test # parameters).".
239800     03  FILLER  PIC X(35) ROW 8 COLUMN 2 VALUE
239900         "(6)  SUBMIT".
240000     03  FILLER  PIC X(35) ROW 9 COLUMN 2 VALUE
240100         "(7)  DATE".
240200     03  FILLER  PIC X(35) ROW 10 COLUMN 2 VALUE
240300         "(8)  LINK".
240400     03  FILLER  PIC X(35) ROW 11 COLUMN 2 VALUE
240500         "(9)  MESSAGE".
240600     03  FILLER  PIC X(35) ROW 12 COLUMN 2 VALUE
240700         "(10) WCHAIN".
240800     03  FILLER  PIC X(35) ROW 13 COLUMN 2 VALUE
240900         "(11) EXTRACT".
241000     03  FILLER  PIC X(35) ROW 14 COLUMN 2 VALUE
241100         "(12) PRINT".
241200     03  FILLER  PIC X(35) ROW 15 COLUMN 2 VALUE
241300         "(13) LINKPROC".
241400     03  FILLER  PIC X(35) ROW 16 COLUMN 2 VALUE
241500         "(14) BELL/PAUSE".
241600     03  FILLER  PIC X(35) ROW 17 COLUMN 2 VALUE
241700         "(15) SCRATCH".
241800     03  FILLER  PIC X(35) ROW 19 COLUMN 2 VALUE
241900         "(16) EXIT".
242000     03  FILLER  PIC X(35) ROW 3 COLUMN 40 VALUE
242100         "(17) LOGOFF".
242200     03  FILLER  PIC X(35) ROW 4 COLUMN 40 VALUE
242300         "(18) PUTPARM".
242400     03  FILLER  PIC X(35) ROW 5 COLUMN 40 VALUE
242500         "(19) GETPARM".
242600     03  FILLER  PIC X(35) ROW 6 COLUMN 40 VALUE
242700         "(20) SOFTLINK/HARDLINK".
242800     03  FILLER  PIC X(35) ROW 7 COLUMN 40 VALUE
242900         "(21) BITPACK/BITUNPK".
243000     03  FILLER  PIC X(35) ROW 8 COLUMN 40 VALUE
243100         "(22) HEXPACK/HEXUNPK".
243200     03  FILLER  PIC X(35) ROW 9 COLUMN 40 VALUE
243300         "(23) SEARCH".
243400     03  FILLER  PIC X(35) ROW 10 COLUMN 40 VALUE
243500         "(24) SORTCALL/WISPSORT".
243600     03  FILLER  PIC X(35) ROW 11 COLUMN 40 VALUE
243700         "(25) RENAME".
243800     03  FILLER  PIC X(35) ROW 12 COLUMN 40 VALUE
243900         "(26) SET".
244000     03  FILLER  PIC X(35) ROW 13 COLUMN 40 VALUE
244100         "(27) READVTOC".
244200     03  FILLER  PIC X(35) ROW 14 COLUMN 40 VALUE
244300         "(28) FILECOPY".
244400     03  FILLER  PIC X(35) ROW 15 COLUMN 40 VALUE
244500         "(29) WSXIO".
244600     03  FILLER  PIC X(35) ROW 16 COLUMN 40 VALUE
244700         "(30) STRING".
244800     03  FILLER  PIC X(35) ROW 17 COLUMN 40 VALUE
244900         "(31) COBLINK".
245000     03  FILLER  PIC X(35) ROW 19 COLUMN 40 VALUE
245100         "(32) AUTOTESTS (WL0000)".
245200     03  FILLER  PIC X(23) ROW 24 COLUMN 10 VALUE
245300         "PRESS (16) TO EXIT".
245400
257900******************************************************************
258000
258100 01  SEARCH-ITEM PIC X(14) VALUE SPACES.
258200 01  SEARCH-LEN PIC 9(2) VALUE ZERO.
258300 01  SEARCH-RETURN PIC 9(5) VALUE ZERO.
258400
258500 01  SEARCH-LIST.
258600     03 FILLER  PIC X(14) VALUE "Australia     ".
258700     03 FILLER  PIC X(14) VALUE "Austria       ".
258800     03 FILLER  PIC X(14) VALUE "Belgium       ".
258900     03 FILLER  PIC X(14) VALUE "Canada        ".
259000     03 FILLER  PIC X(14) VALUE "Finland       ".
259100     03 FILLER  PIC X(14) VALUE "France        ".
259200     03 FILLER  PIC X(14) VALUE "Germany       ".
259300     03 FILLER  PIC X(14) VALUE "Hong Kong     ".
259400     03 FILLER  PIC X(14) VALUE "Ireland       ".
259500     03 FILLER  PIC X(14) VALUE "Italy         ".
259600     03 FILLER  PIC X(14) VALUE "Japan         ".
259700     03 FILLER  PIC X(14) VALUE "Mexico        ".
259800     03 FILLER  PIC X(14) VALUE "Netherlands   ".
259900     03 FILLER  PIC X(14) VALUE "Scotland      ".
260000     03 FILLER  PIC X(14) VALUE "United States ".
260100     03 FILLER  PIC X(14) VALUE "United Kingdom".
260200
260300 01  SEARCH-TABLE REDEFINES SEARCH-LIST.
260400     03 COUNTRY-ITEM PIC X(14) OCCURS 16 TIMES.
260500
260600 01  SEARCH-LIST-REVERSE.
260700     03 FILLER  PIC X(14) VALUE "United Kingdom".
260800     03 FILLER  PIC X(14) VALUE "United States ".
260900     03 FILLER  PIC X(14) VALUE "Scotland      ".
261000     03 FILLER  PIC X(14) VALUE "Netherlands   ".
261100     03 FILLER  PIC X(14) VALUE "Mexico        ".
261200     03 FILLER  PIC X(14) VALUE "Japan         ".
261300     03 FILLER  PIC X(14) VALUE "Italy         ".
261400     03 FILLER  PIC X(14) VALUE "Ireland       ".
261500     03 FILLER  PIC X(14) VALUE "Hong Kong     ".
261600     03 FILLER  PIC X(14) VALUE "Germany       ".
261700     03 FILLER  PIC X(14) VALUE "France        ".
261800     03 FILLER  PIC X(14) VALUE "Finland       ".
261900     03 FILLER  PIC X(14) VALUE "Canada        ".
262000     03 FILLER  PIC X(14) VALUE "Belgium       ".
262100     03 FILLER  PIC X(14) VALUE "Austria       ".
262200     03 FILLER  PIC X(14) VALUE "Australia     ".
262300
262400 01  SEARCH-TABLE-REVERSE REDEFINES SEARCH-LIST-REVERSE.
262500     03 COUNTRY-ITEM-REVERSE PIC X(14) OCCURS 16 TIMES.
262600
262700 01  FOUND-ITEM PIC X(14) VALUE SPACES.
262800
262900 01  SEARCH-LEN-P.
263000     03 FILLER BINARY VALUE 0.
263100     03 SEARCH-LEN-X BINARY VALUE 14.
263200
263300 01  SEARCH-ITEM-LEN-P.
263400     03 FILLER BINARY VALUE 0.
263500     03 FILLER BINARY VALUE 14.
263600
263700 01  SEARCH-TABLE-SIZE-P.
263800     03 FILLER BINARY VALUE 0.
263900     03 FILLER BINARY VALUE 16.
264000
264100 01  SEARCH-RETURN-P.
264200     03 FILLER BINARY VALUE 0.
264300     03 SEARCH-RETURN-X BINARY VALUE 16.
264400
264500 01  SEARCH-SCR USAGE IS DISPLAY-WS.
264600
264700     03  FILLER PIC X(34) ROW 1 COLUMN 20
264800         VALUE "*** TESTING THE SEARCH VSSUB ***".
264900
265000     03  FILLER PIC X(29) ROW 3 COLUMN 22
265100         VALUE "SPECIFY PARAMETERS FOR SEARCH".
265200
265300     03  FILLER PIC X(11) ROW 5 COLUMN 1
265400         VALUE "SEARCH ITEM".
265500
265600     03  SEARCH-ITEM-FIELD PIC X(14) ROW 5 COLUMN 17
265700         SOURCE SEARCH-ITEM OBJECT SEARCH-ITEM.
265800
265900     03  FILLER PIC X(27) ROW 5 COLUMN 40
266000         VALUE "SEARCH ARRAY-> 1: Australia".
266100
266200     03  FILLER PIC X(13) ROW 6 COLUMN 1
266300         VALUE "SEARCH LENGTH".
266400
266500     03  FILLER PIC 9(2) ROW 6 COLUMN 17
266600         SOURCE SEARCH-LEN OBJECT SEARCH-LEN.
266700
266800     03  FILLER PIC X(10) ROW 6 COLUMN 55
266900         VALUE "2: Austria".
267000
267100     03  FILLER PIC X(10) ROW 7 COLUMN 55
267200         VALUE "3: Belgium".
267300
267400     03  FILLER PIC X(11) ROW 8 COLUMN 1
267500         VALUE "RETURN-CODE".
267600
267700     03  FILLER PIC 9(5) ROW 8 COLUMN 17
267800         SOURCE SEARCH-RETURN.
267900
268000     03  FILLER PIC X(9) ROW 8 COLUMN 55
268100         VALUE "4: Canada".
268200
268300     03  FILLER PIC X(10) ROW 9 COLUMN 1
268400         VALUE "FOUND ITEM".
268500
268600     03  FILLER PIC X(14) ROW 9 COLUMN 17
268700         SOURCE FOUND-ITEM.
268800
268900     03  FILLER PIC X(10) ROW 9 COLUMN 55
269000         VALUE "5: Finland".
269100
269200     03  FILLER PIC X(9) ROW 10 COLUMN 55
269300         VALUE "6: France".
269400
269500     03  FILLER PIC X(10) ROW 11 COLUMN 55
269600         VALUE "7: Germany".
269700
269800     03  FILLER PIC X(12) ROW 12 COLUMN 55
269900         VALUE "8: Hong Kong".
270000
270100     03  FILLER PIC X(10) ROW 13 COLUMN 55
270200         VALUE "9: Ireland".
270300
270400     03  FILLER PIC X(9) ROW 14 COLUMN 54
270500         VALUE "10: Italy".
270600
270700     03  FILLER PIC X(9) ROW 15 COLUMN 54
270800         VALUE "11: Japan".
270900
271000     03  FILLER PIC X(10) ROW 16 COLUMN 54
271100         VALUE "12: Mexico".
271200
271300     03  FILLER PIC X(19) ROW 13 COLUMN 1
271400         VALUE "CALL SEARCH ROUTINE".
271500
271600     03  FILLER PIC X(30) ROW 14 COLUMN 1
271700         VALUE "(1) INCLUDE ARG5 (ASCENDING)".
271800
271900     03  FILLER PIC X(27) ROW 15 COLUMN 1
272000         VALUE "(2) OMIT ARG5 (ASCENDING)".
272100
272200     03  FILLER PIC X(31) ROW 16 COLUMN 1
272300         VALUE "(3) INCLUDE ARG5 (DESCENDING)".
272400
272500     03  FILLER PIC X(28) ROW 17 COLUMN 1
272600         VALUE "(4) OMIT ARG5 (DESCENDING)".
272700
272800     03  FILLER PIC X(15) ROW 17 COLUMN 54
272900         VALUE "13: Netherlands".
273000
273100     03  FILLER PIC X(12) ROW 18 COLUMN 54
273200         VALUE "14: Scotland".
273300
273400     03  FILLER PIC X(11) ROW 19 COLUMN 1
273500         VALUE "(16) EXIT".
273600
273700     03  FILLER PIC X(17) ROW 19 COLUMN 54
273800         VALUE "15: United States".
273900
274000     03  FILLER PIC X(18) ROW 20 COLUMN 54
274100         VALUE "16: United Kingdom".
274200
274300     03  FILLER PIC X(25) ROW 24 COLUMN 25
274400         VALUE "PRESS A PFKEY TO CONTINUE".
274500
274600
274700/*****************************************************************
274800*                                                                *
274900*                         PROCEDURE DIVISION                     *
275000*                                                                *
275100******************************************************************
275200*
275300 PROCEDURE DIVISION.
275400
275500 SUBROUTINE-TESTS.
275600
275700     DISPLAY AND READ SUBROUTINE-SCREEN ON CRT
275800     PFKEYS  1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
275900            11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
276000            21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
276100            31, 32.
276200
276300     IF PF-KEY = "01" THEN
276400        PERFORM DO-READFDR
276500        GO TO SUBROUTINE-TESTS
276600     ELSE IF PF-KEY = "02" THEN
276700        PERFORM DO-FIND THRU DO-FIND-EXIT
276800        GO TO SUBROUTINE-TESTS
276900     ELSE IF PF-KEY = "03" THEN
277000        PERFORM PUT-LINK-DISPLAY
277100        GO TO SUBROUTINE-TESTS
277200     ELSE IF PF-KEY = "04" THEN
277300        PERFORM DAY-TEST
277400        GO TO SUBROUTINE-TESTS
277500     ELSE IF PF-KEY = "05" THEN
277600        PERFORM GETPARM-CALL-TST-PARAM
277700        GO TO SUBROUTINE-TESTS
277800     ELSE IF PF-KEY = "06" THEN
277900        PERFORM SUBMIT-CALL THRU SUBMIT-CALL-EXIT
278000        GO TO SUBROUTINE-TESTS
278100     ELSE IF PF-KEY = "07" THEN
278200        PERFORM DATE-CALL
278300        GO TO SUBROUTINE-TESTS
278400     ELSE IF PF-KEY = "08" THEN
278500        PERFORM LINK-CALL THRU LINK-CALL-EXIT
278600        GO TO SUBROUTINE-TESTS
278700     ELSE IF PF-KEY = "09" THEN
278800        CALL "QAMESSAG"
278900        GO TO SUBROUTINE-TESTS
279000     ELSE IF PF-KEY = "10" THEN
279100        PERFORM WCHAIN-CALL
279200        GO TO SUBROUTINE-TESTS
279300     ELSE IF PF-KEY = "11" THEN
279400        PERFORM EXTRACT-CALL UNTIL PF-KEY = "16"
279500        GO TO SUBROUTINE-TESTS
279600     ELSE IF PF-KEY = "12" THEN
279700        PERFORM PRINT-CALL UNTIL PF-KEY = "16"
279800        GO TO SUBROUTINE-TESTS
279900     ELSE IF PF-KEY = "13" THEN
280000        PERFORM LINKPROC-CALL
280100        GO TO SUBROUTINE-TESTS
280200     ELSE IF PF-KEY = "14" THEN
280300        PERFORM BELL-PAUSE-CALL UNTIL PF-KEY = "16"
280400        GO TO SUBROUTINE-TESTS
280500     ELSE IF PF-KEY = "15" THEN
280600        PERFORM SCRATCH-CALL UNTIL PF-KEY = "16"
280700        GO TO SUBROUTINE-TESTS
280800     ELSE IF PF-KEY = "17" THEN
280900        PERFORM LOGOFF-TEST
281000        GO TO SUBROUTINE-TESTS
281100     ELSE IF PF-KEY = "18" THEN
281200        PERFORM PUTPARM-TEST
281300        GO TO SUBROUTINE-TESTS
281400     ELSE IF PF-KEY = "19" THEN
281500        PERFORM GETPARM-TEST
281600        GO TO SUBROUTINE-TESTS
281700     ELSE IF PF-KEY = "20" THEN
281701        PERFORM SOFTLINK-HARDLINK-TESTS
281702*        OLD getparm tests
281800*       PERFORM GETPARM-2-PARAMETERS-TEST
281900        GO TO SUBROUTINE-TESTS
282000     ELSE IF PF-KEY = "21" THEN
282100        PERFORM DO-BITPACK
282200        GO TO SUBROUTINE-TESTS
282300     ELSE IF PF-KEY = "22" THEN
282400        PERFORM DO-HEXPACK
282500        GO TO SUBROUTINE-TESTS
282600     ELSE IF PF-KEY = "23" THEN
282700        PERFORM DO-SEARCH-TEST
282800        GO TO SUBROUTINE-TESTS
282900     ELSE IF PF-KEY = "24" THEN
283000        PERFORM SORTCALL-TEST THRU SORTCALL-END
283100        GO TO SUBROUTINE-TESTS
283200     ELSE IF PF-KEY = "25" THEN
283300        PERFORM DO-RENAME-TEST
283400        GO TO SUBROUTINE-TESTS
283500     ELSE IF PF-KEY = "26" THEN
283600        PERFORM DO-SET-TEST
283700        GO TO SUBROUTINE-TESTS
283800     ELSE IF PF-KEY = "27" THEN
283900        PERFORM DO-READVTOC THRU DO-READVTOC-EXIT
284000        GO TO SUBROUTINE-TESTS
284100     ELSE IF PF-KEY = "28" THEN
284200        PERFORM DO-FILECOPY-TEST
284300        GO TO SUBROUTINE-TESTS
284400     ELSE IF PF-KEY = "29" THEN
284500        CALL "QAWSXIO"
284600        GO TO SUBROUTINE-TESTS
284700     ELSE IF PF-KEY = "30" THEN
284800        PERFORM DO-STRING
284900        GO TO SUBROUTINE-TESTS
285000     ELSE IF PF-KEY = "31" THEN
285001        PERFORM DO-COBLINK
285100        GO TO SUBROUTINE-TESTS
285200     ELSE IF PF-KEY = "32" THEN
285201        CALL "WL0000"
285300        GO TO SUBROUTINE-TESTS
285400     ELSE IF PF-KEY = "16" THEN
285500        GO TO EXIT-PROGRAM.
285600
285700     GO TO SUBROUTINE-TESTS.
285800
285900******************************************************************
286000 LOGOFF-TEST.
           DISPLAY "Press (ENTER) to all LOGOFF VSSUB.".
286100     CALL "LOGOFF".
286200
286300
286400******************************************************************
286500
286600 DO-READFDR.
286700
286800     MOVE READFDR-RC-B2   TO READFDR-RC-X.
286900     MOVE "SPECIFIY PARAMETERS FOR READFDR" TO READFDR-TITLE.
287000
287100     DISPLAY AND READ READFDR-SCREEN ON CRT
287101         ONLY PFKEYS 1 2 3 4 5 6 8 16.
287200
287300     IF PF-KEY = "08" THEN
287301        perform readfdr-autotest
287302        GO TO DO-READFDR.
287303
287304     IF PF-KEY = "01" THEN
287305        perform call-readfdr-int
287306        GO TO DO-READFDR
287307     ELSE IF PF-KEY = "02" THEN
287308        perform call-readfdr-char
287309        GO TO DO-READFDR
287310     ELSE IF PF-KEY = "03" THEN
287311        perform call-readfdr-num
287312        GO TO DO-READFDR
287304     ELSE IF PF-KEY = "04" THEN
287305        perform call-readfdr4-int
287306        GO TO DO-READFDR
287307     ELSE IF PF-KEY = "05" THEN
287308        perform call-readfdr4-char
287309        GO TO DO-READFDR
287310     ELSE IF PF-KEY = "06" THEN
287311        perform call-readfdr4-num
287312        GO TO DO-READFDR
287313     ELSE IF PF-KEY NOT = "16" THEN
287314        GO TO DO-READFDR.
287315
287316******************************************************************
287317 CALL-READFDR4-INT.
287400        MOVE 0  TO READFDR-INT4-B1
287500        MOVE 0  TO READFDR-INT4-B2
287600        CALL "READFDR4" USING READFDR-FILE
287700                          READFDR-LIB
287800                          READFDR-VOL
287900                          READFDR-MODE,
288000                          READFDR-FUNCTION,
288100                          READFDR-INT4
288200                          READFDR-RC.
288300*       MOVE READFDR-INT4-B2 TO READFDR-INT4-X.
	      MOVE READFDR-INT4-BIG TO INT4-SWAP.
	      CALL "LESWAP" USING INT4-SWAP.
	      MOVE INT4-SWAP TO READFDR-INT4-X.
288301     MOVE READFDR-RC-B2   TO READFDR-RC-X.
288302
287317 CALL-READFDR-INT.
287400        MOVE 0  TO READFDR-INT4-B1
287500        MOVE 0  TO READFDR-INT4-B2
287600        CALL "READFDR" USING READFDR-FILE
287700                          READFDR-LIB
287800                          READFDR-VOL
287900                          READFDR-MODE,
288000                          READFDR-FUNCTION,
288100                          READFDR-INT4
288200                          READFDR-RC.
288300*       MOVE READFDR-INT4-B2 TO READFDR-INT4-X.
	      MOVE READFDR-INT4-BIG TO INT4-SWAP.
	      CALL "LESWAP" USING INT4-SWAP.
	      MOVE INT4-SWAP TO READFDR-INT4-X.
288301     MOVE READFDR-RC-B2   TO READFDR-RC-X.
288302
288303 CALL-READFDR4-CHAR.
288600        MOVE SPACES TO READFDR-CHAR50
288700        CALL "READFDR4" USING READFDR-FILE
288800                          READFDR-LIB
288900                          READFDR-VOL
289000                          READFDR-MODE,
289100                          READFDR-FUNCTION,
289200                          READFDR-CHAR50
289300                          READFDR-RC.
289301     MOVE READFDR-RC-B2   TO READFDR-RC-X.           
288302
288303 CALL-READFDR-CHAR.
288600        MOVE SPACES TO READFDR-CHAR50
288700        CALL "READFDR" USING READFDR-FILE
288800                          READFDR-LIB
288900                          READFDR-VOL
289000                          READFDR-MODE,
289100                          READFDR-FUNCTION,
289200                          READFDR-CHAR50
289300                          READFDR-RC.
289301     MOVE READFDR-RC-B2   TO READFDR-RC-X.
289302
289303 CALL-READFDR4-NUM.
289600        MOVE ZEROES TO READFDR-NUM18
289700        CALL "READFDR4" USING READFDR-FILE
289800                          READFDR-LIB
289900                          READFDR-VOL
290000                          READFDR-MODE,
290100                          READFDR-FUNCTION,
290200                          READFDR-NUM18
290201                          READFDR-RC.
290202     MOVE READFDR-RC-B2   TO READFDR-RC-X.
289302
289303 CALL-READFDR-NUM.
289600        MOVE ZEROES TO READFDR-NUM18
289700        CALL "READFDR" USING READFDR-FILE
289800                          READFDR-LIB
289900                          READFDR-VOL
290000                          READFDR-MODE,
290100                          READFDR-FUNCTION,
290200                          READFDR-NUM18
290201                          READFDR-RC.
290202     MOVE READFDR-RC-B2   TO READFDR-RC-X.
290203

      ************************************
       GET-READFDR4-IX.
           MOVE SPACES TO READFDR-IX.
           MOVE "IX" TO READFDR-FUNCTION.
           CALL "READFDR4" USING READFDR-FILE
                                READFDR-LIB
                                READFDR-VOL
                                READFDR-MODE,
                                READFDR-FUNCTION,
                                READFDR-IX
                                READFDR-RC.
           MOVE READFDR-RC-B2   TO READFDR-RC-X.
           ADD 1 TO READFDR-TESTED.
           IF READFDR-RC-X   NOT = 0
           THEN
               ADD 1 TO READFDR-FAILED
               DISPLAY 
                   "*** FAILED *** READFDR4 TEST IX"
                   " FILE [" READFDR-FILE 
                   "][" READFDR-LIB 
                   "][" READFDR-VOL 
                   "] FUNC=" READFDR-FUNCTION 
                   " RC= " READFDR-RC-X.

      ************************************
       TEST-READFDR4-CHAR1.
           MOVE SPACES TO READFDR-CHAR1
           CALL "READFDR4" USING READFDR-FILE
                                READFDR-LIB
                                READFDR-VOL
                                READFDR-MODE,
                                READFDR-FUNCTION,
                                READFDR-CHAR1
                                READFDR-RC.
           MOVE READFDR-RC-B2   TO READFDR-RC-X.

           ADD 1 TO READFDR-TESTED.
           IF READFDR-RC-X   NOT = READFDR-EXPECT-RC-X OR
              READFDR-CHAR1  NOT = READFDR-EXPECT-CHAR1 
           THEN
               ADD 1 TO READFDR-FAILED
               DISPLAY 
                   "*** FAILED *** READFDR4 TEST " READFDR-TEST-ID
                   " FILE [" READFDR-FILE 
                   "][" READFDR-LIB 
                   "][" READFDR-VOL 
                   "] FUNC=" READFDR-FUNCTION 
                   " RC= " READFDR-RC-X 
                   " Expect [" READFDR-EXPECT-CHAR1
                   "] NOT EQUAL [" READFDR-CHAR1
                   "]".

      ************************************
       TEST-READFDR4-CHAR8.
           MOVE SPACES TO READFDR-CHAR8
           CALL "READFDR4" USING READFDR-FILE
                                READFDR-LIB
                                READFDR-VOL
                                READFDR-MODE,
                                READFDR-FUNCTION,
                                READFDR-CHAR8
                                READFDR-RC.
           MOVE READFDR-RC-B2   TO READFDR-RC-X.

           ADD 1 TO READFDR-TESTED.
           IF READFDR-RC-X   NOT = READFDR-EXPECT-RC-X OR
              READFDR-CHAR8  NOT = READFDR-EXPECT-CHAR8 
           THEN
               ADD 1 TO READFDR-FAILED
               DISPLAY 
                   "*** FAILED *** READFDR4 TEST " READFDR-TEST-ID
                   " FILE [" READFDR-FILE 
                   "][" READFDR-LIB 
                   "][" READFDR-VOL 
                   "] FUNC=" READFDR-FUNCTION 
                   " RC= " READFDR-RC-X 
                   " Expect [" READFDR-EXPECT-CHAR8
                   "] NOT EQUAL [" READFDR-CHAR8
                   "]".

      ************************************
       TEST-READFDR4-INT4.
           MOVE 0  TO READFDR-INT4-B1
           MOVE 0  TO READFDR-INT4-B2
           CALL "READFDR4" USING READFDR-FILE
                                READFDR-LIB
                                READFDR-VOL
                                READFDR-MODE,
                                READFDR-FUNCTION,
                                READFDR-INT4
                                READFDR-RC.
           MOVE READFDR-RC-B2   TO READFDR-RC-X.
           MOVE READFDR-INT4-B2 TO READFDR-INT4-X.

           ADD 1 TO READFDR-TESTED.
           IF READFDR-RC-X   NOT = READFDR-EXPECT-RC-X OR
              READFDR-INT4-X NOT = READFDR-EXPECT-INT4-X 
           THEN
               ADD 1 TO READFDR-FAILED
               DISPLAY 
                   "*** FAILED *** READFDR4 TEST " READFDR-TEST-ID
                   " FILE [" READFDR-FILE 
                   "][" READFDR-LIB 
                   "][" READFDR-VOL 
                   "] FUNC=" READFDR-FUNCTION 
                   " RC= " READFDR-RC-X 
                   " Expect [" READFDR-EXPECT-INT4-X
                   "] NOT EQUAL [" READFDR-INT4-X
                   "]".

      ************************************
       TEST-READFDR4-NUM18.
           MOVE ZEROES TO READFDR-NUM18
           CALL "READFDR4" USING READFDR-FILE
                                READFDR-LIB
                                READFDR-VOL
                                READFDR-MODE,
                                READFDR-FUNCTION,
                                READFDR-NUM18
                                READFDR-RC.
           MOVE READFDR-RC-B2   TO READFDR-RC-X.

           ADD 1 TO READFDR-TESTED.
           IF READFDR-RC-X   NOT = READFDR-EXPECT-RC-X OR
              READFDR-NUM18  NOT = READFDR-EXPECT-NUM18 
           THEN
               ADD 1 TO READFDR-FAILED
               DISPLAY 
                   "*** FAILED *** READFDR4 TEST " READFDR-TEST-ID
                   " FILE [" READFDR-FILE 
                   "][" READFDR-LIB 
                   "][" READFDR-VOL 
                   "] FUNC=" READFDR-FUNCTION 
                   " RC= " READFDR-RC-X 
                   " Expect [" READFDR-EXPECT-NUM18
                   "] NOT EQUAL [" READFDR-NUM18
                   "]".
      
      ************************************             
       READFDR-AUTOTEST.
      ************************************             
      
           MOVE 0 TO READFDR-FAILED.
           MOVE 0 TO READFDR-TESTED.

      ************************************
      *    View Create date

           MOVE "IDXFIX"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.

           MOVE "CD"       TO READFDR-FUNCTION.
           PERFORM CALL-READFDR4-CHAR.
           ADD 1 TO READFDR-TESTED.
           IF READFDR-RC-X NOT = 0 THEN
               ADD 1 TO READFDR-FAILED.
           DISPLAY "T1 READFDR4 "
               READFDR-FILE " " READFDR-LIB " " READFDR-VOL " "
               READFDR-FUNCTION " RC= " READFDR-RC-X " "
               READFDR-CHAR50 "** CHECK DATE **".

               
      ************************************             
      *    Canned responses
      *
      *    "DP"    Int4    0
      *    "DT"    Char1   D
      *    "EA"    Int4    1

           MOVE "IDXFIX"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
           
           MOVE 11     TO READFDR-TEST-ID.
           MOVE "DP"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 0      TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 12     TO READFDR-TEST-ID.
           MOVE "DT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "D"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
           
           MOVE 13     TO READFDR-TEST-ID.
           MOVE "EA"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 1      TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.


      *    These files are created in LIBSAM and in EMPTY on VOLOUT
      *    The values listed are "actual", READFDR may not be able to
      *    determine these for all types.
      *    The RC listed is for LIBSAM, the RC for the files in 
      *    EMPTY are all 0.
      *
      *                                      FT  RT  RS  RC                  
      *    IDXFIX  Indexed Fixed              I   F  45  1334
      *    IDXFIXC Indexed Fixed Compressed   I   C  45  1334
      *    IDXVAR  Indexed Varying            I   V  80  1334
      *    ALTFIX  Alternate-index Fixed      A   F  55  1334
      *    ALTVAR  Alternate-index Varying    A   V  90  1334
      *    SEQFIX  Sequential Fixed           C   F  45  2000
      *    RELFIX  Relative Fixed             R   F  45  1334
      *    SEQVAR  Sequential Varying         C   V  80  2000
      *    RELVAR  Relative Varying           R   V  80  1334
      *
      *    Acucobol
      *    ALTVARV2 VISION 2                  A   V  90  1334
      *    ALTVARV3 VISION 3                  A   V  90  1334
      *
      *    Micro Focus
      *    ALTVAR4 IDXFORMAT"4"               A   V  90  1334
      *    ALTVAR8 IDXFORMAT"8"               A   V  90  1334  (May not be present)


      ************************************             
           MOVE "IDXFIX" TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 101    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "I"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 102    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "F"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.

           MOVE 103    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 45     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 104    TO READFDR-TEST-ID
           MOVE "RC"   TO READFDR-FUNCTION
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 1334   TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

           MOVE 105    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
      *$ACU_CODE PROCESS
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *$ACU_END
      *$MF_CODE PROCESS
      *    MOVE "C"    TO READFDR-EXPECT-CHAR1.
      *$MF_END
           PERFORM TEST-READFDR4-CHAR1.

      *$MF_CODE PROCESS
      *    MOVE 106    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "C0"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *$MF_END

      ************************************             
           MOVE "IDXFIX" TO READFDR-FILE.
           MOVE "EMPTY"  TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 1101    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "I"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1102    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "F"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.

           MOVE 1103    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 45     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 1104    TO READFDR-TEST-ID
           MOVE "RC"   TO READFDR-FUNCTION
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

      *$ACU_CODE PROCESS
      *    MOVE 1105    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *$ACU_END

      ************************************             
           MOVE "IDXFIXC" TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 3101    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "I"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 3102    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "C"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.

           MOVE 3103    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 45     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 3104    TO READFDR-TEST-ID
           MOVE "RC"   TO READFDR-FUNCTION
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 1334   TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

           MOVE 3105    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
      *$ACU_CODE PROCESS
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *$ACU_END
      *$MF_CODE PROCESS
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *$MF_END
           PERFORM TEST-READFDR4-CHAR1.

      ************************************             
           MOVE "IDXFIXC" TO READFDR-FILE.
           MOVE "EMPTY"  TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 3201    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "I"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 3202    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "C"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.

           MOVE 3203    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 45     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 3204    TO READFDR-TEST-ID
           MOVE "RC"   TO READFDR-FUNCTION
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

           MOVE 3205    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
      *$ACU_CODE PROCESS
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *$ACU_END
      *$MF_CODE PROCESS
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *$MF_END
           PERFORM TEST-READFDR4-CHAR1.
      
      ************************************             
           MOVE "IDXVAR"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 201    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "I"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 202    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "V"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 203    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 80     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 204    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 1334   TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

           MOVE 205    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
      *$ACU_CODE PROCESS
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *$ACU_END
      *$MF_CODE PROCESS
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *$MF_END
           PERFORM TEST-READFDR4-CHAR1.

      *$MF_CODE PROCESS
      *    MOVE 206    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "I3"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *$MF_END
      
      ************************************             
           MOVE "IDXVAR"  TO READFDR-FILE.
           MOVE "EMPTY"  TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 1201    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "I"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1202    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "V"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1203    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 80     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 1204    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

           MOVE 1205    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
      *$ACU_CODE PROCESS
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *$ACU_END
      *$MF_CODE PROCESS
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *$MF_END
           PERFORM TEST-READFDR4-CHAR1.

      ************************************             
           MOVE "ALTFIX"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 301    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "A"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 302    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "F"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 303    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 55     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 304    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 1334   TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

      *$ACU_CODE PROCESS
      *    MOVE 305    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *$ACU_END

      ************************************             
           MOVE "ALTFIX"  TO READFDR-FILE.
           MOVE "EMPTY" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 1301    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "A"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1302    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "F"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1303    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 55     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 1304    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

      *$ACU_CODE PROCESS
      *    MOVE 1305    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *$ACU_END
      
      ************************************             
           MOVE "ALTVAR"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 401    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "A"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 402    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "V"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 403    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 90     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 404    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 1334   TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

           MOVE 405    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
      *$ACU_CODE PROCESS
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *$ACU_END
      *$MF_CODE PROCESS
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *$MF_END
           PERFORM TEST-READFDR4-CHAR1.
      
      ************************************             
           MOVE "ALTVAR"  TO READFDR-FILE.
           MOVE "EMPTY" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 1401    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "A"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1402    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "V"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1403    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 90     TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 1404    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-HAS-RC THEN
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

           MOVE 1405    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
      *$ACU_CODE PROCESS
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *$ACU_END
      *$MF_CODE PROCESS
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *$MF_END
           PERFORM TEST-READFDR4-CHAR1.
      
      ************************************             
           MOVE "SEQFIX"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 501    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 502    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 503    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE 0      TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.
      
           MOVE 504    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE 0      TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 505    TO READFDR-TEST-ID.
           MOVE "BS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 90000  TO READFDR-EXPECT-NUM18.
           PERFORM TEST-READFDR4-NUM18.
      
           MOVE 506    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "U"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 507    TO READFDR-TEST-ID.
           MOVE "IV"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "U0"   TO READFDR-EXPECT-CHAR8.
           PERFORM TEST-READFDR4-CHAR8.

      ************************************             
           MOVE "SEQFIX"  TO READFDR-FILE.
           MOVE "EMPTY" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.
           MOVE 1501    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1502    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1503    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE 0      TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.
      
           MOVE 1504    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE 0      TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.

           MOVE 1505    TO READFDR-TEST-ID.
           MOVE "BS"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE 0      TO READFDR-EXPECT-NUM18.
           PERFORM TEST-READFDR4-NUM18.
      
           MOVE 1506    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "U"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
      ************************************             
           MOVE "RELFIX"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 601    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 602    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 603    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE 0      TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.
      
           MOVE 604    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           MOVE 24     TO READFDR-EXPECT-RC-X.
           MOVE 0      TO READFDR-EXPECT-INT4-X.
           PERFORM TEST-READFDR4-INT4.
      
           MOVE 605    TO READFDR-TEST-ID.
           MOVE "IX"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "U"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 606    TO READFDR-TEST-ID.
           MOVE "IV"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "U0"   TO READFDR-EXPECT-CHAR8.
           PERFORM TEST-READFDR4-CHAR8.
      
      ************************************             
           MOVE "SEQVAR"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 701    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE " "    TO READFDR-EXPECT-CHAR1
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE "C"    TO READFDR-EXPECT-CHAR1
           END-IF.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 702    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE " "    TO READFDR-EXPECT-CHAR1
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE "V"    TO READFDR-EXPECT-CHAR1
           END-IF.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 703    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 80     TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.
      
           MOVE 704    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

      *$MF_CODE PROCESS
      *    MOVE 705    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *$MF_END

      *$MF_CODE PROCESS
      *    MOVE 708    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "S0"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *$MF_END
      
      ************************************             
           MOVE "SEQVAR"  TO READFDR-FILE.
           MOVE "EMPTY"  TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 1701    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE " "    TO READFDR-EXPECT-CHAR1
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE "C"    TO READFDR-EXPECT-CHAR1
           END-IF.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1702    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE " "    TO READFDR-EXPECT-CHAR1
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE "V"    TO READFDR-EXPECT-CHAR1
           END-IF.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1703    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 80     TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.
      
           MOVE 1704    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

      *$MF_CODE PROCESS
      *    MOVE 1705    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *$MF_END
      
      ************************************             
           MOVE "RELVAR"  TO READFDR-FILE.
           MOVE "LIBSAM" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 801    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE " "    TO READFDR-EXPECT-CHAR1
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE "R"    TO READFDR-EXPECT-CHAR1
           END-IF.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 802    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE " "    TO READFDR-EXPECT-CHAR1
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE "V"    TO READFDR-EXPECT-CHAR1
           END-IF.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 803    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 80     TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.
      
           MOVE 804    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

      *$MF_CODE PROCESS
      *    MOVE 805    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *$MF_END

      *$MF_CODE PROCESS
      *    MOVE 806    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "R0"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *$MF_END
      
      ************************************             
           MOVE "RELVAR"  TO READFDR-FILE.
           MOVE "EMPTY" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.
      
           PERFORM GET-READFDR4-IX.

           MOVE 1801    TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE " "    TO READFDR-EXPECT-CHAR1
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE "R"    TO READFDR-EXPECT-CHAR1
           END-IF.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1802    TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE " "    TO READFDR-EXPECT-CHAR1
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE "V"    TO READFDR-EXPECT-CHAR1
           END-IF.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 1803    TO READFDR-TEST-ID.
           MOVE "RS"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 0      TO READFDR-EXPECT-RC-X
               MOVE 80     TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.
      
           MOVE 1804    TO READFDR-TEST-ID.
           MOVE "RC"   TO READFDR-FUNCTION.
           IF READFDR-IX-UNKNOWN THEN
               MOVE 24     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           ELSE
               MOVE 40     TO READFDR-EXPECT-RC-X
               MOVE 0      TO READFDR-EXPECT-INT4-X
           END-IF.
           PERFORM TEST-READFDR4-INT4.

      *$MF_CODE PROCESS
      *    MOVE 1805    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *$MF_END

      *$MF_CODE PROCESS
      *    MOVE 1806    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "R0"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *$MF_END

      
      * Comment out the VISION 2 tests
      ************************************          
      *	   VISION 2 file 
      *** ACU_CODE PROCESS
      *    MOVE "ALTVARV2"  TO READFDR-FILE.
      *    MOVE "LIBSAM" TO READFDR-LIB.
      *    MOVE "VOLOUT" TO READFDR-VOL.
      *
      *    PERFORM GET-READFDR4-IX.
      *
      *    MOVE 2201    TO READFDR-TEST-ID.
      *    MOVE "FT"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "A"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2202    TO READFDR-TEST-ID.
      *    MOVE "RT"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2203    TO READFDR-TEST-ID.
      *    MOVE "RS"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE 90     TO READFDR-EXPECT-INT4-X.
      *    PERFORM TEST-READFDR4-INT4.
      *
      *    MOVE 2204    TO READFDR-TEST-ID.
      *    MOVE "RC"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X
      *    MOVE 1334   TO READFDR-EXPECT-INT4-X
      *    PERFORM TEST-READFDR4-INT4.
      *
      *    MOVE 2205    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2206    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V2"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *** ACU_END
      

      ************************************          
      *	   VISION 3 file
      *$ACU_CODE PROCESS
      *    MOVE "ALTVARV3"  TO READFDR-FILE.
      *    MOVE "LIBSAM" TO READFDR-LIB.
      *    MOVE "VOLOUT" TO READFDR-VOL.
      *
      *    MOVE 2301    TO READFDR-TEST-ID.
      *    MOVE "FT"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "A"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2302    TO READFDR-TEST-ID.
      *    MOVE "RT"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2303    TO READFDR-TEST-ID.
      *    MOVE "RS"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE 90     TO READFDR-EXPECT-INT4-X.
      *    PERFORM TEST-READFDR4-INT4.
      *
      *    MOVE 2304    TO READFDR-TEST-ID.
      *    MOVE "RC"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X
      *    MOVE 1334   TO READFDR-EXPECT-INT4-X
      *    PERFORM TEST-READFDR4-INT4.
      *
      *    MOVE 2305    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2306    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V3"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *$ACU_END

      ************************************          
      *	   VISION 4 file
      *$ACU_CODE PROCESS
      *    MOVE "ALTVARV4"  TO READFDR-FILE.
      *    MOVE "LIBSAM" TO READFDR-LIB.
      *    MOVE "VOLOUT" TO READFDR-VOL.
      *
      *    MOVE 2401    TO READFDR-TEST-ID.
      *    MOVE "FT"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "A"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2402    TO READFDR-TEST-ID.
      *    MOVE "RT"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2403    TO READFDR-TEST-ID.
      *    MOVE "RS"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE 90     TO READFDR-EXPECT-INT4-X.
      *    PERFORM TEST-READFDR4-INT4.
      *
      *    MOVE 2404    TO READFDR-TEST-ID.
      *    MOVE "RC"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X
      *    MOVE 1334   TO READFDR-EXPECT-INT4-X
      *    PERFORM TEST-READFDR4-INT4.
      *
      *    MOVE 2405    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2406    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V4"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *$ACU_END

      ************************************          
      *	   IDX 4 file
      *$MF_CODE PROCESS
      *    MOVE "ALTVAR4"  TO READFDR-FILE.
      *    MOVE "LIBSAM" TO READFDR-LIB.
      *    MOVE "VOLOUT" TO READFDR-VOL.
      *
      *    MOVE 2401    TO READFDR-TEST-ID.
      *    MOVE "FT"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "A"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2402    TO READFDR-TEST-ID.
      *    MOVE "RT"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2403    TO READFDR-TEST-ID.
      *    MOVE "RS"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE 90     TO READFDR-EXPECT-INT4-X.
      *    PERFORM TEST-READFDR4-INT4.
      *
      *    MOVE 2404    TO READFDR-TEST-ID.
      *    MOVE "RC"   TO READFDR-FUNCTION.
      *    MOVE 40     TO READFDR-EXPECT-RC-X
      *    MOVE 0      TO READFDR-EXPECT-INT4-X
      *    PERFORM TEST-READFDR4-INT4.
      *
      *    MOVE 2405    TO READFDR-TEST-ID.
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1.
      *    PERFORM TEST-READFDR4-CHAR1.
      *
      *    MOVE 2406    TO READFDR-TEST-ID.
      *    MOVE "IV"   TO READFDR-FUNCTION.
      *    MOVE 0      TO READFDR-EXPECT-RC-X.
      *    MOVE "I4"    TO READFDR-EXPECT-CHAR8.
      *    PERFORM TEST-READFDR4-CHAR8.
      *$MF_END

      ************************************          
      *	   IDX 8 file
      *$MF_CODE PROCESS
      *    MOVE "ALTVAR8"  TO READFDR-FILE.
      *    MOVE "LIBSAM" TO READFDR-LIB.
      *    MOVE "VOLOUT" TO READFDR-VOL.
      *
      **   Check if it exists
      *    MOVE "IX"   TO READFDR-FUNCTION.
      *	   PERFORM CALL-READFDR4-CHAR.
      *    IF READFDR-RC-X = 0 THEN
      *
      *    MOVE 2801    TO READFDR-TEST-ID
      *    MOVE "FT"   TO READFDR-FUNCTION
      *    MOVE 0      TO READFDR-EXPECT-RC-X
      *    MOVE "A"    TO READFDR-EXPECT-CHAR1
      *    PERFORM TEST-READFDR4-CHAR1
      *
      *    MOVE 2802    TO READFDR-TEST-ID
      *    MOVE "RT"   TO READFDR-FUNCTION
      *    MOVE 0      TO READFDR-EXPECT-RC-X
      *    MOVE "V"    TO READFDR-EXPECT-CHAR1
      *    PERFORM TEST-READFDR4-CHAR1
      *
      *    MOVE 2803    TO READFDR-TEST-ID
      *    MOVE "RS"   TO READFDR-FUNCTION
      *    MOVE 0      TO READFDR-EXPECT-RC-X
      *    MOVE 90     TO READFDR-EXPECT-INT4-X
      *    PERFORM TEST-READFDR4-INT4
      *
      *    MOVE 2804    TO READFDR-TEST-ID
      *    MOVE "RC"   TO READFDR-FUNCTION
      *    MOVE 40     TO READFDR-EXPECT-RC-X
      *    MOVE 0      TO READFDR-EXPECT-INT4-X
      *    PERFORM TEST-READFDR4-INT4
      *
      *    MOVE 2805    TO READFDR-TEST-ID
      *    MOVE "IX"   TO READFDR-FUNCTION
      *    MOVE 0      TO READFDR-EXPECT-RC-X
      *    MOVE "M"    TO READFDR-EXPECT-CHAR1
      *    PERFORM TEST-READFDR4-CHAR1
      *
      *    MOVE 2806    TO READFDR-TEST-ID 
      *    MOVE "IV"   TO READFDR-FUNCTION
      *    MOVE 0      TO READFDR-EXPECT-RC-X
      *    MOVE "I8"    TO READFDR-EXPECT-CHAR8
      *    PERFORM TEST-READFDR4-CHAR8
      *
      *    ELSE
      *        DISPLAY READFDR-FILE " NOT FOUND"
      *    END-IF.
      *$MF_END

      
      
      ************************************             
      *    Compressed file
      
           MOVE "AFILE"  TO READFDR-FILE.
           MOVE "LIBOUT" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.

           MOVE 9001   TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "I"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 9002   TO READFDR-TEST-ID.
           MOVE "RT"   TO READFDR-FUNCTION.
           MOVE 0      TO READFDR-EXPECT-RC-X.
           MOVE "C"    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 9003   TO READFDR-TEST-ID.
           MOVE "XX"   TO READFDR-FUNCTION.
           MOVE 40     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
      ************************************             
      *    File does not exist
      
           MOVE "NOFILE" TO READFDR-FILE.
           MOVE "LIBOUT" TO READFDR-LIB.
           MOVE "VOLOUT" TO READFDR-VOL.

           MOVE 9011   TO READFDR-TEST-ID.
           MOVE "FT"   TO READFDR-FUNCTION.
           MOVE 20     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
           MOVE 9012   TO READFDR-TEST-ID.
           MOVE "XX"   TO READFDR-FUNCTION.
           MOVE 20     TO READFDR-EXPECT-RC-X.
           MOVE " "    TO READFDR-EXPECT-CHAR1.
           PERFORM TEST-READFDR4-CHAR1.
      
      ************************************             
      
      
           IF READFDR-FAILED = 0 THEN
               DISPLAY "READFDR *** PASSED *** ALL " 
                   READFDR-TESTED " TESTS"
           ELSE
               DISPLAY "READFDR *** FAILED *** "
                   READFDR-FAILED " of " 
                   READFDR-TESTED " TESTS".
      
290422******************************************************************
290423
291000 DO-FIND.
291100
291200     MOVE LOWER-FAC TO FAC OF FIND-EXT.
291300
291400     MOVE "SPECIFIY PARAMETERS FOR FIND" TO FIND-TITLE.
291500
291600     MOVE 1      TO FIND-STARTER-X.
291700     MOVE 10     TO FIND-COUNTER-X.
291800     MOVE ZERO   TO FIND-FILE-COUNT-X.
291900     MOVE SPACES TO FIND-RECEIVER.
292000
292100 DO-FIND-LOOP.
292200
292300     DISPLAY AND READ FIND-SCREEN ON CRT PFKEYS 8 16.
292400
292500     IF PF-KEY = "16" THEN
292600        GO TO DO-FIND-EXIT.
292601
292602     IF PF-KEY = "08" THEN
292603        PERFORM DO-FIND-AUTOTESTS
292604        GO TO DO-FIND-LOOP.
292605
292606     PERFORM DO-CALL-FIND.
292607
292608     CALL "WSETFILEXT" USING MY-EXT.
292609     GO TO DO-FIND-LOOP.
292610
292611 DO-FIND-EXIT.
292612     EXIT.
292613
292614******************************************************************
292615
292616 DO-CALL-FIND.
292800     MOVE ZERO TO FIND-STARTER-1.
292900     MOVE ZERO TO FIND-COUNTER-1.
293000     MOVE ZERO TO FIND-FILE-COUNT-1.
293100
293200     MOVE SPACES         TO FIND-RECEIVER.
293300     MOVE FIND-STARTER-X TO FIND-STARTER-2.
293400     MOVE FIND-COUNTER-X TO FIND-COUNTER-2.
293500     MOVE ZERO           TO FIND-FILE-COUNT-2.
293501
293900     CALL "FIND" USING    FIND-FILE,
294000                          FIND-LIB,
294100                          FIND-VOL,
294200                          FIND-STARTER,
294300                          FIND-COUNTER,
294400                          FIND-RECEIVER,
294500                          FIND-FILE-COUNT,
294600                          FIND-RECV-TYPE.
294601
294800     MOVE FIND-COUNTER-2    TO FIND-COUNTER-X.
294900     MOVE FIND-FILE-COUNT-2 TO FIND-FILE-COUNT-X.
294901
294902 DO-FIND-AUTOTESTS.
294903     MOVE 0 TO FIND-FAILED.
294904
294905     MOVE "?"        TO FIND-FILE.
294906     MOVE "LIBOUT"   TO FIND-LIB.
294907     MOVE "VOLOUT"   TO FIND-VOL.
294908     MOVE  1 TO FIND-STARTER-X.
294909     MOVE 10 TO FIND-COUNTER-X.
294910     PERFORM DO-CALL-FIND.
294911     IF FIND-FILE-COUNT-2 NOT = 7 THEN
294912         ADD 1 TO FIND-FAILED
294913         DISPLAY "FIND *** FAILED ***"
294914             " FILE=" FIND-FILE
294915             " LIB=" FIND-LIB
294916             " VOL=" FIND-VOL
294917             " FCOUNT=" FIND-FILE-COUNT-X
294918             " EXPECT 7".
294919
294920     MOVE "A?"       TO FIND-FILE.
294921     MOVE "LIBO?"    TO FIND-LIB.
294922     MOVE "VOLOUT"   TO FIND-VOL.
294923     MOVE  1 TO FIND-STARTER-X.
294924     MOVE 10 TO FIND-COUNTER-X.
294925     PERFORM DO-CALL-FIND.
294926     IF FIND-FILE-COUNT-X NOT = 2 THEN
294927         ADD 1 TO FIND-FAILED
294928         DISPLAY "FIND *** FAILED ***"
294929             " FILE=" FIND-FILE
294930             " LIB=" FIND-LIB
294931             " VOL=" FIND-VOL
294932             " FCOUNT=" FIND-FILE-COUNT-X
294933             " EXPECT 2".
294934
294935     MOVE " "        TO FIND-FILE.
294936     MOVE "LIB?"     TO FIND-LIB.
294937     MOVE "VOLRUN"   TO FIND-VOL.
294938     MOVE  1 TO FIND-STARTER-X.
294939     MOVE 10 TO FIND-COUNTER-X.
294940     PERFORM DO-CALL-FIND.
294941     IF FIND-FILE-COUNT-X NOT = 2 THEN
294942         ADD 1 TO FIND-FAILED
294943         DISPLAY "FIND *** FAILED ***"
294944             " FILE=" FIND-FILE
294945             " LIB=" FIND-LIB
294946             " VOL=" FIND-VOL
294947             " FCOUNT=" FIND-FILE-COUNT-X
294948             " EXPECT 2".
294949
294950     MOVE "?"        TO FIND-FILE.
294951     MOVE "?"        TO FIND-LIB.
294952     MOVE "VOLSPL"   TO FIND-VOL.
294953     MOVE  1 TO FIND-STARTER-X.
294954     MOVE 10 TO FIND-COUNTER-X.
294955     PERFORM DO-CALL-FIND.
294956     IF FIND-FILE-COUNT-X < 4 THEN
294957         ADD 1 TO FIND-FAILED
294958         DISPLAY "FIND *** FAILED ***"
294959             " FILE=" FIND-FILE
294960             " LIB=" FIND-LIB
294961             " VOL=" FIND-VOL
294962             " FCOUNT=" FIND-FILE-COUNT-X
294963             " EXPECT >= 4".
294964
294965     MOVE "?"        TO FIND-FILE.
294966     MOVE "?"        TO FIND-LIB.
294967     MOVE "VOLSPL"   TO FIND-VOL.
294968     MOVE  1 TO FIND-STARTER-X.
294969     MOVE  0 TO FIND-COUNTER-X.
294970     PERFORM DO-CALL-FIND.
294971     IF FIND-COUNTER-X NOT = 0 THEN
294972         ADD 1 TO FIND-FAILED
294973         DISPLAY "FIND *** FAILED ***"
294974             " FILE=" FIND-FILE
294975             " LIB=" FIND-LIB
294976             " VOL=" FIND-VOL
294977             " COUNT=" FIND-COUNTER-X
294978             " EXPECT = 0".
294979
294980     MOVE " "        TO FIND-FILE.
294981     MOVE " "        TO FIND-LIB.
294982     MOVE "VOLWRK"   TO FIND-VOL.
294983     MOVE  2 TO FIND-STARTER-X.
294984     MOVE 10 TO FIND-COUNTER-X.
294985     PERFORM DO-CALL-FIND.
294986     IF FIND-FILE-COUNT-X NOT = 1 THEN
294987         ADD 1 TO FIND-FAILED
294988         DISPLAY "FIND *** FAILED ***"
294989             " FILE=" FIND-FILE
294990             " LIB=" FIND-LIB
294991             " VOL=" FIND-VOL
294992             " FCOUNT=" FIND-FILE-COUNT-X
294993             " EXPECT 1".
294994     IF FIND-COUNTER-X NOT = 0 THEN
294995         ADD 1 TO FIND-FAILED
294996         DISPLAY "FIND *** FAILED ***"
294997             " FILE=" FIND-FILE
294998             " LIB=" FIND-LIB
294999             " VOL=" FIND-VOL
295000             " COUNT=" FIND-COUNTER-X
295001             " EXPECT = 0".
295002
295003     MOVE "*FILE"    TO FIND-FILE.
295004     MOVE "LIB?"     TO FIND-LIB.
295005     MOVE "VOLOUT"   TO FIND-VOL.
295006     MOVE  1 TO FIND-STARTER-X.
295007     MOVE 10 TO FIND-COUNTER-X.
295008     PERFORM DO-CALL-FIND.
295009     IF FIND-FILE-COUNT-X NOT = 2 THEN
295010         ADD 1 TO FIND-FAILED
295011         DISPLAY "FIND *** FAILED ***"
295012             " FILE=" FIND-FILE
295013             " LIB=" FIND-LIB
295014             " VOL=" FIND-VOL
295015             " FCOUNT=" FIND-FILE-COUNT-X
295016             " EXPECT = 2".
295017
295018     MOVE " "        TO FIND-FILE.
295019     MOVE "LIB***"   TO FIND-LIB.
295020     MOVE "VOLRUN"   TO FIND-VOL.
295021     MOVE  1 TO FIND-STARTER-X.
295022     MOVE 10 TO FIND-COUNTER-X.
295023     PERFORM DO-CALL-FIND.
295024     IF FIND-FILE-COUNT-X NOT = 2 THEN
295025         ADD 1 TO FIND-FAILED
295026         DISPLAY "FIND *** FAILED ***"
295027             " FILE=" FIND-FILE
295028             " LIB=" FIND-LIB
295029             " VOL=" FIND-VOL
295030             " FCOUNT=" FIND-FILE-COUNT-X
295031             " EXPECT = 2".
295032
295033     MOVE "*FILE"    TO FIND-FILE.
295034     MOVE "LIB?"     TO FIND-LIB.
295035     MOVE "?"        TO FIND-VOL.
295036     MOVE  1 TO FIND-STARTER-X.
295037     MOVE 10 TO FIND-COUNTER-X.
295038     PERFORM DO-CALL-FIND.
295039     IF FIND-FILE-COUNT-X NOT = 2 THEN
295040         ADD 1 TO FIND-FAILED
295041         DISPLAY "FIND *** FAILED ***"
295042             " FILE=" FIND-FILE
295043             " LIB=" FIND-LIB
295044             " VOL=" FIND-VOL
295045             " FCOUNT=" FIND-FILE-COUNT-X
295046             " EXPECT = 2".
295047
295048     MOVE " "        TO FIND-FILE.
295049     MOVE " "        TO FIND-LIB.
295050     MOVE "VOL***"   TO FIND-VOL.
295051     MOVE  1 TO FIND-STARTER-X.
295052     MOVE 10 TO FIND-COUNTER-X.
295053     PERFORM DO-CALL-FIND.
295054     IF FIND-FILE-COUNT-X NOT = 4 THEN
295055         ADD 1 TO FIND-FAILED
295056         DISPLAY "FIND *** FAILED ***"
295057             " FILE=" FIND-FILE
295058             " LIB=" FIND-LIB
295059             " VOL=" FIND-VOL
295060             " FCOUNT=" FIND-FILE-COUNT-X
295061             " EXPECT = 4".
295062
295063     MOVE " "        TO FIND-FILE.
295064     MOVE " "        TO FIND-LIB.
295065     MOVE "?"        TO FIND-VOL.
295066     MOVE  1 TO FIND-STARTER-X.
295067     MOVE 10 TO FIND-COUNTER-X.
295068     PERFORM DO-CALL-FIND.
295069     IF FIND-FILE-COUNT-X NOT = 7 THEN
295070         ADD 1 TO FIND-FAILED
295071         DISPLAY "FIND *** FAILED ***"
295072             " FILE=" FIND-FILE
295073             " LIB=" FIND-LIB
295074             " VOL=" FIND-VOL
295075             " FCOUNT=" FIND-FILE-COUNT-X
295076             " EXPECT = 7".
295077
295078     MOVE "?"        TO FIND-FILE.
295079     MOVE "?"        TO FIND-LIB.
295080     MOVE "VOL?"     TO FIND-VOL.
295081     MOVE  1 TO FIND-STARTER-X.
295082     MOVE 10 TO FIND-COUNTER-X.
295083     PERFORM DO-CALL-FIND.
295084     IF FIND-FILE-COUNT-X < 15 THEN
295085         ADD 1 TO FIND-FAILED
295086         DISPLAY "FIND *** FAILED ***"
295087             " FILE=" FIND-FILE
295088             " LIB=" FIND-LIB
295089             " VOL=" FIND-VOL
295090             " FCOUNT=" FIND-FILE-COUNT-X
295091             " EXPECT >= 15".
295092
295093* END AUTO TEST
295094     IF FIND-FAILED = 0 THEN
295095         DISPLAY "FIND *** PASSED *** THE AUTOTESTS"
295096     ELSE
295097         DISPLAY "FIND *** FAILED *** "
295098             FIND-FAILED " TESTS".
295099
295100
295101******************************************************************
295102
295800 DO-READVTOC.
295900
296000     MOVE "SPECIFIY PARAMETERS FOR READVTOC" TO FIND-TITLE.
296100
296200     MOVE "F"    TO READVTOC-OPTION.
296300     MOVE 1      TO FIND-STARTER-X.
296400     MOVE 10     TO FIND-COUNTER-X.
296500     MOVE ZERO   TO FIND-FILE-COUNT-X.
296600     MOVE SPACES TO READVTOC-RECEIVER.
296601     MOVE "LIBOUT" TO FIND-LIB.
296602     MOVE "VOLOUT" TO FIND-VOL.
296700
296800 DO-READVTOC-LOOP.
296900
297000     DISPLAY AND READ READVTOC-SCREEN ON CRT PFKEYS 16.
297100
297200     IF PF-KEY = "16" THEN
297300        GO TO DO-READVTOC-EXIT.
297400
297500     MOVE ZERO TO FIND-STARTER-1.
297600     MOVE ZERO TO FIND-COUNTER-1.
297700     MOVE ZERO TO FIND-FILE-COUNT-1.
297800
297900     MOVE SPACES         TO READVTOC-RECEIVER.
298000     MOVE FIND-STARTER-X TO FIND-STARTER-2.
298100     MOVE FIND-COUNTER-X TO FIND-COUNTER-2.
298200     MOVE ZERO           TO FIND-FILE-COUNT-2.
298300     MOVE ZERO           TO READVTOC-RC-2.
298400
298500     CALL "READVTOC" USING READVTOC-OPTION,
298600                           FIND-LIB,
298700                           FIND-VOL,
298800                           FIND-STARTER,
298900                           FIND-COUNTER,
299000                           READVTOC-RECEIVER,
299100                           READVTOC-RC,
299200                           FIND-FILE-COUNT.
299300
299400     MOVE FIND-COUNTER-2    TO FIND-COUNTER-X.
299500     MOVE FIND-FILE-COUNT-2 TO FIND-FILE-COUNT-X.
299600     MOVE READVTOC-RC-2     TO READVTOC-RC-X.
299700
299800     GO TO DO-READVTOC-LOOP.
299900
300000 DO-READVTOC-EXIT.
300100     EXIT.
300200
300300******************************************************************
300400
300500 PUT-LINK-DISPLAY.
300600
300700     DISPLAY AND READ PP-SCREEN ON CRT.
300800
300900     CALL "PUTPARM" USING PP-FUNCTION, PP-PRNAME, PP-KWCOUNT,
301000                          PP-FILE-KW, PP-FILE, PP-LEN-8,
301100                          PP-LIB-KW, PP-LIB, PP-LEN-8,
301200                          PP-VOL-KW, PP-VOL, PP-LEN-6,
301300                          PP-RCODE.
301400
301500     CALL "LINK" USING DISPLAY-PROG, PP-LINK-TYPE, LINK-COMP-CODE,
301600                       LINK-RETURN.
301700
301800******************************************************************
301900
302000 PUTPARM-TEST.
302100
302200     DISPLAY AND READ PUTP-SCREEN ON CRT PFKEYS 1, 16.
302300
302400     MOVE SPACES TO PUTP-STATUS-TEXT.
302500     MOVE PUTP-USAGE-CNT TO PUTP-UC2.
302600
302700     IF PF-KEY = "01" THEN
302800          CALL "COBLINK" USING PP-DISPLAY
302900          GO TO PUTPARM-TEST.
303000
303100     IF PF-KEY NOT = "16" THEN
303200       IF PUTP-FUNCTION = "D" OR PUTP-FUNCTION = "E" THEN
303300         IF PUTP-KW2 = 0 THEN
303400           CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-USAGECNT,
303500                          PUTP-PRNAME, PUTP-KWCOUNT,
303600                          PUTP-PFKEY-VALUE, PUTP-LABEL,
303700                          PUTP-REFLABEL, PUTP-CLEANUP,
303800                          PUTP-RCODE
303900           MOVE "FUNCTION CALL COMPLETE" TO PUTP-STATUS-TEXT
304000         ELSE
304100           CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-USAGECNT,
304200                          PUTP-PRNAME, PUTP-KWCOUNT,
304300                          PUTP-FILE-KW, PUTP-FILE, PUTP-LEN-8,
304400                          PUTP-LIB-KW, PUTP-LIB, PUTP-LEN-8,
304500                          PUTP-VOL-KW, PUTP-VOL, PUTP-LEN-6,
304600                          PUTP-PFKEY-VALUE, PUTP-LABEL,
304700                          PUTP-REFLABEL, PUTP-CLEANUP,
304800                          PUTP-RCODE
304900           MOVE "FUNCTION CALL COMPLETE" TO PUTP-STATUS-TEXT
305000       ELSE IF PUTP-FUNCTION = "R" THEN
305100           CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-LABEL,
305200                          PUTP-RECEIVER, PUTP-RECVR-LEN,
305300                          PUTP-TOTAL-LEN,
305400                          PUTP-PFKEY-VALUE, PUTP-CLEANUP,
305500                          PUTP-RCODE
305600           MOVE "FUNCTION CALL COMPLETE" TO PUTP-STATUS-TEXT
305700       ELSE IF PUTP-FUNCTION = "M" THEN
305800           CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-LABEL,
305900                          PUTP-KWCOUNT,
306000                          PUTP-FILE-KW, PUTP-RECVR-FILE,
306100                          PUTP-RECVR-LENF,
306200                          PUTP-LIB-KW, PUTP-RECVR-LIB,
306300                          PUTP-RECVR-LENL,
306400                          PUTP-VOL-KW, PUTP-RECVR-VOL,
306500                          PUTP-RECVR-LENV,
306600                          PUTP-PFKEY-VALUE, PUTP-CLEANUP,
306700                          PUTP-RCODE
306800           MOVE "FUNCTION CALL COMPLETE" TO PUTP-STATUS-TEXT
306900       ELSE IF PUTP-FUNCTION = "C" THEN
307000           CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-LABEL,
307100                          PUTP-RCODE
307200           MOVE "FUNCTION CALL COMPLETE" TO PUTP-STATUS-TEXT
307300
307400       ELSE MOVE "INVALID FUNCTION FOR PUTPARM" TO
307500            PUTP-STATUS-TEXT.
307600
307700     IF PF-KEY NOT = "16" THEN
307800        GO TO PUTPARM-TEST.
307900
308000******************************************************************
308100 GETPARM-TEST.
308200
308300     DISPLAY AND READ GETP-SCREEN ON CRT PFKEYS 1, 16.
308400
308401     MOVE SPACES TO GETP-STATUS-TEXT.
308402     IF PF-KEY = "01" THEN
308403         MOVE SPACES TO PUTP-LABEL
308404         MOVE SPACES TO PUTP-REFLABEL
308405         MOVE SPACES TO PUTP-CLEANUP
308406         MOVE SPACES TO PUTP-LIB
308407         MOVE SPACES TO PUTP-VOL
308408         MOVE 0 TO PUTP-UC1
308409         MOVE 1 TO PUTP-UC2
308410         MOVE 0 TO PUTP-KW1
308411         MOVE 3 TO PUTP-KW2
308412
308413         MOVE "C" TO PUTP-FUNCTION
308414         CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-LABEL,
308415                          PUTP-RCODE
308416
308417         MOVE "E" TO PUTP-FUNCTION
308418         MOVE "XX3" TO PUTP-PRNAME
308419         MOVE "QQQ" TO PUTP-FILE
308420         MOVE "B" TO PUTP-PFKEY-VALUE
308421
308422         CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-USAGECNT,
308423                          PUTP-PRNAME, PUTP-KWCOUNT,
308424                          PUTP-FILE-KW, PUTP-FILE, PUTP-LEN-8,
308425                          PUTP-LIB-KW, PUTP-LIB, PUTP-LEN-8,
308426                          PUTP-VOL-KW, PUTP-VOL, PUTP-LEN-6,
308427                          PUTP-PFKEY-VALUE, PUTP-LABEL,
308428                          PUTP-REFLABEL, PUTP-CLEANUP,
308429                          PUTP-RCODE
308430
308431         MOVE "E" TO PUTP-FUNCTION
308432         MOVE "XX1" TO PUTP-PRNAME
308433         MOVE "GETPARM1" TO PUTP-FILE
308434         MOVE "A" TO PUTP-PFKEY-VALUE
308435
308436         CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-USAGECNT,
308437                          PUTP-PRNAME, PUTP-KWCOUNT,
308438                          PUTP-FILE-KW, PUTP-FILE, PUTP-LEN-8,
308439                          PUTP-LIB-KW, PUTP-LIB, PUTP-LEN-8,
308440                          PUTP-VOL-KW, PUTP-VOL, PUTP-LEN-6,
308441                          PUTP-PFKEY-VALUE, PUTP-LABEL,
308442                          PUTP-REFLABEL, PUTP-CLEANUP,
308443                          PUTP-RCODE
308444
308445         MOVE "D" TO PUTP-FUNCTION
308446         MOVE "XX2" TO PUTP-PRNAME
308447         MOVE "GETPARM2" TO PUTP-FILE
308448         MOVE "@" TO PUTP-PFKEY-VALUE
308449
308450         CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-USAGECNT,
308451                          PUTP-PRNAME, PUTP-KWCOUNT,
308452                          PUTP-FILE-KW, PUTP-FILE, PUTP-LEN-8,
308453                          PUTP-LIB-KW, PUTP-LIB, PUTP-LEN-8,
308454                          PUTP-VOL-KW, PUTP-VOL, PUTP-LEN-6,
308455                          PUTP-PFKEY-VALUE, PUTP-LABEL,
308456                          PUTP-REFLABEL, PUTP-CLEANUP,
308457                          PUTP-RCODE
308458
308459         DISPLAY "GETPARM TEST SETUP COMPLETE"
308460
308461     END-IF.
308700     IF PF-KEY = "00" THEN
308800           CALL "GETPARM" USING GETP-TYPE, GETP-FORM,
308900                          GETP-PRNAME, GETP-PFKEY,
309000                          GETP-MESSAGE-ID,
309100                          GETP-MESSAGE-ISSUER,
309200                          GETP-MESSAGE-COUNT,
309300
309400                          GETP-MESSAGE-TEXT-1, GETP-MESSAGE-LEN-1,
309500
309600                          GETP-MESSAGE-TEXT-2, GETP-MESSAGE-LEN-2,
309700
309800                          GETP-TXT1-TYPE,
309900                          GETP-TXT1-VAL, GETP-TXT1-LEN,
310000                          GETP-TXT1-FLROW, GETP-TXT1-ROW,
310100                          GETP-TXT1-FLCOL, GETP-TXT1-COL,
310200
310300                          GETP-TXT2-TYPE,
310400                          GETP-TXT2-VAL, GETP-TXT2-LEN,
310500                          GETP-TXT2-FLROW, GETP-TXT2-ROW,
310600                          GETP-TXT2-FLCOL, GETP-TXT2-COL,
310700
310800                          GETP-TXT3-TYPE,
310900                          GETP-TXT3-VAL, GETP-TXT3-LEN,
311000                          GETP-TXT3-FLROW, GETP-TXT3-ROW,
311100                          GETP-TXT3-FLCOL, GETP-TXT3-COL,
311200
311300                          GETP-TXT4-TYPE,
311400                          GETP-TXT4-VAL, GETP-TXT4-LEN,
311500                          GETP-TXT4-FLROW, GETP-TXT4-ROW,
311600                          GETP-TXT4-FLCOL, GETP-TXT4-COL,
311700
311800                          GETP-KW1-TYPE, GETP-FILE-KW,
311900                          GETP-FILE, GETP-LEN-8,
312000                          GETP-KW1-FLROW, GETP-KW1-ROW,
312100                          GETP-KW1-FLCOL, GETP-KW1-COL,
312200                          GETP-KW1-DATAT,
312300
312400                          GETP-KW2-TYPE, GETP-LIB-KW,
312500                          GETP-LIB, GETP-LEN-8,
312600                          GETP-KW2-FLROW, GETP-KW2-ROW,
312700                          GETP-KW2-FLCOL, GETP-KW2-COL,
312800                          GETP-KW2-DATAT,
312900
313000                          GETP-KW3-TYPE, GETP-VOL-KW,
313100                          GETP-VOL, GETP-LEN-6,
313200                          GETP-KW3-FLROW, GETP-KW3-ROW,
313300                          GETP-KW3-FLCOL, GETP-KW3-COL,
313400                          GETP-KW3-DATAT,
313500
313600                          GETP-PFKEY-TYPE, GETP-PFKEY-MASK,
313700                          GETP-ENABLE-ENTER.
313800
313900     MOVE "FUNCTION CALL COMPLETE" TO GETP-STATUS-TEXT.
314000
314100     IF PF-KEY NOT = "16" THEN
314200        GO TO GETPARM-TEST.
314300
314400******************************************************************
314500 GETPARM-2-PARAMETERS-TEST.
314600*$WANG_CODE
314700     CALL "QAGP255".
314800*$WANG_END
314900
315000******************************************************************
315100 DAY-TEST.
315200     DISPLAY AND READ DAY-SCREEN ON CRT PFKEYS 16.
315300
315400     IF PF-KEY NOT = "16" THEN
315500        CALL "DAY" USING DAY-DATE DAY-DOW
315600        GO TO DAY-TEST.
315700******************************************************************
315800
315900 DYNAMIC-LINK-CALL.
316000     DISPLAY AND READ LINK-PARAMETER-SCREEN ON CRT.
316100     MOVE "SUB1" TO LINKNAME.
316200     CALL LINKNAME USING LINKARG1 LINKARG2 LINKARG3
316300     ON EXCEPTION PERFORM LINK-FAILED.
316400     DISPLAY AND READ LINK-PARAMETER-SCREEN ON CRT.
316500
316600 LINK-FAILED.
316700     DISPLAY AND READ LINK-FAILED-SCREEN ON CRT.
316800
316900******************************************************************
317000
317100 GETPARM-CALL-TST-PARAM.
317200
317300     CALL "GETPARM" USING
317400     GP-TYPE GP-FORM GP-PRNAME GP-PFKEY
317500     GP-MESSAGE-ID GP-MESSAGE-ISSUER GP-MESSAGE-COUNT
317600     GP-MESSAGE-TEXT-1 GP-MESSAGE-LEN-1
317700     GP-MESSAGE-TEXT-2 GP-MESSAGE-LEN-2
317800     GP-T GP-TEXT GP-LENGTH GP-A GP-N09 GP-A GP-N05
317900     GP-T GP-TEXT GP-LENGTH GP-A GP-N09 GP-A GP-N40
318000     GP-T GP-TEXT GP-LENGTH GP-A GP-N10 GP-A GP-N05
318100     GP-T GP-TEXT GP-LENGTH GP-A GP-N10 GP-A GP-N40
318200     GP-T GP-TEXT GP-LENGTH GP-A GP-N11 GP-A GP-N05
318300     GP-T GP-TEXT GP-LENGTH GP-A GP-N11 GP-A GP-N40
318400     GP-T GP-TEXT GP-LENGTH GP-A GP-N12 GP-A GP-N05
318500     GP-T GP-TEXT GP-LENGTH GP-A GP-N12 GP-A GP-N40
318600     GP-T GP-TEXT GP-LENGTH GP-A GP-N13 GP-A GP-N05
318700     GP-T GP-TEXT GP-LENGTH GP-A GP-N13 GP-A GP-N40
318800     GP-T GP-TEXT GP-LENGTH GP-A GP-N14 GP-A GP-N05
318900     GP-T GP-TEXT GP-LENGTH GP-A GP-N14 GP-A GP-N40
319000     GP-T GP-TEXT GP-LENGTH GP-A GP-N15 GP-A GP-N05
319100     GP-T GP-TEXT GP-LENGTH GP-A GP-N15 GP-A GP-N40
319200     GP-T GP-TEXT GP-LENGTH GP-A GP-N16 GP-A GP-N05
319300     GP-T GP-TEXT GP-LENGTH GP-A GP-N16 GP-A GP-N40
319400     GP-T GP-TEXT GP-LENGTH GP-A GP-N17 GP-A GP-N05
319500     GP-T GP-TEXT GP-LENGTH GP-A GP-N17 GP-A GP-N40
319600     GP-T GP-TEXT GP-LENGTH GP-A GP-N18 GP-A GP-N05
319700     GP-T GP-TEXT GP-LENGTH GP-A GP-N18 GP-A GP-N40
319800     GP-T GP-TEXT GP-LENGTH GP-A GP-N19 GP-A GP-N05
319900     GP-T GP-TEXT GP-LENGTH GP-A GP-N19 GP-A GP-N40
320000     GP-T GP-TEXT GP-LENGTH GP-A GP-N20 GP-A GP-N05
320100     GP-T GP-TEXT GP-LENGTH GP-A GP-N20 GP-A GP-N40.
320200
320300     DISPLAY "THE GETPARM HAS FINISHED. ".
320400
320500******************************************************************
320600
320700 SUBMIT-CALL.
320800
320801     CALL "EXTRACT" USING KW-PL, SUBMIT-LIB.
320900     MOVE ZERO TO SUBMIT-RC-B2.
321000     MOVE SUBMIT-TIME-B2 TO SUBMIT-TIME-X.
321100     MOVE SUBMIT-RC-B2   TO SUBMIT-RC-X.
321200     MOVE "SPECIFIY PARAMETERS FOR SUBMIT" TO SUBMIT-TITLE.
321300
321400     MOVE SPACES TO SUBMIT-PARMS-ARRAY.
321500     MOVE ZERO TO SUBMIT-PARMS-COUNT.
321600
321700     PERFORM GET-SUBMIT-ITEMS.
321800     IF PF-KEY = "16" THEN GO TO SUBMIT-CALL-EXIT.
321900
322000     MOVE SUBMIT-TIME-X TO SUBMIT-TIME-B2.
322100
322200     IF SUBMIT-PARMS-COUNT NOT = ZERO THEN
322300        CALL "SETSUBMIT" USING SUBMIT-PARMS-COUNT,
322400                               SUBMIT-PARMS-LENGTH,
322500                               SUBMIT-PARMS(1),
322600                               SUBMIT-PARMS-LENGTH,
322700                               SUBMIT-PARMS(2),
322800                               SUBMIT-PARMS-LENGTH,
322900                               SUBMIT-PARMS(3),
323000                               SUBMIT-PARMS-LENGTH,
323100                               SUBMIT-PARMS(4),
323200                               SUBMIT-PARMS-LENGTH,
323300                               SUBMIT-PARMS(5),
323400                               SUBMIT-PARMS-LENGTH,
323500                               SUBMIT-PARMS(6),
323600                               SUBMIT-PARMS-LENGTH,
323700                               SUBMIT-PARMS(7),
323800                               SUBMIT-PARMS-LENGTH,
323900                               SUBMIT-PARMS(8).
324000
324100     IF USE-SHORT-SUBMIT THEN
324200        CALL "SUBMIT" USING SUBMIT-FILE SUBMIT-LIB SUBMIT-VOL
324300           SUBMIT-RC
324400     ELSE
324500        CALL "SUBMIT" USING SUBMIT-FILE SUBMIT-LIB SUBMIT-VOL
324600           SUBMIT-NAME SUBMIT-STATUS SUBMIT-DISP SUBMIT-CLASS
324700           SUBMIT-ABORT SUBMIT-TIME SUBMIT-LIMIT SUBMIT-RC.
324800
324900     MOVE "SUBMIT IS COMPLETE" TO SUBMIT-TITLE.
325000     MOVE SUBMIT-RC-B2   TO SUBMIT-RC-X.
325100
325200     MOVE "        (ENTER) submit again (1) DISPRINT (16) EXIT"
325300         TO SUBMIT-FOOTER.
325400     DISPLAY AND READ SUBMIT-SCREEN ON CRT PFKEY 1, 16.
325450     IF PF-KEY = "01" THEN CALL "DISPRINT".
325500     IF PF-KEY NOT = "16" THEN GO TO SUBMIT-CALL.
325600 SUBMIT-CALL-EXIT.
325700     EXIT.
325800
325900 GET-SUBMIT-ITEMS.
326000
326100     MOVE "(1) SETSUBMIT parms. (ENTER) to continue. (16) EXIT"
326200         TO SUBMIT-FOOTER.
326300     DISPLAY AND READ SUBMIT-SCREEN ON CRT
326400     PFKEY 1, 16.
326500
326600     IF PF-KEY = "01" THEN
326700        PERFORM GET-SUBMIT-PARMS
326800        GO TO GET-SUBMIT-ITEMS.
326900
327000 GET-SUBMIT-PARMS.
327100
327200     DISPLAY AND READ SUBMIT-PARAMETER-SCREEN ON CRT
327300
327400     IF SUBMIT-PARMS(8) NOT = SPACES THEN
327500        MOVE 8 TO SUBMIT-PARMS-COUNT
327600     ELSE IF SUBMIT-PARMS(7) NOT = SPACES THEN
327700        MOVE 7 TO SUBMIT-PARMS-COUNT
327800     ELSE IF SUBMIT-PARMS(6) NOT = SPACES THEN
327900        MOVE 6 TO SUBMIT-PARMS-COUNT
328000     ELSE IF SUBMIT-PARMS(5) NOT = SPACES THEN
328100        MOVE 5 TO SUBMIT-PARMS-COUNT
328200     ELSE IF SUBMIT-PARMS(4) NOT = SPACES THEN
328300        MOVE 4 TO SUBMIT-PARMS-COUNT
328400     ELSE IF SUBMIT-PARMS(3) NOT = SPACES THEN
328500        MOVE 3 TO SUBMIT-PARMS-COUNT
328600     ELSE IF SUBMIT-PARMS(2) NOT = SPACES THEN
328700        MOVE 2 TO SUBMIT-PARMS-COUNT
328800     ELSE IF SUBMIT-PARMS(1) NOT = SPACES THEN
328900        MOVE 1 TO SUBMIT-PARMS-COUNT
329000     ELSE MOVE 0 TO SUBMIT-PARMS-COUNT.
329100
329200******************************************************************
329300
329400 DATE-CALL.
329500
329600     MOVE "SPECIFIY PARAMETERS FOR DATE" TO DATE-TITLE.
329700
329800     DISPLAY AND READ DATE-SCREEN ON CRT
329900     PFKEYS  1,  2,  3,  4,  5,  6,  7,  8,  9,
330000             10, 11, 12, 13, 14, 16.
330100
330200     IF PF-KEY = "01" THEN
330300        MOVE "HD" TO DATE-FUNCTION
330400        CALL "DATE" USING DATE-FUNCTION DATE-DT1
330500     ELSE IF PF-KEY = "02" THEN
330600        MOVE "HL" TO DATE-FUNCTION
330700        CALL "DATE" USING DATE-FUNCTION DATE-DT2
330800     ELSE IF PF-KEY = "03" THEN
330900        MOVE "GJ" TO DATE-FUNCTION
331000        CALL "DATE" USING DATE-FUNCTION
331100              DATE-G1 DATE-J1 DATE-RC
331200        MOVE DATE-RC-B2 TO DATE-RC1
331300     ELSE IF PF-KEY = "04" THEN
331400        MOVE "JG" TO DATE-FUNCTION
331500        CALL "DATE" USING DATE-FUNCTION
331600              DATE-J2 DATE-G2 DATE-RC
331700        MOVE DATE-RC-B2 TO DATE-RC2
331800     ELSE IF PF-KEY = "05" THEN
331900        MOVE "G-" TO DATE-FUNCTION
332000        CALL "DATE" USING DATE-FUNCTION
332100              DATE-G3 DATE-G4 DATE-DIFF DATE-RC
332200        MOVE DATE-DIFF-B2 TO DATE-DIFF1
332300        MOVE DATE-RC-B2 TO DATE-RC3
332400     ELSE IF PF-KEY = "06" THEN
332500        MOVE "J-" TO DATE-FUNCTION
332600        CALL "DATE" USING DATE-FUNCTION
332700              DATE-J3 DATE-J4 DATE-DIFF DATE-RC
332800        MOVE DATE-DIFF-B2 TO DATE-DIFF2
332900        MOVE DATE-RC-B2 TO DATE-RC4
333000     ELSE IF PF-KEY = "07" THEN
333100        MOVE "G+" TO DATE-FUNCTION
333200        MOVE DATE-ADD1 TO DATE-ADD-B2
333300        CALL "DATE" USING DATE-FUNCTION
333400              DATE-G5 DATE-ADD DATE-G6 DATE-RC
333500        MOVE DATE-RC-B2 TO DATE-RC5
333600     ELSE IF PF-KEY = "08" THEN
333700        MOVE "J+" TO DATE-FUNCTION
333800        MOVE DATE-ADD2 TO DATE-ADD-B2
333900        CALL "DATE" USING DATE-FUNCTION
334000              DATE-J5 DATE-ADD DATE-J6 DATE-RC
334100        MOVE DATE-RC-B2 TO DATE-RC6
334200     ELSE IF PF-KEY = "09" THEN
334300        MOVE "GD" TO DATE-FUNCTION
334400        CALL "DATE" USING DATE-FUNCTION
334500              DATE-G7 DATE-DAY1 DATE-RC
334600        MOVE DATE-RC-B2 TO DATE-RC7
334700     ELSE IF PF-KEY = "10" THEN
334800        MOVE "JD" TO DATE-FUNCTION
334900        CALL "DATE" USING DATE-FUNCTION
335000              DATE-J7 DATE-DAY2 DATE-RC
335100        MOVE DATE-RC-B2 TO DATE-RC8
335200     ELSE IF PF-KEY = "11" THEN
335300        MOVE "X-" TO DATE-FUNCTION
335400        CALL "DATE" USING DATE-FUNCTION
335500              DATE-X1 DATE-X2 DATE-DIFF DATE-RC
335600        MOVE DATE-DIFF-B2 TO DATE-DIFF3
335700        MOVE DATE-RC-B2 TO DATE-RC9
335800     ELSE IF PF-KEY = "12" THEN
335900        MOVE "X+" TO DATE-FUNCTION
336000        MOVE DATE-ADD3 TO DATE-ADD-B2
336100        CALL "DATE" USING DATE-FUNCTION
336200              DATE-X3 DATE-ADD DATE-X4 DATE-RC
336300        MOVE DATE-RC-B2 TO DATE-RC10
336400     ELSE IF PF-KEY = "13" THEN
336500        MOVE "XR" TO DATE-FUNCTION
336600        CALL "DATE" USING DATE-FUNCTION
336700              DATE-X5 DATE-R1 DATE-RC
336800        MOVE DATE-RC-B2 TO DATE-RC11
336900     ELSE IF PF-KEY = "14" THEN
337000        MOVE "RX" TO DATE-FUNCTION
337100        CALL "DATE" USING DATE-FUNCTION
337200              DATE-R2 DATE-X6 DATE-RC
337300        MOVE DATE-RC-B2 TO DATE-RC12
337400     .
337500     IF PF-KEY NOT = "16" THEN
337600        GO TO DATE-CALL.
337700
337800     MOVE "  " TO DATE-FUNCTION.
337900
338000******************************************************************
338100
338200 LINK-CALL.
338300
338400     MOVE "SPECIFIY PARAMETERS FOR LINK" TO LINK-TITLE.
338500
338600     MOVE ZERO TO LINK-RETURN-1.
338700     MOVE ZERO TO LINK-RETURN-2.
338800     MOVE ZERO TO LINK-RETURN-X.
338900
339000     MOVE ZERO TO LINK-COMP-CODE-1.
339100     MOVE ZERO TO LINK-COMP-CODE-2.
339200     MOVE ZERO TO LINK-COMP-CODE-X.
339300
339301     PERFORM LINK-SCREEN-MOD.
339400     DISPLAY AND READ LINK-SCREEN ON CRT PFKEY 16.
339500     IF PF-KEY = "16" THEN GO TO LINK-CALL-EXIT.
339600
339700     MOVE LINK-MESS-LEN-X TO LINK-MESS-LEN-2.
339800     MOVE LINK-EXT TO LINK-EXT-FULL.
339900     CALL "WSETFILEXT" USING LINK-EXT-FULL.
340000
340100     CALL "LINK" USING LINK-FILE LINK-TYPE LINK-LIB LINK-VOL
340200         LINK-SPECIAL LINK-EXT-OPT LINK-PARM-CNT
340300         LINK-CANCEL-FLAG LINK-MESSAGE LINK-MESS-LEN
340400         LINK-HELP LINK-COMP-CODE LINK-RETURN.
340500
340600     MOVE "LINK IS COMPLETE" TO LINK-TITLE.
340700     MOVE LINK-COMP-CODE-2   TO LINK-COMP-CODE-X
340800     MOVE LINK-RETURN-2      TO LINK-RETURN-X.
340900
340901     PERFORM LINK-SCREEN-PROTECT.
341000     DISPLAY AND READ LINK-SCREEN ON CRT PFKEY 16.
341100     IF PF-KEY NOT = "16" THEN GO TO LINK-CALL.
341200 LINK-CALL-EXIT.
341300     EXIT.
341301
341302 LINK-SCREEN-PROTECT.
341303     MOVE FAC-LINE TO
341304         FAC OF S-LINK-FILE,
341305         FAC OF S-LINK-LIB,
341306         FAC OF S-LINK-VOL,
341307         FAC OF S-LINK-EXT,
341308         FAC OF S-LINK-TYPE,
341309         FAC OF S-LINK-SPECIAL,
341310         FAC OF S-LINK-EXT-OPT,
341311         FAC OF S-LINK-CANCEL-FLAG,
341312         FAC OF S-LINK-MESSAGE,
341313         FAC OF S-LINK-MESS-LEN-X,
341314         FAC OF S-LINK-HELP.
341315 LINK-SCREEN-MOD.
341316     MOVE FAC-MOD TO
341317         FAC OF S-LINK-FILE,
341318         FAC OF S-LINK-LIB,
341319         FAC OF S-LINK-VOL,
341320         FAC OF S-LINK-EXT,
341321         FAC OF S-LINK-TYPE,
341322         FAC OF S-LINK-SPECIAL,
341323         FAC OF S-LINK-EXT-OPT,
341324         FAC OF S-LINK-CANCEL-FLAG,
341325         FAC OF S-LINK-MESSAGE,
341326         FAC OF S-LINK-MESS-LEN-X,
341327         FAC OF S-LINK-HELP.
341328
341400
341500******************************************************************
341600
341700 LINKPROC-CALL.
341701
341702     CALL "WISPPLAT" USING WISPPLAT-NAME, WISPPLAT-CODE.
341703     IF WISPPLAT-WINDOWS-NT THEN
341704         MOVE "PRTARGNT" TO LINKPROC-FILE
341705     END-IF.
341800
341801     CALL "EXTRACT" USING KW-PL, LINKPROC-LIB.
341802
341900     MOVE "SPECIFIY PARAMETERS FOR LINKPROC" TO LINKPROC-TITLE.
342000
342100     MOVE ZERO TO LINKPROC-RETURN-1.
342200     MOVE ZERO TO LINKPROC-RETURN-2.
342300     MOVE ZERO TO LINKPROC-RETURN-X.
342400     MOVE ZERO TO LINKPROC-COMP-1.
342500     MOVE ZERO TO LINKPROC-COMP-2.
342600     MOVE ZERO TO LINKPROC-COMP-X.
342700
342800     DISPLAY AND READ LINKPROC-SCREEN ON CRT.
342900
343000     MOVE LINKPROC-PLEN1-X TO LINKPROC-PLEN1.
343100     MOVE LINKPROC-PLEN2-X TO LINKPROC-PLEN2.
343200     MOVE LINKPROC-PLEN3-X TO LINKPROC-PLEN3.
343300     MOVE LINKPROC-PLEN4-X TO LINKPROC-PLEN4.
343400     MOVE LINKPROC-PLEN5-X TO LINKPROC-PLEN5.
343500     MOVE LINKPROC-PLEN6-X TO LINKPROC-PLEN6.
343600     MOVE LINKPROC-PLEN7-X TO LINKPROC-PLEN7.
343700     MOVE LINKPROC-PLEN8-X TO LINKPROC-PLEN8.
343800
343900     CALL "LINKPROC" USING LINKPROC-FILE LINKPROC-LIB LINKPROC-VOL
344000         LINKPROC-PCNT
344100         LINKPROC-PLEN1 LINKPROC-PTXT1
344200         LINKPROC-PLEN2 LINKPROC-PTXT2
344300         LINKPROC-PLEN3 LINKPROC-PTXT3
344400         LINKPROC-PLEN4 LINKPROC-PTXT4
344500         LINKPROC-PLEN5 LINKPROC-PTXT5
344600         LINKPROC-PLEN6 LINKPROC-PTXT6
344700         LINKPROC-PLEN7 LINKPROC-PTXT7
344800         LINKPROC-PLEN8 LINKPROC-PTXT8
344900         LINKPROC-RETURN
345000         LINKPROC-COMP.
345100
345200     MOVE "LINKPROC IS COMPLETE" TO LINKPROC-TITLE.
345300     MOVE LINKPROC-RETURN-2      TO LINKPROC-RETURN-X.
345400     MOVE LINKPROC-COMP-2        TO LINKPROC-COMP-X.
345500
345600     DISPLAY AND READ LINKPROC-SCREEN ON CRT.
345700
345800
356000
356100******************************************************************
356200
356300 DO-SEARCH-TEST.
356400
356500     MOVE LOWER-FAC TO FAC OF SEARCH-ITEM-FIELD.
356600     DISPLAY AND READ SEARCH-SCR ON CRT PFKEYS 16, 1, 2, 3, 4.
356700     MOVE SEARCH-LEN TO SEARCH-LEN-X.
356800
356900     MOVE ZERO TO SEARCH-RETURN.
357000
357100     IF PF-KEY = "01" THEN PERFORM DO-SEARCH-TEST-0
357200     ELSE IF PF-KEY = "02" THEN PERFORM DO-SEARCH-TEST-1
357300     ELSE IF PF-KEY = "03" THEN PERFORM DO-SEARCH-TEST-2
357400     ELSE IF PF-KEY = "04" THEN PERFORM DO-SEARCH-TEST-3.
357500
357600     MOVE SEARCH-RETURN-X TO SEARCH-RETURN.
357700     IF PF-KEY = "01" OR PF-KEY = "02"
357800     THEN
357900           IF SEARCH-RETURN NOT = 0 THEN
358000           MOVE COUNTRY-ITEM (SEARCH-RETURN) TO FOUND-ITEM
358100           ELSE MOVE SPACES TO FOUND-ITEM
358200     ELSE
358300           IF SEARCH-RETURN NOT = 0 THEN
358400           MOVE COUNTRY-ITEM-REVERSE (SEARCH-RETURN)
358500                TO FOUND-ITEM
358600           ELSE MOVE SPACES TO FOUND-ITEM.
358700
358800
358900     IF PF-KEY NOT = "16" THEN GO TO DO-SEARCH-TEST.
359000
359100 DO-SEARCH-TEST-0.
359200
359300     CALL "SEARCH" USING SEARCH-TABLE, SEARCH-TABLE-SIZE-P,
359400                         SEARCH-ITEM-LEN-P, SEARCH-ITEM,
359500                         SEARCH-LEN-P, SEARCH-RETURN-P.
359600
359700 DO-SEARCH-TEST-1.
359800
359900     CALL "SEARCH" USING SEARCH-TABLE, SEARCH-TABLE-SIZE-P,
360000                         SEARCH-ITEM-LEN-P, SEARCH-ITEM,
360100                         SEARCH-RETURN-P.
360200
360300 DO-SEARCH-TEST-2.
360400
360500     CALL "SEARCH" USING SEARCH-TABLE-REVERSE,
360600                         SEARCH-TABLE-SIZE-P,
360700                         SEARCH-ITEM-LEN-P, SEARCH-ITEM,
360800                         SEARCH-LEN-P, SEARCH-RETURN-P.
360900
361000 DO-SEARCH-TEST-3.
361100
361200     CALL "SEARCH" USING SEARCH-TABLE-REVERSE,
361300                         SEARCH-TABLE-SIZE-P,
361400                         SEARCH-ITEM-LEN-P, SEARCH-ITEM,
361500                         SEARCH-RETURN-P.
361600
361700
361800******************************************************************
361900
362000 WCHAIN-CALL.
362100
362200     MOVE SPACES TO WCHAIN-ERROR.
362300     DISPLAY AND READ WCHAIN-SCREEN ON CRT.
362400
362500     CALL "WCHAIN" USING WCHAIN-VOL WCHAIN-LIB WCHAIN-FILE.
362600
362700     MOVE "WCHAIN HAS FAILED" TO WCHAIN-ERROR.
362800     DISPLAY AND READ WCHAIN-SCREEN ON CRT.
362900
363000******************************************************************
363100
363200 EXTRACT-CALL.
363300
363400     DISPLAY AND READ EXTRACT-SCREEN ON CRT
363500     PFKEYS  1, 2, 3, 4, 5, 6, 16.
363600
363700     MOVE SPACES TO EXT-RECVR-1.
363800     MOVE SPACES TO EXT-RECVR-2.
363900     MOVE ZERO TO EXT-RECVR-3.
364000
364100     IF PF-KEY = "01" THEN
364200*$WANG_CODE
364300*$WANG_ELSE PROCESS
364600*       CALL "EXTRACT" USING EXT-KW-1
364700*                            EXT-RECVR-1
364800*                            WISP-APPLICATION-NAME
364900*$WANG_END
365000     ELSE IF PF-KEY = "02" THEN
365100       CALL "EXTRACT" USING EXT-KW-1
365200                            EXT-RECVR-1
365300                            EXT-LENGTH-1
365400     ELSE IF PF-KEY = "03" THEN
365500       CALL "EXTRACT" USING EXT-KW-1
365600                            EXT-RECVR-1
365700     ELSE IF PF-KEY = "04" THEN
365800       CALL "EXTRACT" USING EXT-KW-1
365900                            EXT-RECVR-1
366000                            EXT-KW-2
366100                            EXT-RECVR-2
366200     ELSE IF PF-KEY = "05" THEN
366300       CALL "EXTRACT" USING EXT-KW-1
366400                            EXT-RECVR-1
366500                            EXT-LENGTH-1
366600                            EXT-KW-2
366700                            EXT-RECVR-2
366800     ELSE IF PF-KEY = "06" THEN
366900       CALL "EXTRACT" USING EXT-KW-3
367000                            EXT-RECVR-3-X.
367100
367200******************************************************************
367300
367400 PRINT-CALL.
367500
367600     DISPLAY AND READ PRINT-SCREEN ON CRT
367700     PFKEYS  16.
367800
367900     IF PF-KEY = "00" THEN
368000       IF PRINT-FILE = "        " THEN
368100         MOVE 999 TO PRINT-RET-CODE
368200       ELSE IF PRINT-LIB = "        " THEN
368300         CALL "PRINT" USING PRINT-FILE,
368400                            PRINT-RETURN-CODE
368500       ELSE IF PRINT-VOL = "      " THEN
368600         CALL "PRINT" USING PRINT-FILE,
368700                            PRINT-LIB,
368800                            PRINT-RETURN-CODE
368900       ELSE IF PRINT-MODE = " " THEN
369000         CALL "PRINT" USING PRINT-FILE,
369100                            PRINT-LIB,
369200                            PRINT-VOL,
369300                            PRINT-RETURN-CODE
369400       ELSE IF PRINT-DISP = " " THEN
369500         CALL "PRINT" USING PRINT-FILE,
369600                            PRINT-LIB,
369700                            PRINT-VOL,
369800                            PRINT-MODE,
369900                            PRINT-RETURN-CODE
370000       ELSE IF PRINT-COPY-CNT = 0 THEN
370100         CALL "PRINT" USING PRINT-FILE,
370200                            PRINT-LIB,
370300                            PRINT-VOL,
370400                            PRINT-MODE,
370500                            PRINT-DISP,
370600                            PRINT-RETURN-CODE
370700       ELSE IF PRINT-CLASS  = " " THEN
370800         CALL "PRINT" USING PRINT-FILE,
370900                            PRINT-LIB,
371000                            PRINT-VOL,
371100                            PRINT-MODE,
371200                            PRINT-DISP,
371300                            PRINT-COPY-COUNT,
371400                            PRINT-RETURN-CODE
371500       ELSE IF PRINT-FORM-NUM = 0 THEN
371600         CALL "PRINT" USING PRINT-FILE,
371700                            PRINT-LIB,
371800                            PRINT-VOL,
371900                            PRINT-MODE,
372000                            PRINT-DISP,
372100                            PRINT-COPY-COUNT,
372200                            PRINT-CLASS,
372300                            PRINT-RETURN-CODE
372400       ELSE
372500         CALL "PRINT" USING PRINT-FILE,
372600                            PRINT-LIB,
372700                            PRINT-VOL,
372800                            PRINT-MODE,
372900                            PRINT-DISP,
373000                            PRINT-COPY-COUNT,
373100                            PRINT-CLASS,
373200                            PRINT-FORM-NUMBER,
373300                            PRINT-RETURN-CODE.
373400      IF PRINT-RET-CODE = 999 THEN
373500        MOVE "INVALID 'PRINT' CALL.  CHECK PARAMETERS"
373600          TO PRINT-MESG
373700      ELSE
373800        MOVE "'PRINT' CALL COMPLETE" TO PRINT-MESG.
373900
374000******************************************************************
374100
374200 BELL-PAUSE-CALL.
374300
374400     DISPLAY AND READ BELL-PAUSE-SCREEN ON CRT
374500     PFKEYS 1, 2, 16.
374600
374700     IF PF-KEY = "01" THEN
374800       CALL "BELL" USING BELL-PAUSE-TIME-LEN
374900       MOVE "'BELL' CALL COMPLETE" TO BELL-PAUSE-MESG.
375000     IF PF-KEY = "02" THEN
375100       CALL "PAUSE" USING BELL-PAUSE-TIME-LEN
375200       MOVE "'PAUSE' CALL COMPLETE" TO BELL-PAUSE-MESG.
375300
375400******************************************************************
375500 DO-BITPACK.
375600     MOVE LOWER-FAC TO FAC OF BP-STRING.
375700     DISPLAY AND READ BITPACK-SCREEN ON CRT PFKEYS 16.
375800
375900     IF PF-KEY NOT = "16" THEN
376000         CALL "BITUNPK" USING ASCII-STRING BIT-STRING ASCII-LEN
376100         CALL "BITPACK" USING BIT-STRING ASCII-STRING2 BIT-LEN
376200         GO TO DO-BITPACK.
376300******************************************************************
376400 DO-HEXPACK.
376500     MOVE LOWER-FAC TO FAC OF HP-STRING.
376600     DISPLAY AND READ HEXPACK-SCREEN ON CRT PFKEYS 16.
376700
376800     IF PF-KEY NOT = "16" THEN
376900         CALL "HEXUNPK" USING AHEX-STRING HEX-STRING AHEX-LEN
377000         CALL "HEXPACK" USING HEX-STRING AHEX-STRING2 HEX-LEN
377100         GO TO DO-HEXPACK.
377200******************************************************************
377300 DO-STRING.
377400
377500     CALL "HEXUNPK" USING STRING-OUTSTR, STRING-HEXOUT,
377600                          STRING-INSTR-LEN.
377700     MOVE LOWER-FAC TO FAC OF STRING-INSTR-X.
377800     DISPLAY AND READ STRING-SCREEN ON CRT
377900         ONLY PFKEYS 1, 2, 3, 4, 5, 6, 7, 16.
378000
378100     IF PF-KEY = "01" THEN
378200         MOVE "CT" TO STRING-FUNCTION
378300         CALL "STRING" USING STRING-FUNCTION
378400               STRING-INSTR, STRING-INSTR-LEN, STRING-OUTSTR
378500         GO TO DO-STRING.
378600     IF PF-KEY = "02" THEN
378700         MOVE "LJ" TO STRING-FUNCTION
378800         CALL "STRING" USING STRING-FUNCTION
378900               STRING-INSTR, STRING-INSTR-LEN, STRING-OUTSTR
379000         GO TO DO-STRING.
379100     IF PF-KEY = "03" THEN
379200         MOVE "RJ" TO STRING-FUNCTION
379300         CALL "STRING" USING STRING-FUNCTION
379400               STRING-INSTR, STRING-INSTR-LEN, STRING-OUTSTR
379500         GO TO DO-STRING.
379600     IF PF-KEY = "04" THEN
379700         MOVE "RV" TO STRING-FUNCTION
379800         CALL "STRING" USING STRING-FUNCTION
379900               STRING-INSTR, STRING-INSTR-LEN, STRING-OUTSTR
380000         GO TO DO-STRING.
380100     IF PF-KEY = "05" THEN
380200         MOVE "AE" TO STRING-FUNCTION
380300         CALL "STRING" USING STRING-FUNCTION
380400               STRING-INSTR, STRING-INSTR-LEN, STRING-OUTSTR
380500         GO TO DO-STRING.
380600     IF PF-KEY = "06" THEN
380700         MOVE "EA" TO STRING-FUNCTION
380800         CALL "STRING" USING STRING-FUNCTION
380900               STRING-INSTR, STRING-INSTR-LEN, STRING-OUTSTR
381000         GO TO DO-STRING.
381100     IF PF-KEY = "07" THEN
381200         MOVE "EA" TO STRING-FUNCTION
381300         CALL "STRING" USING STRING-FUNCTION
381400               STRING-OUTSTR, STRING-INSTR-LEN, STRING-INSTR
381500         GO TO DO-STRING.
381600******************************************************************
381700
381800 SCRATCH-CALL.
381900     MOVE BRITE TO FAC OF SCRATCH-RC-S.
382000     MOVE LOWER-FAC TO FAC OF SCRATCH-EXT-TEXT.
382100     DISPLAY AND READ SCRATCH-SCREEN ON CRT
382200     PFKEYS  16.
382300
382400     IF PF-KEY NOT = "16" THEN
382500       MOVE ZERO TO SCRATCH-RET-CODE
382600
382700       CALL "WSETFILEXT" USING SCRATCH-EXT
382800
382900       IF SCRATCH-EXP-DATE-CHECK = " "  THEN
383000         CALL "SCRATCH" USING SCRATCH-TYPE,
383100                              SCRATCH-FNAME,
383200                              SCRATCH-LIBNAME,
383300                              SCRATCH-VOL,
383400                              SCRATCH-RETURN-CODE
383500       ELSE IF SCRATCH-ACCESS-LIMITS-FLAG = " " THEN
383600         CALL "SCRATCH" USING SCRATCH-TYPE,
383700                              SCRATCH-FNAME,
383800                              SCRATCH-LIBNAME,
383900                              SCRATCH-VOL,
384000                              SCRATCH-EXP-DATE-CHECK,
384100                              SCRATCH-RETURN-CODE
384200       ELSE
384300         CALL "SCRATCH" USING SCRATCH-TYPE,
384400                              SCRATCH-FNAME,
384500                              SCRATCH-LIBNAME,
384600                              SCRATCH-VOL,
384700                              SCRATCH-EXP-DATE-CHECK,
384800                              SCRATCH-ACCESS-LIMITS-FLAG,
384900                              SCRATCH-RETURN-CODE.
385000******************************************************************
385100
385200 SORTCALL-TEST.
385300
385400*    MOVE SPACES TO SC-PARMS SC-FILETYPE.
385500     MOVE ZERO TO SC-RECSIZE-N SC-SORTCODE-Z SC-RETURNCODE-N.
385501     MOVE BRITE TO FAC OF SORTCALL-RC-S.
385600
385700 SORTCALL-DISPLAY.
385800     DISPLAY AND READ SORTCALL-SCREEN ON CRT
385900     PFKEYS  1 8 16.
386000
386100     IF PF-KEY = "00" THEN
386200        MOVE ZERO         TO SC-RECSIZE-B1
386300        MOVE SC-RECSIZE-N TO SC-RECSIZE-B2
386400
386500*$VAX_CODE PROCESS
386600*       CALL "SORTCALL" USING SC-PARMS SC-RETURNCODE
386700*$VAX_ELSE PROCESS
386800        CALL "WISPSORT" USING SC-PARMS SC-FILETYPE SC-RECSIZE
386900                              SC-SORTCODE SC-RETURNCODE
387000*$VAX_END
387100
387200        MOVE SC-SORTCODE-B2 TO SC-SORTCODE-Z
387300        MOVE SC-RETURNCODE-B2 TO SC-RETURNCODE-N
387400        GO TO SORTCALL-DISPLAY.
387401     IF PF-KEY = "01" THEN
387402
387403         CALL "PUTPARM" USING
387404                         PP-FUNCTION, PP-PRNAME, PP-KWCOUNT,
387405                          PP-FILE-KW, SC-OUTFILE, PP-LEN-8,
387406                          PP-LIB-KW, SC-OUTLIB, PP-LEN-8,
387407                          PP-VOL-KW, SC-OUTVOL, PP-LEN-6,
387408                          PP-RCODE
387409
387410         CALL "LINK" USING DISPLAY-PROG, PP-LINK-TYPE,
387411                     LINK-COMP-CODE,
387412                       LINK-RETURN
387413
387414        GO TO SORTCALL-DISPLAY.
387415
	   IF PF-KEY = "08" THEN
	       PERFORM SORTCALL-AUTOTEST.
387500
387600 SORTCALL-END.
387700     EXIT.

      ************************************             
       SORTCALL-AUTOTEST.
      ************************************

           MOVE ZERO       TO SORTCALL-TESTED.
           MOVE ZERO       TO SORTCALL-FAILED.
           MOVE 2000       TO SORTCALL-MAX-KEY.

      *          1234567890123456789012345678901234567890
	   MOVE "       --- SORTCALL AUTOTEST ---        " 
	       TO PROGRESS-TITLE.
	   MOVE "    PLEASE WAIT FOR TESTS TO COMPLETE   " 
	       TO PROGRESS-FOOTER.
	   PERFORM INIT-PROGRESS-SCREEN.

      ************************************
           MOVE 101        TO SORTCALL-TEST-ID.
           MOVE "IDXFIX"   TO SORTCALL-INFILE.
           MOVE "I"        TO SC-FILETYPE
           MOVE 45         TO SC-RECSIZE-N.
           MOVE 1334       TO SORTCALL-RECCNT.
           PERFORM CALL-SORTCALL-AND-VERIFY.

      ************************************
           MOVE 102        TO SORTCALL-TEST-ID.
           MOVE "IDXFIXC"  TO SORTCALL-INFILE.
           MOVE "I"        TO SC-FILETYPE
           MOVE 45         TO SC-RECSIZE-N.
           MOVE 1334       TO SORTCALL-RECCNT.
           PERFORM CALL-SORTCALL-AND-VERIFY.

      ************************************
           MOVE 103        TO SORTCALL-TEST-ID.
           MOVE "IDXVAR"   TO SORTCALL-INFILE.
           MOVE "I"        TO SC-FILETYPE
           MOVE 80         TO SC-RECSIZE-N.
           MOVE 1334       TO SORTCALL-RECCNT.
           PERFORM CALL-SORTCALL-AND-VERIFY.

      ************************************
           MOVE 104        TO SORTCALL-TEST-ID.
           MOVE "ALTFIX"   TO SORTCALL-INFILE.
           MOVE "I"        TO SC-FILETYPE
           MOVE 55         TO SC-RECSIZE-N.
           MOVE 1334       TO SORTCALL-RECCNT.
           PERFORM CALL-SORTCALL-AND-VERIFY.

      ************************************
           MOVE 105        TO SORTCALL-TEST-ID.
           MOVE "ALTVAR"   TO SORTCALL-INFILE.
           MOVE "I"        TO SC-FILETYPE
           MOVE 90         TO SC-RECSIZE-N.
           MOVE 1334       TO SORTCALL-RECCNT.
           PERFORM CALL-SORTCALL-AND-VERIFY.

      ************************************
           MOVE 106        TO SORTCALL-TEST-ID.
           MOVE "SEQFIX"   TO SORTCALL-INFILE.
           MOVE "F"        TO SC-FILETYPE
           MOVE 45         TO SC-RECSIZE-N.
           MOVE 2000       TO SORTCALL-RECCNT.
           PERFORM CALL-SORTCALL-AND-VERIFY.

      ************************************
      * Comment out the VISION 2 tests
      *** ACU_CODE PROCESS
      *    MOVE 107        TO SORTCALL-TEST-ID.
      *    MOVE "ALTVARV2" TO SORTCALL-INFILE.
      *    MOVE "I"        TO SC-FILETYPE
      *    MOVE 90         TO SC-RECSIZE-N.
      *    MOVE 1334       TO SORTCALL-RECCNT.
      *    PERFORM CALL-SORTCALL-AND-VERIFY.
      *** ACU_END

      ************************************
      *$ACU_CODE PROCESS
      *    MOVE 108        TO SORTCALL-TEST-ID.
      *    MOVE "ALTVARV3" TO SORTCALL-INFILE.
      *    MOVE "I"        TO SC-FILETYPE
      *    MOVE 90         TO SC-RECSIZE-N.
      *    MOVE 1334       TO SORTCALL-RECCNT.
      *    PERFORM CALL-SORTCALL-AND-VERIFY.
      *$ACU_END

      ************************************
      *$MF_CODE PROCESS
      *    MOVE 109        TO SORTCALL-TEST-ID.
      *    MOVE "ALTVAR4"  TO SORTCALL-INFILE.
      *    MOVE "I"        TO SC-FILETYPE
      *    MOVE 90         TO SC-RECSIZE-N.
      *    MOVE 1334       TO SORTCALL-RECCNT.
      *    PERFORM CALL-SORTCALL-AND-VERIFY.
      *$MF_END

      ************************************
      *$MF_CODE PROCESS
      *    MOVE 110        TO SORTCALL-TEST-ID.
      *    MOVE "ALTVAR8"  TO SORTCALL-INFILE.
      *    MOVE "I"        TO SC-FILETYPE
      *    MOVE 90         TO SC-RECSIZE-N.
      *    MOVE 1334       TO SORTCALL-RECCNT.
      *    PERFORM CALL-SORTCALL-AND-VERIFY.
      *$MF_END

      ************************************
      *$ACU_CODE PROCESS
      *    MOVE 110        TO SORTCALL-TEST-ID.
      *    MOVE "ALTVARV4" TO SORTCALL-INFILE.
      *    MOVE "I"        TO SC-FILETYPE
      *    MOVE 90         TO SC-RECSIZE-N.
      *    MOVE 1334       TO SORTCALL-RECCNT.
      *    PERFORM CALL-SORTCALL-AND-VERIFY.
      *$ACU_END

           
      ************************************

	   MOVE "        Press (ENTER) to continue       "
	       TO PROGRESS-FOOTER.
	   PERFORM UNLOCK-AND-READ-PROGRESS-SCRN.	   

           IF SORTCALL-FAILED = 0 THEN
               DISPLAY "SORTCALL *** PASSED *** ALL " 
                   SORTCALL-TESTED " TESTS"
           ELSE
               DISPLAY "SORTCALL *** FAILED *** "
                   SORTCALL-FAILED " of " 
                   SORTCALL-TESTED " TESTS".
           
      

      ************************************
       CALL-SORTCALL-AND-VERIFY.

	   STRING " TESTING " DELIMITED BY SIZE
               SORTCALL-INFILE DELIMITED BY SIZE
	       INTO NEXT-PROGRESS-ROW.
	   PERFORM WRITE-NEXT-PROGRESS-ROW.

           ADD 1 TO SORTCALL-TESTED.
           SET SORTCALL-TEST-OK TO TRUE.
           PERFORM SORTCALL-STD-PARMS.
           PERFORM SCRATCH-SORTCALL-OUTFILE.
           PERFORM CALL-SORTCALL.
           IF SORTCALL-TEST-OK THEN
               PERFORM CHECK-SORTCALL-OUTFILE-SIZE.
           IF SORTCALL-TEST-OK THEN
               IF SC-RECSIZE-N = 45 THEN
                   PERFORM VERIFY-SORTCALL-OUTFILE-REC45
               ELSE IF SC-RECSIZE-N = 55 THEN
                   PERFORM VERIFY-SORTCALL-OUTFILE-REC55
               ELSE IF SC-RECSIZE-N = 80 THEN
                   PERFORM VERIFY-SORTCALL-OUTFILE-REC80
               ELSE IF SC-RECSIZE-N = 90 THEN
                   PERFORM VERIFY-SORTCALL-OUTFILE-REC90
               ELSE
                   DISPLAY "SORTCALL - UNKNOWN REC SIZE "
                       SC-RECSIZE-N
               END-IF
           END-IF.
	   
           IF SORTCALL-TEST-FAILED THEN
               ADD 1 TO SORTCALL-FAILED
	       STRING " TESTING "    DELIMITED BY SIZE
		   SORTCALL-INFILE   DELIMITED BY SIZE
		   " *** FAILED ***" DELIMITED BY SIZE
		   INTO NEXT-PROGRESS-ROW
	   ELSE
	       STRING " TESTING "  DELIMITED BY SIZE
		   SORTCALL-INFILE DELIMITED BY SIZE
		   " PASSED"	   DELIMITED BY SIZE
		   INTO NEXT-PROGRESS-ROW
	   END-IF.

	   SUBTRACT 1 FROM PROGRESS-ROW-NUM.
	   PERFORM WRITE-NEXT-PROGRESS-ROW.

       VERIFY-SORTCALL-OUTFILE-REC45.

           COMPUTE SORTCALL-LAST-KEY = SORTCALL-MAX-KEY + 1.
           OPEN INPUT SORTCALL-REC45.
           PERFORM TEST AFTER UNTIL SC-FILESTAT NOT = "00"
               READ SORTCALL-REC45 NEXT RECORD
               AT END
                   CONTINUE
               NOT AT END
                   IF SC-REC45-KEY >= SORTCALL-LAST-KEY
                       SET SORTCALL-TEST-FAILED TO TRUE
                       MOVE "XX" TO SC-FILESTAT
                       DISPLAY 
                       "*** OUT OF ORDER *** SORTCALL TEST " 
                       SORTCALL-TEST-ID
                       " FILE [" SC-OUTFILE 
                       "][" SC-OUTLIB 
                       "][" SC-OUTVOL 
                       "] KEY=[" SC-REC45-KEY
                       "]"
                   END-IF
                   MOVE SC-REC45-KEY TO  SORTCALL-LAST-KEY
               END-READ
           END-PERFORM.
           CLOSE SORTCALL-REC45.

       VERIFY-SORTCALL-OUTFILE-REC55.

           COMPUTE SORTCALL-LAST-KEY = SORTCALL-MAX-KEY + 1.
           OPEN INPUT SORTCALL-REC55.
           PERFORM TEST AFTER UNTIL SC-FILESTAT NOT = "00"
               READ SORTCALL-REC55 NEXT RECORD
               AT END
                   CONTINUE
               NOT AT END
                   IF SC-REC55-KEY >= SORTCALL-LAST-KEY
                       SET SORTCALL-TEST-FAILED TO TRUE
                       MOVE "XX" TO SC-FILESTAT
                       DISPLAY 
                       "*** OUT OF ORDER *** SORTCALL TEST " 
                       SORTCALL-TEST-ID
                       " FILE [" SC-OUTFILE 
                       "][" SC-OUTLIB 
                       "][" SC-OUTVOL 
                       "] KEY=[" SC-REC55-KEY
                       "]"
                   END-IF
                   MOVE SC-REC55-KEY TO  SORTCALL-LAST-KEY
               END-READ
           END-PERFORM.
           CLOSE SORTCALL-REC55.

       VERIFY-SORTCALL-OUTFILE-REC80.

           COMPUTE SORTCALL-LAST-KEY = SORTCALL-MAX-KEY + 1.
           OPEN INPUT SORTCALL-REC80.
           PERFORM TEST AFTER UNTIL SC-FILESTAT NOT = "00"
               READ SORTCALL-REC80 NEXT RECORD
               AT END
                   CONTINUE
               NOT AT END
                   IF SC-REC80-KEY >= SORTCALL-LAST-KEY
                       SET SORTCALL-TEST-FAILED TO TRUE
                       MOVE "XX" TO SC-FILESTAT
                       DISPLAY 
                       "*** OUT OF ORDER *** SORTCALL TEST " 
                       SORTCALL-TEST-ID
                       " FILE [" SC-OUTFILE 
                       "][" SC-OUTLIB 
                       "][" SC-OUTVOL 
                       "] KEY=[" SC-REC80-KEY
                       "]"
                   END-IF
                   MOVE SC-REC80-KEY TO  SORTCALL-LAST-KEY
               END-READ
           END-PERFORM.
           CLOSE SORTCALL-REC80.

       VERIFY-SORTCALL-OUTFILE-REC90.

           COMPUTE SORTCALL-LAST-KEY = SORTCALL-MAX-KEY + 1.
           OPEN INPUT SORTCALL-REC90.
           PERFORM TEST AFTER UNTIL SC-FILESTAT NOT = "00"
               READ SORTCALL-REC90 NEXT RECORD
               AT END
                   CONTINUE
               NOT AT END
                   IF SC-REC90-KEY >= SORTCALL-LAST-KEY
                       SET SORTCALL-TEST-FAILED TO TRUE
                       MOVE "XX" TO SC-FILESTAT
                       DISPLAY 
                       "*** OUT OF ORDER *** SORTCALL TEST " 
                       SORTCALL-TEST-ID
                       " FILE [" SC-OUTFILE 
                       "][" SC-OUTLIB 
                       "][" SC-OUTVOL 
                       "] KEY=[" SC-REC90-KEY
                       "]"
                   END-IF
                   MOVE SC-REC90-KEY TO  SORTCALL-LAST-KEY
               END-READ
           END-PERFORM.
           CLOSE SORTCALL-REC90.
           
       CHECK-SORTCALL-OUTFILE-SIZE.
           COMPUTE READFDR-EXPECT-NUM18 = 
               SORTCALL-RECCNT * SC-RECSIZE-N.
           MOVE ZEROES TO READFDR-NUM18
           MOVE "BS"   TO READFDR-FUNCTION.
           CALL "READFDR4" USING SC-OUTFILE
                                 SC-OUTLIB
                                 SC-OUTVOL
                                READFDR-MODE,
                                READFDR-FUNCTION,
                                READFDR-NUM18
                                READFDR-RC.
           MOVE READFDR-RC-B2   TO READFDR-RC-X.

           IF READFDR-RC-X   NOT = 0 OR
              READFDR-NUM18  NOT = READFDR-EXPECT-NUM18 
           THEN
               SET SORTCALL-TEST-FAILED TO TRUE
               DISPLAY 
                   "*** FAILED *** SORTCALL TEST " SORTCALL-TEST-ID
                   " FILE [" SC-OUTFILE 
                   "][" SC-OUTLIB 
                   "][" SC-OUTVOL 
                   "] FUNC=" READFDR-FUNCTION 
                   " RC= " READFDR-RC-X 
                   " Expect [" READFDR-EXPECT-NUM18
                   "] NOT EQUAL [" READFDR-NUM18
                   "]".
           
       SCRATCH-SORTCALL-OUTFILE.
           CALL "SCRATCH" USING
                   SCRATCH-TYPE-FILE,
                   SC-OUTFILE, SC-OUTLIB, SC-OUTVOL,
                   SCRATCH-RETURN-CODE.

       CALL-SORTCALL.
           MOVE ZERO         TO SC-RECSIZE-B1.
           MOVE SC-RECSIZE-N TO SC-RECSIZE-B2.

           IF SC-FILETYPE = "I" THEN
               CALL "SORTCALL" USING SC-PARMS 
                                     SC-RETURNCODE
           ELSE
               CALL "WISPSORT" USING SC-PARMS 
                                     SC-FILETYPE 
                                     SC-RECSIZE
                                     SC-SORTCODE 
                                     SC-RETURNCODE
           END-IF.                                   

           MOVE SC-SORTCODE-B2 TO SC-SORTCODE-Z.
           MOVE SC-RETURNCODE-B2 TO SC-RETURNCODE-N.

           IF SC-RETURNCODE-B2 NOT = 0 THEN
               SET SORTCALL-TEST-FAILED TO TRUE
               DISPLAY 
                   "*** FAILED *** SORTCALL TEST " SORTCALL-TEST-ID
                   " FILE [" SC-OUTFILE 
                   "][" SC-OUTLIB 
                   "][" SC-OUTVOL 
                   "] SORTCALL RC= " SC-RETURNCODE-N
           END-IF.


       SORTCALL-STD-PARMS.
           MOVE SPACES     TO SC-PARMS.
           MOVE SORTCALL-INFILE   TO SC-INFILE.
           MOVE "LIBSAM"   TO SC-INLIB.
           MOVE "VOLOUT"   TO SC-INVOL.
           MOVE SC-INFILE  TO SC-OUTFILE.
           MOVE "SORTED"   TO SC-OUTLIB.
           MOVE SC-INVOL   TO SC-OUTVOL.
           MOVE 1          TO SC-POS1.
           MOVE 10         TO SC-LEN1.
           MOVE "C"        TO SC-TYPE1.
           MOVE "D"        TO SC-ORDER1.
       
      ************************************             
       SORTCALL-AUTOTEST-END.
      ************************************             
           EXIT.

      ******************************************************************

       INIT-PROGRESS-SCREEN.

	   MOVE PROGRESS-LOCK-ORDER-AREA TO 
	       ORDER-AREA OF PROGRESS-SCREEN.
	   MOVE SPACES TO PROGRESS-ROWS.

           DISPLAY AND READ PROGRESS-SCREEN ON CRT.

	   MOVE 1 TO PROGRESS-ROW-NUM.
	   MOVE SPACES TO NEXT-PROGRESS-ROW.

       WRITE-NEXT-PROGRESS-ROW.

           MOVE NEXT-PROGRESS-ROW TO PROGRESS-ROW (PROGRESS-ROW-NUM).
	   MOVE PROGRESS-LOCK-ORDER-AREA TO 
	       ORDER-AREA OF PROGRESS-SCREEN.
           DISPLAY AND READ PROGRESS-SCREEN ON CRT.
	   
	   ADD 1 TO PROGRESS-ROW-NUM.
	   MOVE SPACES TO NEXT-PROGRESS-ROW.

       UNLOCK-AND-READ-PROGRESS-SCRN.

	   MOVE PROGRESS-UNLOCK-ORDER-AREA TO 
	       ORDER-AREA OF PROGRESS-SCREEN.
           DISPLAY AND READ PROGRESS-SCREEN ON CRT.

      ******************************************************************
	   
           
387800
387900******************************************************************
388000 DO-SET-TEST.
388100     DISPLAY AND READ SET-SCREEN ON CRT ONLY PFKEYS 16, 1, 2.
388200
388300     IF      PF-KEY = "01" THEN PERFORM DO-SET-TEST-1
388400     ELSE IF PF-KEY = "02" THEN PERFORM DO-SET-TEST-2.
388500
388600     IF PF-KEY NOT = "16" THEN GO TO DO-SET-TEST.
388700
388800 DO-SET-TEST-1.
388900     CALL "SET" USING SET-KW, SET-VALX.
389000
389100 DO-SET-TEST-2.
389200     CALL "SET" USING SET-KW, SET-VALB.
389300
389400
389500******************************************************************
389600
389700 DO-RENAME-TEST.
389800
389900     MOVE "SPECIFIY PARAMETERS FOR RENAME" TO RENAME-TITLE.
390000     MOVE LOWER-FAC TO FAC OF RENAME-EXTENTION.
390100     DISPLAY AND READ RENAME-SCREEN ON CRT
390200         ONLY PFKEYS 16, 1, 2, 3, 8.
390300
390400     MOVE RENAME-RETURN-X TO RENAME-RETURN.
390500     MOVE RENAME-EXT TO RENAME-EXT-FULL.
390600     CALL "WSETFILEXT" USING RENAME-EXT-FULL.
390700
390800     IF PF-KEY = "01" THEN
390900         PERFORM DO-RENAME-TEST-F
391000     ELSE IF PF-KEY = "02" THEN
391100         PERFORM DO-RENAME-TEST-L
391200     ELSE IF PF-KEY = "03" THEN
391300         PERFORM DO-RENAME-TEST-G
391310     ELSE IF PF-KEY = "08" THEN
391320         PERFORM DO-AUTO-RENAME-TEST
391400     ELSE IF PF-KEY NOT = "16" THEN
391500         MOVE 1 TO BELL-PAUSE-TIME
391600         CALL "BELL" USING BELL-PAUSE-TIME-LEN
391700         MOVE 44 TO RENAME-RETURN-2.
391800
391900     MOVE "RENAME IS COMPLETE" TO RENAME-TITLE.
392000     MOVE RENAME-RETURN-2 TO RENAME-RETURN-X.
392100     IF PF-KEY NOT = "16" THEN GO TO DO-RENAME-TEST.
392200
392300 DO-RENAME-TEST-F.
392400
392500     MOVE "F" TO RENAME-TYPE.
392600     CALL "RENAME" USING RENAME-TYPE, RENAME-FILE,
392700                         RENAME-LIB, RENAME-VOL,
392800                         RENAME-NEW-FILE,RENAME-BYPASS,
392900                         RENAME-ACCESS, RENAME-OPEN,
393000                         RENAME-RETURN.
393010     MOVE RENAME-RETURN-2 TO RENAME-RETURN-X.
393100
393200 DO-RENAME-TEST-L.
393300
393400     MOVE "L" TO RENAME-TYPE.
393500     CALL "RENAME" USING RENAME-TYPE, RENAME-FILE,
393600                         RENAME-LIB, RENAME-VOL,
393700                         RENAME-NEW-LIB,RENAME-BYPASS,
393800                         RENAME-ACCESS, RENAME-OPEN,
393900                         RENAME-RETURN.
393910     MOVE RENAME-RETURN-2 TO RENAME-RETURN-X.
394000
394100 DO-RENAME-TEST-G.
394200
394300     MOVE "G" TO RENAME-TYPE.
394400     CALL "RENAME" USING RENAME-TYPE, RENAME-FILE,
394500                         RENAME-LIB, RENAME-VOL,
394600                         RENAME-NEW-FILE, RENAME-NEW-LIB,
394700                         RENAME-BYPASS, RENAME-ACCESS,
394800                         RENAME-OPEN, RENAME-RETURN.
394810     MOVE RENAME-RETURN-2 TO RENAME-RETURN-X.
394811******************************************************************
394812 DO-AUTO-RENAME-TEST.
394813     MOVE 0 TO RENAME-FAILED.
394814
394815     MOVE "SEQFILE1" TO RENAME-FILE.
394816     MOVE "LIBOUT"   TO RENAME-LIB.
394817     MOVE "VOLOUT"   TO RENAME-VOL.
394818     MOVE "RN1"      TO RENAME-NEW-FILE.
394819     PERFORM DO-RENAME-TEST-F.
394820     IF RENAME-RETURN-X NOT = 0 THEN
394821         ADD 1 TO RENAME-FAILED
394822         DISPLAY "RENAME " RENAME-TYPE
394823             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394824             " NEW=" RENAME-NEW-FILE
394825             " RC=" RENAME-RETURN-X
394826             " *** FAILED ***".
394827
394828     PERFORM DO-RENAME-TEST-F.
394829     IF RENAME-RETURN-X NOT = 20 THEN
394830         ADD 1 TO RENAME-FAILED
394831         DISPLAY "RENAME " RENAME-TYPE
394832             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394833             " NEW=" RENAME-NEW-FILE
394834             " RC=" RENAME-RETURN-X
394835             " *** FAILED ***".
394836
394837     MOVE "RN1"      TO RENAME-FILE.
394838     MOVE "LIBOUT"   TO RENAME-LIB.
394839     MOVE "VOLOUT"   TO RENAME-VOL.
394840     MOVE " "        TO RENAME-NEW-FILE.
394841     PERFORM DO-RENAME-TEST-F.
394842     IF RENAME-RETURN-X NOT = 56 THEN
394843         ADD 1 TO RENAME-FAILED
394844         DISPLAY "RENAME " RENAME-TYPE
394845             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394846             " NEW=" RENAME-NEW-FILE
394847             " RC=" RENAME-RETURN-X
394848             " *** FAILED ***".
394849
394850     MOVE "RN1"      TO RENAME-FILE.
394851     MOVE "LIBOUT"   TO RENAME-LIB.
394852     MOVE "VOLOUT"   TO RENAME-VOL.
394853     MOVE "RN2"      TO RENAME-NEW-FILE.
394854     MOVE "LIBRN"    TO RENAME-NEW-LIB.
394855     PERFORM DO-RENAME-TEST-G.
394856     IF RENAME-RETURN-X NOT = 0 THEN
394857         ADD 1 TO RENAME-FAILED
394858         DISPLAY "RENAME " RENAME-TYPE
394859             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394860             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394861             " RC=" RENAME-RETURN-X
394862             " *** FAILED ***".
394863     PERFORM DO-RENAME-TEST-G.
394864     IF RENAME-RETURN-X NOT = 20 THEN
394865         ADD 1 TO RENAME-FAILED
394866         DISPLAY "RENAME " RENAME-TYPE
394867             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394868             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394869             " RC=" RENAME-RETURN-X
394870             " *** FAILED ***".
394871
394872     MOVE " "        TO RENAME-FILE.
394873     MOVE "LIBRN"    TO RENAME-LIB.
394874     MOVE "VOLOUT"   TO RENAME-VOL.
394875     MOVE "LIBXX"    TO RENAME-NEW-LIB.
394876     PERFORM DO-RENAME-TEST-L.
394877     IF RENAME-RETURN-X NOT = 0 THEN
394878         ADD 1 TO RENAME-FAILED
394879         DISPLAY "RENAME " RENAME-TYPE
394880             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394881             " NEW=" RENAME-NEW-LIB
394882             " RC=" RENAME-RETURN-X
394883             " *** FAILED ***".
394884     PERFORM DO-RENAME-TEST-L.
394885     IF RENAME-RETURN-X NOT = 20 THEN
394886         ADD 1 TO RENAME-FAILED
394887         DISPLAY "RENAME " RENAME-TYPE
394888             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394889             " NEW=" RENAME-NEW-LIB
394890             " RC=" RENAME-RETURN-X
394891             " *** FAILED ***".
394892
394893     MOVE " "        TO RENAME-FILE.
394894     MOVE "LIBXX"   TO RENAME-LIB.
394895     MOVE "VOLOUT"   TO RENAME-VOL.
394896     MOVE " "        TO RENAME-NEW-FILE.
394897     MOVE "LIBRN"    TO RENAME-NEW-LIB.
394898     PERFORM DO-RENAME-TEST-G.
394899     IF RENAME-RETURN-X NOT = 0 THEN
394900         ADD 1 TO RENAME-FAILED
394901         DISPLAY "RENAME " RENAME-TYPE
394902             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394903             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394904             " RC=" RENAME-RETURN-X
394905             " *** FAILED ***".
394906     PERFORM DO-RENAME-TEST-G.
394907     IF RENAME-RETURN-X NOT = 20 THEN
394908         ADD 1 TO RENAME-FAILED
394909         DISPLAY "RENAME " RENAME-TYPE
394910             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394911             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394912             " RC=" RENAME-RETURN-X
394913             " *** FAILED ***".
394914
394915     MOVE "AAA"      TO RENAME-FILE.
394916     MOVE "LIBOUT"   TO RENAME-LIB.
394917     MOVE "VOLOUT"   TO RENAME-VOL.
394918     MOVE "XFILE"    TO RENAME-NEW-FILE.
394919     MOVE "LIBRN"    TO RENAME-NEW-LIB.
394920     PERFORM DO-RENAME-TEST-G.
394921     IF RENAME-RETURN-X NOT = 0 THEN
394922         ADD 1 TO RENAME-FAILED
394923         DISPLAY "RENAME " RENAME-TYPE
394924             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394925             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394926             " RC=" RENAME-RETURN-X
394927             " *** FAILED ***".
394928     PERFORM DO-RENAME-TEST-G.
394929     IF RENAME-RETURN-X NOT = 20 THEN
394930         ADD 1 TO RENAME-FAILED
394931         DISPLAY "RENAME " RENAME-TYPE
394932             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394933             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394934             " RC=" RENAME-RETURN-X
394935             " *** FAILED ***".
394936
394937     MOVE "BFILEX3"    TO RENAME-FILE.
394938     MOVE "LIBOUT"   TO RENAME-LIB.
394939     MOVE "VOLOUT"   TO RENAME-VOL.
394940     MOVE "XFILE"    TO RENAME-NEW-FILE.
394941     MOVE "LIBRN"    TO RENAME-NEW-LIB.
394942     PERFORM DO-RENAME-TEST-G.
394943     IF RENAME-RETURN-X NOT = 52 THEN
394944         ADD 1 TO RENAME-FAILED
394945         DISPLAY "RENAME " RENAME-TYPE
394946             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394947             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394948             " RC=" RENAME-RETURN-X
394949             " *** FAILED ***".
394950
394951     MOVE "RN2"        TO RENAME-FILE.
394952     MOVE "LIBRN"      TO RENAME-LIB.
394953     MOVE "VOLOUT"     TO RENAME-VOL.
394954     MOVE "SEQFILE1"   TO RENAME-NEW-FILE.
394955     MOVE "LIBOUT"     TO RENAME-NEW-LIB.
394956     PERFORM DO-RENAME-TEST-G.
394957     IF RENAME-RETURN-X NOT = 0 THEN
394958         ADD 1 TO RENAME-FAILED
394959         DISPLAY "RENAME " RENAME-TYPE
394960             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394961             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394962             " RC=" RENAME-RETURN-X
394963             " *** FAILED ***".
394964
394965     MOVE "XFILE"     TO RENAME-FILE.
394966     MOVE "LIBRN"     TO RENAME-LIB.
394967     MOVE "VOLOUT"    TO RENAME-VOL.
394968     MOVE "AAA"       TO RENAME-NEW-FILE.
394969     MOVE "LIBOUT"    TO RENAME-NEW-LIB.
394970     PERFORM DO-RENAME-TEST-G.
394971     IF RENAME-RETURN-X NOT = 0 THEN
394972         ADD 1 TO RENAME-FAILED
394973         DISPLAY "RENAME " RENAME-TYPE
394974             " OLD=" RENAME-FILE, RENAME-LIB, RENAME-VOL,
394975             " NEW=" RENAME-NEW-FILE RENAME-NEW-LIB
394976             " RC=" RENAME-RETURN-X
394977             " *** FAILED ***".
394978
394979* END AUTO TEST
394980     IF RENAME-FAILED = 0 THEN
394981         DISPLAY "RENAME *** PASSED *** THE AUTOTESTS"
394982     ELSE
394983         DISPLAY "RENAME *** FAILED *** "
394984             RENAME-FAILED " TESTS".
394985
394986
394987******************************************************************
395000
395100 DO-FILECOPY-TEST.
395200
395300     MOVE "SPECIFIY PARAMETERS FOR FILECOPY" TO RENAME-TITLE.
395400     DISPLAY AND READ FILECOPY-SCREEN ON CRT PFKEYS 16.
395500
395600     MOVE FILECOPY-RETURN-X TO FILECOPY-RETURN.
395700
395800     IF PF-KEY = "00" THEN
395900         PERFORM DO-FILECOPY-TEST-0
396000         MOVE "FILECOPY IS COMPLETE" TO FILECOPY-TITLE
396100         MOVE FILECOPY-RETURN-2 TO FILECOPY-RETURN-X
396200         IF PF-KEY NOT = "16" THEN GO TO DO-FILECOPY-TEST.
396300
396400 DO-FILECOPY-TEST-0.
396500
396600     IF FILECOPY-NVOL = "      " AND
396700        FILECOPY-NLIB = "        " THEN
396800        PERFORM DO-FILECOPY-1
396900     ELSE IF FILECOPY-NVOL = "      " THEN
397000        PERFORM DO-FILECOPY-2
397100     ELSE
397200        PERFORM DO-FILECOPY-3.
397300
397400 DO-FILECOPY-1.
397500
397600     CALL "FILECOPY" USING
397700           FILECOPY-OFILE, FILECOPY-OLIB, FILECOPY-OVOL,
397800           FILECOPY-NFILE,
397900           FILECOPY-RETURN.
398000
398100 DO-FILECOPY-2.
398200
398300     CALL "FILECOPY" USING
398400           FILECOPY-OFILE, FILECOPY-OLIB, FILECOPY-OVOL,
398500           FILECOPY-NFILE, FILECOPY-NLIB,
398600           FILECOPY-RETURN.
398700
398800 DO-FILECOPY-3.
398900
399000     CALL "FILECOPY" USING
399100           FILECOPY-OFILE, FILECOPY-OLIB, FILECOPY-OVOL,
399200           FILECOPY-NFILE, FILECOPY-NLIB, FILECOPY-NVOL,
399300           FILECOPY-RETURN.
399400
399500******************************************************************
399501
399502 DO-COBLINK.
399503     DISPLAY AND READ COBLINK-SCREEN ON CRT PFKEYS 16.
399504     IF PF-KEY NOT = "16"
399505         CALL "COBLINK" USING SAMPLE-PROG
399506         GO TO DO-COBLINK.
399507
399508******************************************************************
399509 SOFTLINK-HARDLINK-TESTS.
399510*    First call is to find out what the link type was.
399511     Call "USESOFTLINK" Using WISPLINK-TYPE.
399512     IF WISP-SOFTLINK THEN
399513*        Was using SOFTLINK, switch to HARDLINK then test.
399514         Call "USEHARDLINK" Using WISPLINK-TYPE
399515         Call "USEHARDLINK" Using WISPLINK-TYPE
399516         if WISP-HARDLINK THEN
399517             DISPLAY "Switched from SOFTLINK to HARDLINK."
399518         else
399519             DISPLAY
399520             "Unable to switch to HARDLINK, using SOFTLINK"
399521         END-IF
399522     else
399523*        Was using HARDLINK, see if we are now SOFTLINK.
399524         Call "USESOFTLINK" Using WISPLINK-TYPE
399525         if WISP-SOFTLINK THEN
399526             DISPLAY "Switched from HARDLINK to SOFTLINK."
399527         else
399528             DISPLAY
399529             "Unable to switch to SOFTLINK, using HARDLINK"
399530         END-IF
399531     END-IF.
399532
399533
399534******************************************************************
399600* ALL DONE.
399700******************************************************************
399800
399900 EXIT-PROGRAM.
400000     EXIT PROGRAM.
400100
400200 STOP-RUN.
400300     STOP RUN.
