000001*.CAPON
000002*.REPLACE N0012DISPLAYYEAR BY NO
000003******************************************************************
000004*                                                                *
000005*    QASYS99#S - General Foreground Fatal Error Display           *
000006*                                                                *
000007*    This program will display on the screen all the data fields *
000008*    passed to it in the STDERRBL data block of error parameters.*
000009*    The screen can only be cleared if PF32 is pressed. "SCREEN" *
000010*    subroutine is called to print the error screen.             *
000011*                                                                *
000012*    Inputs:   Error block parameters set by calling program     *
000013*                                                                *
000014*    Output:   Call is made to Screen Print Routine to create    *
000015*              a printed copy of the screen                      *
000016*                                                                *
000017*    NOTE:     The Object for this program should be stored in   *
000018*              USERSUBS library so that the Linker in the CAP    *
000019*              compile procedure will pick it up automatically.  *
000030******************************************************************
000031
000032 IDENTIFICATION DIVISION.
000033*
000034 PROGRAM-ID.   QASYS99.
000035*
000036 AUTHOR.       John Seinen.
000037 DATE-WRITTEN. April 25  1985.
000038*
000039 ENVIRONMENT DIVISION.
000040 CONFIGURATION SECTION.
000040*
000106*.REPLACEOFF
000109 FIGURATIVE-CONSTANTS.
000109     Z1-FIG-CON-84         IS "84"
000109     Z1-FIG-CON-85         IS "85"
000109     Z1-FIG-CON-94         IS "94"
000109     Z1-FIG-CON-95         IS "95"
000109     Z1-FIG-CON-AD         IS "AD"
000109     Z1-NUMERIC-ERROR      IS "3F"
000109     DEGEN-PROTECTED  IS "04"
000109     DEGEN-DIM        IS "08"
000109     DEGEN-SOLID      IS "0B"
000109     DEGEN-FLASHING   IS "10"
000109     DEGEN-HIPRO      IS "84"
000109     DEGEN-LOPRO      IS "8C"
000109     DEGEN-FLPRO      IS "94"
000109     DEGEN-HIMODUPRUL IS "A1"
000109     DEGEN-HIMODUL    IS "A0"
000109     DEGEN-HIMODNUMUL IS "A2"
000112     SYS99R-SIZEERROR    IS "2A"
000109     .
000106 INPUT-OUTPUT SECTION.
000106 FILE-CONTROL.
000112*.BREAK SYS99R-SELECT-PRINT-FILE-DEFAULT
000112*.DEFAULT
000112     SELECT SYS99R
000112         ASSIGN TO "SYS99R" "PRINTER"
000112          ; FILE STATUS IS SYS99R-FILESTATUS.
000112*.END-DEFAULT
000041 DATA DIVISION.
000042*
000106 FILE SECTION.
000112 FD  SYS99R
000112     ; LABEL RECORDS ARE STANDARD
000112     ; VALUE OF
000112          FILENAME    SYS99R-FILENAME
000112          SPACE       SYS99R-SPACE
000112          LIBRARY     SYS99R-LIBRARY
000112          VOLUME      SYS99R-VOLUME
000112          .
000112 01  SYS99R-FDREC                 PIC X(80).
000043 WORKING-STORAGE SECTION.
000109*.BINARY
000109 01  Z1-SCREENLINES USAGE BINARY VALUE 24.
000109 01  Z1-SFIRST     USAGE BINARY VALUE 1.
000109 01  Z1-SLAST       USAGE BINARY VALUE 24.
000112 77  SYS99R-TOTLEVEL               BINARY.
000112 77  SYS99R-TOTLEVELPLUS1          BINARY.
000112 77  SYS99R-BREAKLEVEL   BINARY VALUE 1.
000112 77  SYS99R-WI                       BINARY.
000112 77  SYS99R-ADDLEVEL                 BINARY VALUE 1.
000112* SYS99R-ADDLEVEL IS THE LEVEL OF TOTAL TO WHICH THE CURRENT
000112*  DETAIL LINE IS TO BE ACCUMULATED.
000112 77  SYS99R-ADDLEVEL-SAVE            BINARY VALUE 1.
000112* SYS99R-ADDLEVEL-SAVE IS THE LEVEL OF TOTAL TO WHICH THE
000112*  PREVIOUS DETAIL LINE WAS ACCUMULATED.
000112 77  SYS99R-NADVANCE-SAVE            BINARY.
000112 77  SYS99R-NADVANCE        BINARY VALUE 1.
000112 77  SYS99R-LINECNT         BINARY VALUE 1.
000112 77  SYS99R-LINECNT-WORK    BINARY.
000112 77  SYS99R-PAGELENGTH      BINARY VALUE 60.
000109*.END-BINARY
000044 01  SYS99-KEY-HEX                  PIC X(70) VALUE SPACES.
000045 01  SYS99-RECORD-HEX.
000046     05 SYS99-RECORD-HEX-1          PIC X(70) VALUE SPACES.
000047     05 SYS99-RECORD-HEX-2          PIC X(70) VALUE SPACES.
000048 01  SYS99-LENGTH-35-HEX.
000049     05 FILLER                      BINARY    VALUE ZERO.
000050     05 FILLER                      BINARY    VALUE 35.
000051 01  SYS99-LENGTH-70-HEX.
000052     05 FILLER                      BINARY    VALUE ZERO.
000053     05 FILLER                      BINARY    VALUE 70.
000055 01  SYS99-TASK-TYPE                PIC X     VALUE SPACE.
000057 01  SYS99-USERID-WRK               PIC X(3)  VALUE SPACE.
000058 01  SYS99-USER-NAME-WRK            PIC X(24) VALUE SPACE.
000059 01  SYS99-DATE-WRK                 PIC 9(6)  VALUE ZERO.
000060 01  SYS99-TIME-ACCEPT-WRK          PIC 9(9)  VALUE ZERO.
000061 01  SYS99-TIME-WRK                 PIC 99V99 VALUE ZERO.
000062
000063******************************************************************
000064
000109 01  Z1-REC.
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(56) VALUE
000109     "********************************************************".
000109     05 FILLER PIC X(23) VALUE
000109     "***********************".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(50) VALUE
000109     "* SYS99#Z1               MUNIFAX Error Diagnostics".
000109     05 FILLER PIC X(28) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(44) VALUE
000109     "*   The following information may be useful:".
000109     05 FILLER PIC X(34) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(13) VALUE
000109     "*    Program:".
000109     05 FILLER PIC X(28) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(16) VALUE
000109     "Program Context:".
000109     05 FILLER PIC X(21) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(15) VALUE
000109     "*    File Name:".
000109     05 FILLER PIC X(26) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(12) VALUE
000109     "File Status:".
000109     05 FILLER PIC X(25) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(18) VALUE
000109     "*    File Library:".
000109     05 FILLER PIC X(23) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(14) VALUE
000109     "File Function:".
000109     05 FILLER PIC X(23) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(17) VALUE
000109     "*    File Volume:".
000109     05 FILLER PIC X(61) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(52) VALUE
000109     "*    Key Value:                          Key Number:".
000109     05 FILLER PIC X(26) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(17) VALUE
000109     "*    File Record:".
000109     05 FILLER PIC X(61) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(13) VALUE
000109     "*    Message:".
000109     05 FILLER PIC X(65) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(1) VALUE
000109     "*".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(56) VALUE
000109     "*          Press (32) to Print this screen and Exit prog".
000109     05 FILLER PIC X(23) VALUE
000109     "ram                   *".
000109     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000109     05 FILLER PIC X(56) VALUE
000109     "********************************************************".
000109     05 FILLER PIC X(23) VALUE
000109     "***********************".
000109*.BREAK Z1-SCREENREC-REDEFN
000109 01  FILLER REDEFINES Z1-REC.
000109     05 Z1-ROWX OCCURS 24.
000109        10 Z1-COLX PIC X OCCURS 80.
000109 01  FILLER REDEFINES Z1-REC.
000109     05 FILLER PIC X(428).
000109     05 Z1-G-001 PIC X(8).
000109     05 FILLER PIC X(28).
000109     05 Z1-H-001 PIC X(8).
000109     05 FILLER PIC X(36).
000109     05 Z1-A-001 PIC X(8).
000109     05 FILLER PIC X(28).
000109     05 Z1-D-001 PIC X(2).
000109     05 FILLER PIC X(42).
000109     05 Z1-B-001 PIC X(8).
000109     05 FILLER PIC X(28).
000109     05 Z1-K-001 PIC X(3).
000109     05 FILLER PIC X(41).
000109     05 Z1-C-001 PIC X(6).
000109     05 FILLER PIC X(110).
000109     05 Z1-L-001 PIC X(2).
000109     05 FILLER PIC X(20).
000109     05 Z1-I-001 PIC X(70).
000109     05 FILLER PIC X(10).
000109     05 Z1-69-001 PIC X(70).
000109     05 FILLER PIC X(90).
000109     05 Z1-J-001 PIC X(70).
000109     05 FILLER PIC X(10).
000109     05 Z1-6A-001 PIC X(70).
000109     05 FILLER PIC X(10).
000109     05 Z1-6B-001 PIC X(70).
000109     05 FILLER PIC X(90).
000109     05 Z1-E-001 PIC X(70).
000109     05 FILLER PIC X(10).
000109     05 Z1-F-001 PIC X(70).
000109     05 FILLER PIC X(26).
000109     05 Z1-78-001 PIC X(39).
000109     05 FILLER PIC X(40).
000109     05 Z1-7A-001 PIC X(41).
000109     05 FILLER PIC X(21).
000109     05 Z1-79-001 PIC X(74).
000109     05 FILLER PIC X(163).
000109 01  Z1-SEQS.
000109     05 Z1-A-SEQ PIC 999 VALUE 1.
000109     05 Z1-B-SEQ PIC 999 VALUE 2.
000109     05 Z1-C-SEQ PIC 999 VALUE 3.
000109     05 Z1-D-SEQ PIC 999 VALUE 4.
000109     05 Z1-E-SEQ PIC 999 VALUE 5.
000109     05 Z1-F-SEQ PIC 999 VALUE 6.
000109     05 Z1-G-SEQ PIC 999 VALUE 7.
000109     05 Z1-H-SEQ PIC 999 VALUE 8.
000109     05 Z1-I-SEQ PIC 999 VALUE 9.
000109     05 Z1-J-SEQ PIC 999 VALUE 10.
000109     05 Z1-K-SEQ PIC 999 VALUE 11.
000109     05 Z1-L-SEQ PIC 999 VALUE 12.
000109     05 Z1-69-SEQ PIC 999 VALUE 13.
000109     05 Z1-6A-SEQ PIC 999 VALUE 14.
000109     05 Z1-6B-SEQ PIC 999 VALUE 15.
000109     05 Z1-78-SEQ PIC 999 VALUE 16.
000109     05 Z1-79-SEQ PIC 999 VALUE 17.
000109     05 Z1-7A-SEQ PIC 999 VALUE 18.
000109 01  Z1-FIELD-CONTROLS-INIT.
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0007028009X00+A".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0008028009X00+B".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0009028007X00+C".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0007064003X00+D".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-84.
000109       10 FILLER PIC X(15) VALUE "0018006071X00+E".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-84.
000109       10 FILLER PIC X(15) VALUE "0019006071X00+F".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0006028009X00+G".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0006064009X00+H".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0011006071X00+I".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0014006071X00+J".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0008064004X00+K".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0010064003X00+L".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0012006071X00+i".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0015006071X00+j".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-85.
000109       10 FILLER PIC X(15) VALUE "0016006071X00+k".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-94.
000109       10 FILLER PIC X(15) VALUE "0020022040X00+x".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-AD.
000109       10 FILLER PIC X(15) VALUE "0022003075X00+y".
000109       10 FILLER PIC X VALUE Z1-FIG-CON-95.
000109       10 FILLER PIC X(15) VALUE "0021021042X00+z".
000109 01  Z1-FIELD-CONTROLS REDEFINES Z1-FIELD-CONTROLS-INIT.
000109     05 Z1-FIELD-CONTROL OCCURS 18.
000109        10 Z1-FAC       PIC X.
000109        10 Z1-OBJECT    PIC X.
000109        10 Z1-COORD-ROW PIC 999.
000109        10 Z1-COORD-COL PIC 999.
000109        10 Z1-LENGTH    PIC 999.
000109        10 Z1-SIGN      PIC X.
000109        10 Z1-DECIMALS  PIC S99            SIGN IS TRAILING
000109           SEPARATE CHARACTER.
000109        10 Z1-TAG       PIC X.
000109 01  Z1-NFIELDS PIC S9(3) USAGE COMP VALUE 18.
000109 01  Z1-NROWS PIC S9(3) USAGE COMP VALUE 24.
000109 01  Z1-NCOLS PIC S9(3) USAGE COMP VALUE 80.
000109 01  Z1-WARNFLAGS.
000109     05 FILLER PIC X.
000109 01  Z1-WARNSAVES.
000109     05 FILLER PIC X.
000109 01  Z1-PFK-TABLE-INIT PIC X(34)
000109     VALUE "BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBXB".
000109 01  Z1-PFK-TABLE REDEFINES Z1-PFK-TABLE-INIT.
000109     05 Z1-PFK PIC X OCCURS 34.
000109 01  Z1-MSG-FLAGS-INIT.
000109     05 Z1-MSG-FLAGS-50-1 PIC X(50) VALUE
000109          "NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000109     05 Z1-MSG-FLAGS-50-2 PIC X(50) VALUE
000109          "NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000109 01  Z1-MSG-FLAGS REDEFINES Z1-MSG-FLAGS-INIT.
000109     05 Z1-MSG-FLAG PIC X OCCURS 100.
000109 01  FILLER REDEFINES Z1-MSG-FLAGS-INIT.
000109     05 Z1-MSG-FLAGS-50 PIC X(50) OCCURS 2.
000109 77  Z1-VALIDATEFLAG PIC X VALUE "Y". % "Y" = perform edit
000109                                          %       checks
000109 77  Z1-RETURNFLAG PIC X.
000109 77  Z1-DUMMY     PIC X.  % Dummy variable to pad CALL
000109 77  Z1-SEVERITY PIC X.
000109 77  Z1-STATUS PIC X.
000109*  Information about current cursor location
000109 01  Z1-CURRENT-FIELD.
000109     05  Z1-FIELD-INDEX  BINARY.
000109     05  Z1-OCCURRENCE   BINARY.
000109     05  Z1-FTAG         PIC X.  % Field tag, or blank
000109 77  Z1-FOUND            PIC X.
000109 01  Z1-MSG-AND-FAC.
000109     05 Z1-MSG-FAC PIC X VALUE DEGEN-FLPRO.
000109     05 Z1-MSG VALUE SPACES.
000109        10  FILLER           PIC X(74).
000109        10  Z1-MSGEND    PIC X(6).
000109 01  Z1-MSG-I PIC S9(3) COMP.
000109 01  Z1-MSG-LINENO PIC S9(3) COMP VALUE ZERO.
000109 01  Z1-FINDROWFLAG PIC X VALUE SPACES.
000109* Z1-CYCLE lets us know if warnings have been displayed,
000109* what FAC manipulation must be done for erroneous fields.
000109 77  Z1-CYCLE PIC S9(3) COMP.
000109 77  Z1-ROW-I PIC S9(3) COMP.
000109 77  Z1-COL-I PIC S9(3) COMP.
000109 77  Z1-FIELD-I PIC S9(3) COMP.
000109 01  Z1-LINE            BINARY VALUE ZERO.
000109 01  Z1-POS             BINARY VALUE 1.
000109 01  Z1-SIZE            BINARY VALUE 80.
000109 77  Z1-FN              PIC XX.
000109 77  Z1-BEEPFLAG        PIC X         VALUE SPACE.
000109 77  Z1-BEEP            PIC X         VALUE "B".
000109 01  Z1-ROW             BINARY VALUE ZERO.
000109 01  Z1-COL             BINARY VALUE ZERO.
000109 01  Z1-PF              PIC 99 VALUE 35.
000109* These are the generic variables that all CAPscreen programs use
000109 01  DEGEN-ALPHA PIC X(16).     % alphanumeric screen
000109                                 % variable manipulator
000109 01  FILLER REDEFINES DEGEN-ALPHA.
000109     05 DEGEN-ALPHA-16 PIC X OCCURS 16.
000109 01  DEGEN-FIELD-CONTROL.       % screen variable attributes
000109     05 DEGEN-FAC PIC X.
000109     05 DEGEN-OBJECT    PIC X.
000109     05 DEGEN-COORD-ROW PIC 999.
000109     05 DEGEN-COORD-COL PIC 999.
000109     05 DEGEN-LENGTH    PIC 999.
000109     05 DEGEN-SIGN      PIC X.
000109     05 DEGEN-DECIMALS  PIC S99
000109                      SIGN IS TRAILING SEPARATE CHARACTER.
000109     05 DEGEN-TAG       PIC X.
000109*  CHANGED FROM PIC S9(10)V9(5) TO ACCOMODATE WORK ORDERS
000109*  CHANGED FROM PIC S9(12)V9(3) TO ACCOMODATE PAYROLL - SO THERE
000109 77  DEGEN-NUMERIC PIC S9(12)V9(4).      % numeric screen
000109                                         % variable manipulator
000109 77  DEGEN-I PIC S9(5) COMP VALUE ZERO.
000109 77  DEGEN-J PIC S9(5) COMP VALUE ZERO.
000109 77  DEGEN-K PIC S9(5) COMP VALUE ZERO.
000109 77  DEGEN-L PIC S9(5) COMP VALUE ZERO.
000109 77  DEGEN-F1 PIC S9(5) COMP VALUE ZERO.
000109 77  DEGEN-F2 PIC S9(5) COMP VALUE ZERO.
000109*STATUS: "N" = invalid value entered in numeric screen variable
000109*        " " = numeric screen variable valid
000109 77  DEGEN-STATUS               PIC X.
000109 77  DEGEN-RETURN-CODE PIC 9. % return code for bad entries in
000109                               % numeric screen variables - for
000109                               % meaning see following messages
000109 01  DEGEN-ERROR-MESSAGES.
000109     05 FILLER PIC X(30) VALUE "A number is required.         ".
000109     05 FILLER PIC X(30) VALUE "negative value not acceptable ".
000109     05 FILLER PIC X(30) VALUE "decimal point not acceptable  ".
000109     05 FILLER PIC X(30) VALUE "entry too large for this field".
000109 01  FILLER REDEFINES DEGEN-ERROR-MESSAGES.
000109     05 DEGEN-ERROR-MESSAGE PIC X(30) OCCURS 4.
000109 77  DEGEN-EDITFLAG PIC X. % 0 = error in last edit checked item
000109                            % 1 = no error
000109 77  DEGEN-WORKX    PIC X(79)     VALUE SPACES.
000109                     % holding variable for alpha screen variables
000109                     % when they are checked for errors.
000109 77  DEGEN-WORKN    PIC S9(12)V9(6) COMP VALUE ZERO.
000109                     % numeric analogue for DEGEN-WORKX
000109*Next variable is used as an intermediary when transferring values
000109*from BINARY variables to COMP variables which have decimals, and
000109*vice versa (in order to make up for weakness in compiler).
000109 77  DEGEN-WORK-INTEGER     PIC S9(12) COMP VALUE ZERO.
000109*LASTIMAGE holds name of most recently displayed screen.
000109 77  DEGEN-LASTIMAGE PIC X(6) VALUE SPACES.
000109*STRING usersub variables - for manipulating background strings
000109 01  DEGEN-STR-USERSUB-VARIABLES.
000109     05 DEGEN-STR-QUOTE-MV PIC XX VALUE "MV".
000109     05 DEGEN-STR-QUOTE-MI PIC XX VALUE "MI".
000109     05 DEGEN-STR-INPUT-LENGTH.
000109        10 FILLER                      BINARY VALUE 0.
000109        10 DEGEN-STR-INPUT-LENGTH-LOW BINARY VALUE 1.
000109     05 DEGEN-STR-INPUT-OFFSET.
000109        10 FILLER                      BINARY VALUE 0.
000109        10 DEGEN-STR-INPUT-OFFSET-LOW BINARY VALUE 0.
000109     05 DEGEN-STR-OUTPUT-OFFSET.
000109        10 FILLER                       BINARY VALUE 0.
000109        10 DEGEN-STR-OUTPUT-OFFSET-LOW BINARY VALUE 0.
000109*BACKGROUND-STRING holds pieces of background text.
000109 01  DEGEN-BACKGROUND-STRING PIC X(60).
000109*BACKGROUND-X is required for compatibility with old #X files
000109 01  FILLER REDEFINES DEGEN-BACKGROUND-STRING.
000109     05 DEGEN-BACKGROUND-X PIC X OCCURS 60.
000109 77  DEGEN-BACKGROUND-LENGTH PIC 999. % Length of above
000109 77  DEGEN-BACKGROUND-I PIC S9(3) COMP.
000109 01  DEGEN-PAUSE-LENGTH.
000109     05  DEGEN-PAUSE1                  BINARY VALUE 0.
000109     05  DEGEN-PAUSE-TIME              BINARY VALUE 200.
000109*.BREAK DEGEN-SCREENREC
000109
000109******************************************************************
000109*                                                                *
000109*  PARAMETERS FOR USERSUBS "SCREEN" CALL ROUTINE TO PRINT        *
000109*  THE USER PROGRAM SCREEN                                       *
000109*                                                                *
000109******************************************************************
000109
000109 01  SCRPRT-WORKSTATION-STATUS        PIC X(01) VALUE "C".
000109
000109 01  SCRPRT-ID                        PIC X(02) VALUE "ID".
000109
000109 01  SCRPRT-UFB-ADDRESS               PIC X(02) VALUE SPACES.
000109
000109 01  SCRPRT-PRINT-TYPE                PIC X(01) VALUE "P".
000109
000109 01  SCRPRT-PRINT-FILE.
000109     05   SCRPRT-FILE-NAME.
000109          10   SCRPRT-NAME-A          PIC X(01) VALUE SPACE.
000109          10   SCRPRT-NAME-B          PIC X(03) VALUE SPACE.
000109          10   SCRPRT-NAME-C          PIC X(01) VALUE SPACE.
000109          10   SCRPRT-NAME-D          PIC X(03) VALUE SPACE.
000109     05   SCRPRT-LIB-NAME.
000109          10   SCRPRT-LIB-A           PIC X(03) VALUE SPACE.
000109          10   SCRPRT-LIB-B           PIC X(05) VALUE SPACE.
000109     05   SCRPRT-VOL-NAME             PIC X(06) VALUE SPACE.
000109
000109 01  SCRPRT-BELL-TIME.
000109     05  FILLER                        BINARY    VALUE ZERO.
000109     05  FILLER                        BINARY    VALUE 1.
000109
000112 01  SYS99R-REC PIC X(80) VALUE SPACES.
000112 01  SYS99R-DE-DE001 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(17).
000112     05  SYS99R-DE-DE001-001 PIC X(003).
000112     05  FILLER PIC X(5).
000112     05  SYS99R-DE-DE001-002 PIC X(024).
000112 01  SYS99R-DE-DE002 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(17).
000112     05  SYS99R-DE-DE002-A001 PIC X(6).
000112     05  SYS99R-DE-DE002-001 REDEFINES
000112       SYS99R-DE-DE002-A001 PIC 9(6).
000112     05  FILLER PIC X(7).
000112     05  SYS99R-DE-DE002-A002 PIC X(5).
000112     05  SYS99R-DE-DE002-002 REDEFINES
000112       SYS99R-DE-DE002-A002 PIC 99.99.
000112 01  SYS99R-DE-DE003 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE004 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE005 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE006 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE007 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE008 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(29).
000112     05  SYS99R-DE-DE008-001 PIC X(008).
000112     05  FILLER PIC X(27).
000112     05  SYS99R-DE-DE008-002 PIC X(008).
000112 01  SYS99R-DE-DE009 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(29).
000112     05  SYS99R-DE-DE009-001 PIC X(008).
000112     05  FILLER PIC X(27).
000112     05  SYS99R-DE-DE009-002 PIC X(002).
000112 01  SYS99R-DE-DE010 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(29).
000112     05  SYS99R-DE-DE010-001 PIC X(008).
000112     05  FILLER PIC X(27).
000112     05  SYS99R-DE-DE010-002 PIC X(003).
000112 01  SYS99R-DE-DE011 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(29).
000112     05  SYS99R-DE-DE011-001 PIC X(006).
000112 01  SYS99R-DE-DE012 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(64).
000112     05  SYS99R-DE-DE012-001 PIC X(002).
000112 01  SYS99R-DE-DE013 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(7).
000112     05  SYS99R-DE-DE013-001 PIC X(070).
000112 01  SYS99R-DE-DE014 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(7).
000112     05  SYS99R-DE-DE014-001 PIC X(070).
000112 01  SYS99R-DE-DE015 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE016 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(7).
000112     05  SYS99R-DE-DE016-001 PIC X(070).
000112 01  SYS99R-DE-DE017 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(7).
000112     05  SYS99R-DE-DE017-001 PIC X(070).
000112 01  SYS99R-DE-DE018 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(7).
000112     05  SYS99R-DE-DE018-001 PIC X(070).
000112 01  SYS99R-DE-DE019 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE020 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(7).
000112     05  SYS99R-DE-DE020-001 PIC X(070).
000112 01  SYS99R-DE-DE021 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X(7).
000112     05  SYS99R-DE-DE021-001 PIC X(070).
000112 01  SYS99R-DE-DE022 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE023 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE024 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE025 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-DE-DE026 REDEFINES SYS99R-REC.
000112     05  FILLER PIC X.
000112 01  SYS99R-TITLEREC PIC X(80) VALUE SPACES.
000112 01  SYS99R-DE-DE001-LITERALS.
000112  05 FILLER PIC X(23) VALUE " Background User      -".
000112 01  SYS99R-DE-DE002-LITERALS.
000112  05 FILLER PIC X(29) VALUE "            Date         Time".
000112 01  SYS99R-DE-DE003-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *****************************".
000112  05 FILLER PIC X(30) VALUE "******************************".
000112  05 FILLER PIC X(20) VALUE "********************".
000112 01  SYS99R-DE-DE004-LITERALS.
000112  05 FILLER PIC X(30) VALUE " * SYS99                  MUNI".
000112  05 FILLER PIC X(30) VALUE "FAX Error Diagnostics".
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE005-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE006-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *    The following informatio".
000112  05 FILLER PIC X(30) VALUE "n may be useful:".
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE007-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE008-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *     Program:".
000112  05 FILLER PIC X(30) VALUE "             Program Context:".
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE009-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *     File Name:".
000112  05 FILLER PIC X(30) VALUE "             File Status:".
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE010-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *     File Library:".
000112  05 FILLER PIC X(30) VALUE "             File Function:".
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE011-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *     File Volume:".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE012-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *     Key Value:".
000112  05 FILLER PIC X(30) VALUE "             Key Number:".
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE013-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE014-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE015-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *     File Record:".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE016-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE017-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE018-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE019-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *     Message:".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE020-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE021-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *".
000112  05 FILLER PIC X(30) VALUE SPACES.
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE022-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *                    Please C".
000112  05 FILLER PIC X(30) VALUE "ontact the System Administrato".
000112  05 FILLER PIC X(20) VALUE "r                  *".
000112 01  SYS99R-DE-DE023-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *                   One or mo".
000112  05 FILLER PIC X(30) VALUE "re files may need to be Restor".
000112  05 FILLER PIC X(20) VALUE "ed                 *".
000112 01  SYS99R-DE-DE024-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *____________________________".
000112  05 FILLER PIC X(30) VALUE "______________________________".
000112  05 FILLER PIC X(20) VALUE "___________________*".
000112 01  SYS99R-DE-DE025-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *                      Progra".
000112  05 FILLER PIC X(30) VALUE "m was cancelled in Background".
000112  05 FILLER PIC X(20) VALUE "                   *".
000112 01  SYS99R-DE-DE026-LITERALS.
000112  05 FILLER PIC X(30) VALUE " *****************************".
000112  05 FILLER PIC X(30) VALUE "******************************".
000112  05 FILLER PIC X(20) VALUE "********************".
000112 01  SYS99R-LEVELFLAGS.
000112     05  SYS99R-DE-DE001-LEVELFLAGS.
000112         10  SYS99R-DE-DE001-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE002-LEVELFLAGS.
000112         10  SYS99R-DE-DE002-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE003-LEVELFLAGS.
000112         10  SYS99R-DE-DE003-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE004-LEVELFLAGS.
000112         10  SYS99R-DE-DE004-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE005-LEVELFLAGS.
000112         10  SYS99R-DE-DE005-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE006-LEVELFLAGS.
000112         10  SYS99R-DE-DE006-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE007-LEVELFLAGS.
000112         10  SYS99R-DE-DE007-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE008-LEVELFLAGS.
000112         10  SYS99R-DE-DE008-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE009-LEVELFLAGS.
000112         10  SYS99R-DE-DE009-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE010-LEVELFLAGS.
000112         10  SYS99R-DE-DE010-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE011-LEVELFLAGS.
000112         10  SYS99R-DE-DE011-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE012-LEVELFLAGS.
000112         10  SYS99R-DE-DE012-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE013-LEVELFLAGS.
000112         10  SYS99R-DE-DE013-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE014-LEVELFLAGS.
000112         10  SYS99R-DE-DE014-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE015-LEVELFLAGS.
000112         10  SYS99R-DE-DE015-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE016-LEVELFLAGS.
000112         10  SYS99R-DE-DE016-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE017-LEVELFLAGS.
000112         10  SYS99R-DE-DE017-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE018-LEVELFLAGS.
000112         10  SYS99R-DE-DE018-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE019-LEVELFLAGS.
000112         10  SYS99R-DE-DE019-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE020-LEVELFLAGS.
000112         10  SYS99R-DE-DE020-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE021-LEVELFLAGS.
000112         10  SYS99R-DE-DE021-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE022-LEVELFLAGS.
000112         10  SYS99R-DE-DE022-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE023-LEVELFLAGS.
000112         10  SYS99R-DE-DE023-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE024-LEVELFLAGS.
000112         10  SYS99R-DE-DE024-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE025-LEVELFLAGS.
000112         10  SYS99R-DE-DE025-LEVELFLAG PIC X OCCURS 1.
000112     05  SYS99R-DE-DE026-LEVELFLAGS.
000112         10  SYS99R-DE-DE026-LEVELFLAG PIC X OCCURS 1.
000112 01  SYS99R-ENABLEFLAGS VALUE SPACES.
000112     05  SYS99R-DE-ENABLEFLAGS.
000112         10  SYS99R-DE-DE001-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE002-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE003-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE004-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE005-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE006-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE007-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE008-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE009-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE010-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE011-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE012-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE013-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE014-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE015-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE016-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE017-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE018-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE019-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE020-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE021-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE022-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE023-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE024-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE025-ENABLEFLAG PIC X.
000112         10  SYS99R-DE-DE026-ENABLEFLAG PIC X.
000112*                                 - SYS99R-BREAKTEST
000112* SYS99R-BREAKTEST MUST SET SYS99R-BREAKLEVEL TO A VALUE
000112*    BETWEEN 1 AND 1 WHEN THERE IS A BREAK IN THE DATA.
000112*                                 - SYS99R-CH-PRINT
000112*                                 - SYS99R-CF-PRINT
000112* WHEN SYS99R-CH-PRINT AND SYS99R-CF-PRINT ARE PERFORMED
000112*   THE VALUE OF SYS99R-TOTLEVEL IS THE VALUE OF THE CURRENT
000112*   LEVEL OF CH OR  CF LINES TO BE PRINTED. IT VARIES BETWEEN
000112*   SYS99R-ADDLEVEL AND SYS99R-BREAKLEVEL DESCENDING (FOR CH) OR
000112*   ASCENDING (FOR CF).  SYS99R-TOTLEVELPLUS1 IS 1 GREATER
000112*   THAN SYS99R-TOTLEVEL.
000112 77  SYS99R-FIRSTFLAG          PIC X VALUE SPACE.
000112* SYS99R-FIRSTFLAG = SPACE BEFORE REPORT INITIATED
000112*                   = "F" AFTER REPORT INITIATED
000112*                   = "I" AFTER FIRST DETAIL FINISHED PROCESSING
000112*                   = "T" AFTER REPORT TERMINATED
000112 77  SYS99R-FIRSTPAGEFLAG      PIC X VALUE "F".
000112* SYS99R-FIRSTPAGEFLAG = NONBLANK CAUSES PF LINES TO BE SUPRESSED
000112*                       = "F" BEFORE TOP OF FIRST PAGE PRINTED
000112*                       = SPACE FOR SECOND AND SUBSEQUENT PAGES
000112 77  SYS99R-DE-ALLENABLEFLAG  PIC X VALUE SPACE.
000112 01  SYS99R-TOTCOUNT-ARRAY.
000112     05 SYS99R-TOTCOUNT-ARRAYLEVEL OCCURS 1 TIMES.
000112         10 SYS99R-TOTCOUNT       BINARY.
000112 77  SYS99R-FILENAME         PIC X(8) VALUE "SYS99R".
000112 77  SYS99R-SPACE            PIC 9(7) VALUE 2000.
000112 77  SYS99R-LIBRARY          PIC X(8) VALUE SPACES.
000112 77  SYS99R-VOLUME           PIC X(6) VALUE SPACES.
000112 77  SYS99R-OPENFLAG         PIC XX VALUE SPACES.
000112 77  SYS99R-PAGESKIPFLAG     PIC X VALUE "T".
000112* SYS99R-PAGESKIPFLAG = "T" TO FORCE TOP OF PAGE ON NEXT PRINT
000112 77  SYS99R-PAGESKIPSPACE    PIC X VALUE SPACE.
000112 01  SYS99R-PAGENUM          PIC S9(7)  COMP  VALUE ZERO.
000112* OLD NAME SYS99R-PAGENUM-COMP RETAINDED FOR COMPATIBILITY
000112 01  SYS99R-PAGENUM-COMP REDEFINES SYS99R-PAGENUM
000112                            PIC S9(7)       COMP.
000112 01  SYS99R-FILESTATUS.
000112     05 SYS99R-FILESTATUS1  PIC X.
000112     05 SYS99R-FILESTATUS2  PIC X.
000170 01  XTRCT-XUSERID        PIC XX VALUE "ID".
000170 01  XTRCT-XUSERNAME      PIC XX VALUE "NA".
000170 01  XTRCT-XTSKTYPE       PIC XX VALUE "TT".
000065 LINKAGE SECTION.
000066*.COPY STDERRBL
000066 01  SYS99-BLOCK.
000066     05  SYS99-PROGRAM             PIC X(8).
000066     05  SYS99-CONTEXT             PIC X(8).
000066     05  SYS99-FUNCTION            PIC X(3).
000066     05  SYS99-FILE                PIC X(8).
000066     05  SYS99-LIBRARY             PIC X(8).
000066     05  SYS99-VOLUME              PIC X(6).
000066     05  SYS99-STATUS              PIC X(2).
000066     05  SYS99-KEY                 PIC X(70).
000066     05  SYS99-KEY-NO              PIC 9(02).
000066     05  SYS99-RECORD              PIC X(70).
000066     05  SYS99-MESSAGE1            PIC X(70).
000066     05  SYS99-MESSAGE2            PIC X(70).
000067
000068******************************************************************
000069
000070 PROCEDURE DIVISION USING SYS99-BLOCK.
000071
000072 A-100-PROCESS SECTION.
000072 A-100-PROCESS-1.
000073*
000074
000075     CALL "HEXUNPK" USING SYS99-KEY
000076                          SYS99-KEY-HEX
000077                          SYS99-LENGTH-35-HEX.
000078     CALL "HEXUNPK" USING SYS99-RECORD
000079                          SYS99-RECORD-HEX
000080                          SYS99-LENGTH-70-HEX.
000081
000082     PERFORM XTRCT-EXTRACT.
000083     IF SYS99-TASK-TYPE = "F"
000084        PERFORM Z1-GENERATE
000085        PERFORM Z-100-PRINT-SCREEN
000086     ELSE
000087        ACCEPT SYS99-DATE-WRK FROM DATE
000088        ACCEPT SYS99-TIME-ACCEPT-WRK FROM TIME
000089        DIVIDE SYS99-TIME-ACCEPT-WRK BY 1000000
000090               GIVING SYS99-TIME-WRK
000091        PERFORM SYS99R-GENERATE
000092        PERFORM SYS99R-TERMINATE.
000093
000094
000095     PERFORM CLOSEFILES.
000096*
000097*A-100-EXIT.
000098*    EXIT PROGRAM.
000099*
000100 A-999-STOP.
000101     MOVE 99 TO RETURN-CODE.
000102     STOP RUN.
000103
000104******************************************************************
000106*.COPY SDIV#F
000106*.REPLACEON
000107
000109*.COPY SYS99#Y
000109*.REPLACE N0011 BY DEGEN
000109*.REPLACE N0011COPY BY YES
000109*.REPLACE N0012COPY BY YES
000109*.REPLACE SEDITCOPY BY YES
000109*.REPLACE JUSTIFYCOPY BY NO
000109*.REPLACE LINKCOPY BY NO
000109*.REPLACE DOCCOPY BY NO
000109*.REPLACE DOCUMENTATION BY DOCUMENTATION
000109*.REPLACE LINK BY LINK
000109*.REPLACE UEDITCOPY BY NO
000109*.BREAK DEFAULTS
000109 Z1-BACKGROUND SECTION.
000109 Z1-BACKGROUND-01.
000109*.BREAK Z1-BACKGROUND-BEFORE
000109*.BREAK Z1-BACKGROUND-DEFAULT
000109*.DEFAULT
000109*.END-DEFAULT
000109*.BREAK Z1-BACKGROUND-AFTER
000109 Z1-SOURCE-TO-IMAGE SECTION.
000109 Z1-SOURCE-TO-IMAGE-01.
000109*.BREAK Z1-SOURCE-TO-IMAGE-BEFORE
000109*.BREAK Z1-SOURCE-TO-IMAGE-DEFAULT
000109*.DEFAULT
000109     MOVE SYS99-FILE TO Z1-A-001.
000109     MOVE SYS99-LIBRARY TO Z1-B-001.
000109     MOVE SYS99-VOLUME TO Z1-C-001.
000109     MOVE SYS99-STATUS TO Z1-D-001.
000109     MOVE SYS99-MESSAGE1 TO Z1-E-001.
000109     MOVE SYS99-MESSAGE2 TO Z1-F-001.
000109     MOVE SYS99-PROGRAM TO Z1-G-001.
000109     MOVE SYS99-CONTEXT TO Z1-H-001.
000109     MOVE SYS99-KEY TO Z1-I-001.
000109     MOVE SYS99-RECORD TO Z1-J-001.
000109     MOVE SYS99-FUNCTION TO Z1-K-001.
000109     MOVE SYS99-KEY-NO TO Z1-L-001.
000109     MOVE SYS99-KEY-HEX TO Z1-69-001.
000109     MOVE SYS99-RECORD-HEX-1 TO Z1-6A-001.
000109     MOVE SYS99-RECORD-HEX-2 TO Z1-6B-001.
000109     MOVE "Please Contact the System Administrator" TO Z1-78-001.
000109     MOVE " " TO Z1-79-001.
000109     MOVE "One or more files may need to be restored" TO
000109           Z1-7A-001.
000109     PERFORM Z1-SET-PSEUDOBLANKS.
000109*.END-DEFAULT
000109*.BREAK Z1-SOURCE-TO-IMAGE-AFTER
000109 Z1-SET-PSEUDOBLANKS SECTION.
000109 Z1-SET-PSEUDOBLANKS-01.
000109*.BREAK Z1-SET-PSEUDOBLANKS-BEFORE
000109*.BREAK Z1-SET-PSEUDOBLANKS-DEFAULT
000109*.DEFAULT
000109*.END-DEFAULT
000109*.BREAK Z1-SET-PSEUDOBLANKS-AFTER
000109 Z1-RESET-PSEUDOBLANKS SECTION.
000109 Z1-RESET-PSEUDOBLANKS-01.
000109*.BREAK Z1-RESET-PSEUDOBLANKS-BEFORE
000109*.BREAK Z1-RESET-PSEUDOBLANKS-DEFAULT
000109*.DEFAULT
000109*.END-DEFAULT
000109*.BREAK Z1-RESET-PSEUDOBLANKS-AFTER
000109 Z1-IMAGE-TO-OBJECT SECTION.
000109 Z1-IMAGE-TO-OBJECT-01.
000109*.BREAK Z1-IMAGE-TO-OBJECT-BEFORE
000109*.BREAK Z1-IMAGE-TO-OBJECT-DEFAULT
000109*.DEFAULT
000109*.END-DEFAULT
000109*.BREAK Z1-IMAGE-TO-OBJECT-AFTER
000109 Z1-VALIDATE SECTION.
000109 Z1-VALIDATE-01.
000109*.BREAK Z1-VALIDATE-BEFORE
000109*.BREAK Z1-VALIDATE-DEFAULT
000109*.DEFAULT
000109*.END-DEFAULT
000109*.BREAK Z1-VALIDATE-AFTER
000109*.REPLACEOFF
000109*.REPLACEON ; !
000109*.BREAK Z1-COPYN0012-BEFORE
000109*.BREAK Z1-COPYN0012-DEFAULT
000109*.DEFAULT
000109*.COPY N0012#F
000109*.REPLACEON
000109*.REPLACE N0012 BY Z1     % Frame name
000109*.REPLACE SCREEN BY Z1 % Alternate (old) replaceable symbol
000109*.BREAK VERSION
000109*.INSERT VERSION
000109*.REPLACE N0012 BY Z1
000109*.REPLACE N0012VERSION BY 010100
000109*..INSERT-TERMINATED
000109*.REPLACE N0012TYPE BY 1      % variable background - the default
000109*.REPLACE N0012NROWS BY 024   % rows on screen - 024 to 100
000109*.REPLACE N0012NCOLS BY 80    % columns on screen - currently 80
000109*.REPLACE N0012HELP BY NO     % generate logic to support HELP pfs
000109*.REPLACE N0012DOCF BY NO     % generate logic for #H files?
000109*.REPLACE N0012LINKF BY NO    % generate logic to link to programs
000109*.REPLACE N0012MSGF  BY NO    % generate logic to access messages?
000109*.REPLACE N0012DNAME BY " "   % name of DOCUMENTATION frame or bln
000109*.REPLACE N0012LNAME BY " "   % name of LINK frame or blank if non
000109*.REPLACE N0012FINDFIELD BY NO  % generate "find field" logic?
000109*.REPLACE N0012NEARFIELD BY NO  % cursor "in field" if near it?
000109*.REPLACE USEHELPFORLOOKUP BY NO % default use for help
000109*.REPLACE N0012DISPLAYYEAR BY YES % display dataset on msg line
000109*.REPLACE N0012PSEUDO      BY NO % supply coding for pseudoblanks
000109*.REPLACE FORMATTAG1         BY 00 % first field to be formatted
000109*.REPLACE FORMATTAG2         BY 00 % ect
000109*.REPLACE FORMATTAG3         BY 00 %
000109*.REPLACE FORMATTAG4         BY 00 %
000109*.REPLACE FORMATTAG5         BY 00 %
000109*.REPLACE FORMATTAG6         BY 00 %
000109*.REPLACE FORMATTAG7         BY 00 %
000109*.REPLACE FORMATTAG8         BY 00 %
000109*.REPLACE FORMATTAG9         BY 00 %
000109*.REPLACE FORMATTAG10        BY 00 %
000109*.REPLACE FORMATTAG11        BY 00 %
000109*.REPLACE FORMATTAG12        BY 00 %
000109*.REPLACE FORMATTAG13        BY 00 %
000109*.REPLACE FORMATTAG14        BY 00 %
000109*.REPLACE FORMATTAG15        BY 00 %
000109*.REPLACE FORMATTAG16        BY 00 %
000109*.REPLACE FORMATTAG17        BY 00 %
000109*.REPLACE FORMATTAG18        BY 00 %
000109*.REPLACE FORMATTAG19        BY 00 %
000109*.REPLACE FORMATTAG20        BY 00 %
000109*.REPLACE FORMATTAG21        BY 00 %
000109*.REPLACE FORMATTAG22        BY 00 %
000109*.REPLACE FORMATTAG23        BY 00 %
000109*.REPLACE FORMATTAG24        BY 00 %
000109*.REPLACE FORMATTAG25        BY 00 %
000109*.BREAK PARAMETERS
000109*.INSERT PARAMETERS
000109*.    REPLACE N0012NROWS BY 024
000109*.    REPLACE N0012NCOLS BY 080
000109*.    REPLACE N0012FINDFIELD BY YES
000109*.    REPLACE N0012TYPE BY 2
000109*.END-INSERT
000109*.BREAK Z1-PARAMETERS
000109 Z1-DISACCT-SM SECTION.
000109 Z1-DISACCT-SM-01.
000109*.BREAK Z1-DISACCT-SM-BEFORE
000109*.BREAK Z1-DISACCT-SM-DEFAULT
000109*.DEFAULT
000109     MOVE "DS" TO Z1-FN.
000109     CALL "WSFNS" USING Z1-FN Z1-REC Z1-LINE
000109                        Z1-POS Z1-BEEPFLAG.
000109     MOVE "AS" TO Z1-FN.
000109     CALL "WSFNS" USING Z1-FN Z1-REC Z1-LINE
000109                        Z1-POS Z1-BEEPFLAG.
000109     MOVE SPACE TO Z1-BEEPFLAG.
000109*.END-DEFAULT
000109*.BREAK Z1-DISACCT-SM-AFTER
000109 Z1-MSG-DISPLAY SECTION.
000109 Z1-MSG-DISPLAY-1.
000109     PERFORM Z1-DISPLAY-MSG.
000109     MOVE 80 TO Z1-POS.
000109     MOVE 1 TO Z1-LINE.
000109     MOVE "DS" TO Z1-FN.
000109     CALL "WSFNS" USING Z1-FN Z1-REC Z1-LINE
000109                        Z1-POS Z1-BEEPFLAG.
000109     MOVE "DI" TO Z1-FN.
000109     CALL "WSFNS" USING Z1-FN Z1-REC Z1-LINE
000109                        Z1-POS Z1-BEEPFLAG.
000109     CALL "PAUSE" USING DEGEN-PAUSE-LENGTH.
000109     PERFORM Z1-ERASE-MSGS.
000109 Z1-MSG-DISPLAY-RETURN.  EXIT.
000109 Z1-PFACCT-M SECTION.
000109 Z1-PFACCT-M-01.
000109*.BREAK Z1-PFACCT-M-BEFORE
000109*.BREAK Z1-PFACCT-M-DEFAULT
000109*.DEFAULT
000109     MOVE "PF" TO Z1-FN.
000109     CALL "WSFNS" USING Z1-FN Z1-PF
000109                        Z1-ROW Z1-COL
000109                         .
000109*.END-DEFAULT
000109*.BREAK Z1-PFACCT-M-AFTER
000109*.END-DEFAULT
000109*.BREAK Z1-COPYN0012-AFTER
000109*.BREAK COPYN0011-BEFORE
000109*.BREAK COPYN0011-DEFAULT
000109*.DEFAULT
000109*.COPY N0011#F
000109*.REPLACE "" BY ;
000109*.REPLACEON
000109*.REPLACE N0011         BY DEGEN   % Frame name.
000109*.REPLACE N0011VERSION  BY 010000  % Frame version
000109                                  % value 010000.
000109*.REPLACE HOTPRINT      BY YES     % Default to enable HotPrint
000109*.REPLACE DEGENPIC      BY "S9(12)V9(4)"  %Default picture clause
000109*.REPLACE DEGENTESTVALUE BY "-9876543210.1234"   %This field MUST
000109*.BREAK VERSION
000109*.INSERT VERSION
000109*.REPLACE N0011 BY DEGEN
000109*.REPLACE N0011VERSION BY 010000
000109*..INSERT-TERMINATED
000109*.REPLACE N0011VARIABLES BY "   " % Use ALL for CAPscreen screens,
000109                                 % anything else otherwise.
000109*.REPLACE N0011COMPILER BY BADCODE % The WANG COBOL compiler write
000109                                  % buggy ON ERROR code.
000109*.REPLACE N0011DECIMALPOINT BY "." % European users may want to
000109                                  % replace this by ","
000109*.REPLACE TYPEAFORMAT BY NO
000109*.REPLACE TYPEBFORMAT BY NO
000109*.REPLACE TYPECFORMAT BY NO
000109*.REPLACE TYPEDFORMAT BY NO
000109*.REPLACE TYPEEFORMAT BY NO
000109*.REPLACE TYPEFFORMAT BY NO
000109*.REPLACE TYPEGFORMAT BY NO
000109*.REPLACE TYPEHFORMAT BY NO
000109*.REPLACE TYPEIFORMAT BY NO
000109*.REPLACE TYPEJFORMAT BY NO
000109*.REPLACE TYPEKFORMAT BY NO
000109*.REPLACE TYPELFORMAT BY NO
000109*.REPLACE TYPEMFORMAT BY NO
000109*.REPLACE TYPENFORMAT BY NO
000109*.BREAK PARAMETERS
000109*.INSERT PARAMETERS
000109*.REPLACE N0011VARIABLES BY ALL
000109*.REPLACE N0011COMPILER BY BADCODE
000109*.END-INSERT
000109*.BREAK DEGEN-PARAMETERS
000109 DEGEN-CONVERT SECTION.
000109 DEGEN-CONVERT-START.
000109*.BREAK DEGEN-CONVERT-BEFORE
000109*.BREAK DEGEN-CONVERT-DEFAULT
000109*.DEFAULT
000109     MOVE 0 TO DEGEN-RETURN-CODE.
000109     INSPECT DEGEN-ALPHA REPLACING ALL LOW-VALUES BY SPACE.
000109     PERFORM DEGEN-CHECK-IF-NUMERIC.
000109     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000109        PERFORM DEGEN-CHECK-IF-NEGATIVE.
000109     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000109        PERFORM DEGEN-CHECK-DECIMALS.
000109     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000109        PERFORM DEGEN-CHECK-SIZE.
000109     IF DEGEN-RETURN-CODE NOT = ZERO
000109          MOVE "N" TO DEGEN-STATUS.
000109*.END-DEFAULT
000109*.BREAK DEGEN-CONVERT-AFTER
000109 DEGEN-CHECK-IF-NUMERIC SECTION.
000109* Check to see if numeric variables are truly numeric
000109 DEGEN-CHECK-IF-NUMERIC-01.
000109*.BREAK DEGEN-CHECK-IF-NUMERIC-BEFORE
000109*.BREAK DEGEN-CHECK-IF-NUMERIC-DEFAULT
000109*.DEFAULT
000109     MOVE ZERO TO DEGEN-RETURN-CODE.
000109* Make sure the entered value is numeric
000109     MOVE -9876543210.1234                     TO DEGEN-NUMERIC.
000109     MOVE WITH CONVERSION DEGEN-ALPHA TO DEGEN-NUMERIC.
000109     IF DEGEN-NUMERIC = -9876543210.1234
000109                   MOVE 1 TO DEGEN-RETURN-CODE.
000109*
000109*
000109*
000109*.END-DEFAULT
000109*.BREAK DEGEN-CHECK-IF-NUMERIC-AFTER
000109 DEGEN-CHECK-IF-NEGATIVE SECTION.
000109* Make sure an entry in an unsigned variable is not negative
000109 DEGEN-CHECK-IF-NEGATIVE-01.
000109*.BREAK DEGEN-CHECK-IF-NEGATIVE-BEFORE
000109*.BREAK DEGEN-CHECK-IF-NEGATIVE-DEFAULT
000109*.DEFAULT
000109     MOVE ZERO TO DEGEN-RETURN-CODE.
000109     IF (DEGEN-SIGN = "N") AND (DEGEN-NUMERIC < ZERO)
000109          MOVE 2 TO DEGEN-RETURN-CODE.
000109*.END-DEFAULT
000109*.BREAK DEGEN-CHECK-IF-NEGATIVE-AFTER
000109 DEGEN-CHECK-DECIMALS SECTION.
000109* Make sure an entry in an integer variable has no decimals
000109 DEGEN-CHECK-DECIMALS-01.
000109*.BREAK DEGEN-CHECK-DECIMALS-BEFORE
000109*.BREAK DEGEN-CHECK-DECIMALS-DEFAULT
000109*.DEFAULT
000109     IF DEGEN-DECIMALS = ZERO
000109         % Store length of variable without FAC
000109         SUBTRACT 1 FROM DEGEN-LENGTH GIVING DEGEN-L
000109         PERFORM DEGEN-DUMMY VARYING DEGEN-J FROM 1 BY 1
000109            UNTIL DEGEN-ALPHA-16(DEGEN-J) = "."
000109            OR DEGEN-J NOT < DEGEN-L
000109         IF DEGEN-ALPHA-16(DEGEN-J) = "."
000109            MOVE 3 TO DEGEN-RETURN-CODE.
000109*.END-DEFAULT
000109*.BREAK DEGEN-CHECK-DECIMALS-AFTER
000109 DEGEN-CHECK-SIZE SECTION.
000109 DEGEN-CHECK-SIZE-01.
000109*.BREAK DEGEN-CHECK-SIZE-BEFORE
000109*.BREAK DEGEN-CHECK-SIZE-DEFAULT
000109*.DEFAULT
000109* Make sure an entry in a field is not too large (e.g. if 5
000109* digits are entered in a field that should contain 2 digits,
000109* a decimal point, and 2 digits).
000109     IF (DEGEN-SIGN = "N") AND (DEGEN-DECIMALS = ZERO)
000109          GO DEGEN-CHECK-SIZE-EXIT.
000109* Store length of variable without FAC
000109     SUBTRACT 1 FROM DEGEN-LENGTH GIVING DEGEN-L.
000109* Find maximum number of digits in variable
000109     MOVE DEGEN-L TO DEGEN-I.
000109     IF DEGEN-SIGN = "Y"
000109          SUBTRACT 1 FROM DEGEN-I.
000109     IF DEGEN-DECIMALS NOT = ZERO
000109          SUBTRACT 1 FROM DEGEN-I   % for decimal point
000109          SUBTRACT DEGEN-DECIMALS FROM DEGEN-I.
000109* Find first non-zero digit of number, or find leading decimal
000109     PERFORM DEGEN-DUMMY VARYING DEGEN-J FROM 1 BY 1 UNTIL
000109        (DEGEN-ALPHA-16(DEGEN-J) NOT < "1"
000109                 AND NOT > "9" OR = ".")
000109        OR (DEGEN-J = DEGEN-L).
000109* If it has a leading decimal then the number cannot overflow
000109     IF DEGEN-ALPHA-16(DEGEN-J) = "."
000109        GO TO DEGEN-CHECK-SIZE-EXIT.
000109* Otherwise find last digit of number
000109     ADD 1, DEGEN-J GIVING DEGEN-K.
000109     PERFORM DEGEN-DUMMY VARYING DEGEN-K FROM DEGEN-K BY 1
000109        UNTIL (DEGEN-ALPHA-16(DEGEN-K) < "0" OR  > "9")
000109           OR DEGEN-K = DEGEN-L
000109           OR DEGEN-K = 16.
000109     IF DEGEN-ALPHA-16(DEGEN-K) < "0" OR > "9"
000109        SUBTRACT 1 FROM DEGEN-K.
000109     SUBTRACT -1 DEGEN-J FROM DEGEN-K GIVING DEGEN-K
000109     IF DEGEN-K > DEGEN-I
000109        MOVE 4 TO DEGEN-RETURN-CODE.
000109 DEGEN-CHECK-SIZE-EXIT.
000109*.END-DEFAULT
000109*.BREAK DEGEN-CHECK-SIZE-AFTER
000109 DEGEN-DUMMY SECTION.  % This dummy section does nothing
000109 DEGEN-DUMMY-START.
000109     EXIT.
000109
000109******************************************************************
000109*                                                                *
000109*             PRINT PROGRAM SCREEN                               *
000109*                                                                *
000109******************************************************************
000109
000109 Z-100-PRINT-SCREEN SECTION.
000109 Z-100-PRINT-SCREEN-1.
000109
000109     CALL "WSCLOSE".
000109
000109     MOVE "#"          TO SCRPRT-NAME-A.
000109
000109     CALL "EXTRACT" USING SCRPRT-ID
000109                          SCRPRT-NAME-B.
000109
000109     MOVE "0"          TO SCRPRT-NAME-C.
000109     MOVE SPACE        TO SCRPRT-NAME-D.
000109
000109     CALL "SCREEN"  USING SCRPRT-WORKSTATION-STATUS
000109                          SCRPRT-UFB-ADDRESS
000109                          SCRPRT-PRINT-TYPE
000109                          SCRPRT-PRINT-FILE.
000109
000109     CALL "BELL"    USING SCRPRT-BELL-TIME.
000109
000109 Z-100-EXIT.
000109     EXIT.
000109
000109*.END-DEFAULT
000109*.BREAK COPYN0011-AFTER
000109*.BREAK COPYSEDIT-BEFORE
000109*.BREAK COPYSEDIT-DEFAULT
000109*.DEFAULT
000109*.COPY SEDIT
000109*.REPLACEON
000109*.REPLACE SEDIT BY SEDIT     % Frame name.
000109*.REPLACE SEDITVERSION BY 010000 % Frame version.
000109*.BREAK VERSION
000109*.INSERT VERSION
000109*.REPLACE SEDIT BY SEDIT
000109*.REPLACE SEDITVERSION BY 010000
000109*..INSERT-TERMINATED
000109*.REPLACE SEDITDATE      BY NO  % Generate SEDIT-DATE.
000109*.REPLACE SEDITDATEZERO  BY NO  % Allow a zero date.
000109*.REPLACE SEDITPHONE      BY NO  % Generate SEDIT-PHONE.
000109*.REPLACE SEDITPHONEZERO  BY YES % Allow a zero phone number.
000109*.REPLACE SEDITPOSTAL       BY NO  % Generate SEDIT-POSTAL.
000109*.REPLACE SEDITPOSTALBLANK  BY YES % Allow a blank postal code.
000109*.REPLACE SEDITPATTERNMATCH     BY NO  % Generate it.
000109*.REPLACE SEDITPATTERNBLANK     BY YES % Allow a blank pattern.
000109*.REPLACE SEDITPATTERNSIZE      BY 30 % Maximum size of pattern.
000109*.REPLACE SEDITPATTERNMULTIPLE  BY "?" % Denotes any string.
000109*.REPLACE SEDITPATTERNSINGLE    BY "*" % Denotes any character.
000109*.REPLACE SEDITPATTERNDELIMITER BY "/" % Denotes end of mask.
000109*.REPLACE SEDITPATTERNMASKSETUP BY NO  % Generate it.
000109*.REPLACE SEDITPATTERNMASKBLANK BY YES % Allow a blank mask.
000109*.REPLACE SEDITSOCIALINSURANCE  BY NO  % Generate it.
000109*.REPLACE SEDITSOCIALZERO       BY YES % Allow a zero number.
000109*.REPLACE SEDITJUSTIFY          BY NO  % Left justify text in
000109*.REPLACE SEDITQUOTE            BY NO  % Test for balanced quotes
000109*.REPLACE DATE BY NO                   % Old date check
000109*.REPLACE PHONE BY NO                  % Old phone check
000109*.REPLACE POSTAL BY NO                 % Old postal/zip code check
000109*.REPLACE PATTERNMATCH BY NO           % Old pattern match check
000109*.REPLACE SOCIALINSURANCE BY NO        % Old social insurance chec
000109*.REPLACE SEDITN0011  BY DEGEN       % Frame name for N0011.
000109*.REPLACE SEDITWS     BY NO  % Generate variables for N0011.
000109*.REPLACE SEDITWORKXSIZE  BY 40  % Size of DEGEN-WORKX.
000109*.REPLACE SEDITWORKNSIZE  BY 18  % Size of DEGEN-WORKN.
000109*.BREAK PARAMETERS
000109*.INSERT PARAMETERS
000109*.END-INSERT
000109*.BREAK SEDIT-PARAMETERS
000109*.REPLACE SEDITFLAG BY NO  % Test if at least one
000109*.END-DEFAULT
000109*.BREAK COPYSEDIT-AFTER
000109*.BREAK COPYJUSTIFY-BEFORE
000109*.BREAK COPYJUSTIFY-DEFAULT
000109*.DEFAULT
000109*.END-DEFAULT
000109*.BREAK COPYJUSTIFY-AFTER
000109*.BREAK COPYUEDIT-BEFORE
000109*.BREAK COPYUEDIT-DEFAULT
000109*.DEFAULT
000109*.END-DEFAULT
000109*.BREAK COPYUEDIT-AFTER
000110
000112*.COPY SYS99#R
000112*.REPLACE REPORT BY SYS99R
000112*.BREAK PARAMETERS
000112*.REPLACEON ;!
000112 SYS99R-INITIATE SECTION.
000112 SYS99R-INITIATE-01.
000112*.BREAK SYS99R-INITIATE-BEFORE
000112*.BREAK SYS99R-INITIATE-DEFAULT
000112*.DEFAULT
000112      PERFORM SYS99R-ZEROTOTALS VARYING SYS99R-TOTLEVEL
000112         FROM 1 BY 1 UNTIL SYS99R-TOTLEVEL > 1.
000112      ADD 1 1 GIVING SYS99R-ADDLEVEL-SAVE.
000112      MOVE 1 TO SYS99R-ADDLEVEL.
000112      MOVE SPACES TO SYS99R-ENABLEFLAGS.
000112      MOVE SPACE TO SYS99R-DE-ALLENABLEFLAG.
000112      MOVE "F" TO SYS99R-FIRSTPAGEFLAG.
000112      MOVE "T" TO SYS99R-PAGESKIPFLAG.
000112      PERFORM SYS99R-INITIALIZE-LEVELFLAGS.
000112      MOVE ZERO TO SYS99R-BREAKLEVEL.
000112*.BREAK SYS99R-INITIALIZE
000112      MOVE "F" TO SYS99R-FIRSTFLAG.
000112*.END-DEFAULT
000112*.BREAK SYS99R-INITIATE-AFTER
000112 SYS99R-GENERATE SECTION.
000112 SYS99R-GENERATE-01.
000112*.BREAK SYS99R-GENERATE-BEFORE
000112*.BREAK SYS99R-GENERATE-DEFAULT
000112*.DEFAULT
000112      IF SYS99R-FIRSTFLAG = SPACE OR "T"
000112           PERFORM SYS99R-INITIATE.
000112      IF SYS99R-FIRSTFLAG = "I"
000112           MOVE ZERO TO SYS99R-BREAKLEVEL
000112           PERFORM SYS99R-BREAKTEST.
000112      IF SYS99R-BREAKLEVEL NOT = ZERO
000112           PERFORM SYS99R-CF-LINES
000112           PERFORM SYS99R-CH-LINES
000112      ELSE PERFORM SYS99R-HALFBREAK.
000112      IF SYS99R-DE-ALLENABLEFLAG = SPACE
000112           PERFORM SYS99R-DE-PRINT.
000112      ADD 1 TO SYS99R-TOTCOUNT (SYS99R-ADDLEVEL).
000112      MOVE SYS99R-ADDLEVEL TO SYS99R-ADDLEVEL-SAVE.
000112      PERFORM SYS99R-SAVE-TRIGGERS.
000112      MOVE "I" TO SYS99R-FIRSTFLAG.
000112*.END-DEFAULT
000112*.BREAK SYS99R-GENERATE-AFTER
000112 SYS99R-HALFBREAK SECTION.
000112 SYS99R-HALFBREAK-01.
000112*.BREAK SYS99R-HALFBREAK-BEFORE
000112*.BREAK SYS99R-HALFBREAK-DEFAULT
000112*.DEFAULT
000112      IF SYS99R-ADDLEVEL-SAVE > SYS99R-ADDLEVEL
000112           SUBTRACT 1 FROM SYS99R-ADDLEVEL-SAVE
000112               GIVING SYS99R-BREAKLEVEL
000112               PERFORM SYS99R-CH-LINES
000112      ELSE IF SYS99R-ADDLEVEL-SAVE  < SYS99R-ADDLEVEL
000112                SUBTRACT 1 FROM SYS99R-ADDLEVEL
000112                    GIVING SYS99R-BREAKLEVEL
000112                    PERFORM SYS99R-CF-LINES.
000112*.END-DEFAULT
000112*.BREAK SYS99R-HALFBREAK-AFTER
000112 SYS99R-TERMINATE SECTION.
000112 SYS99R-TERMINATE-01.
000112*.BREAK SYS99R-TERMINATE-BEFORE
000112*.BREAK SYS99R-TERMINATE-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-FIRSTFLAG = SPACE OR "T"
000112          PERFORM SYS99R-INITIATE
000112          PERFORM SYS99R-HEADPAGE.
000112     ADD 1 1 GIVING SYS99R-ADDLEVEL.
000112     IF SYS99R-OPENFLAG = SPACES OR "C"
000112          PERFORM SYS99R-OUTOPEN.
000112     PERFORM SYS99R-HALFBREAK.
000112     PERFORM SYS99R-PF-PRINT.
000112     MOVE "T" TO SYS99R-FIRSTFLAG.
000112*.END-DEFAULT
000112*.BREAK SYS99R-TERMINATE-AFTER
000112 SYS99R-ZEROTOTALS SECTION.
000112 SYS99R-ZEROTOTALS-01.
000112*.BREAK SYS99R-ZEROTOTALS-BEFORE
000112*.BREAK SYS99R-ZEROTOTALS-DEFAULT
000112*.DEFAULT
000112      MOVE ZERO TO SYS99R-TOTCOUNT (SYS99R-TOTLEVEL).
000112*.END-DEFAULT
000112*.BREAK SYS99R-ZEROTOTALS-AFTER
000112 SYS99R-CH-LINES SECTION.
000112 SYS99R-CH-LINES-01.
000112*.BREAK SYS99R-CH-LINES-BEFORE
000112*.BREAK SYS99R-CH-LINES-DEFAULT
000112*.DEFAULT
000112      PERFORM SYS99R-CH-LOOP VARYING SYS99R-TOTLEVEL
000112        FROM SYS99R-BREAKLEVEL BY -1
000112           UNTIL SYS99R-TOTLEVEL < SYS99R-ADDLEVEL.
000112*.END-DEFAULT
000112*.BREAK SYS99R-CH-LINES-AFTER
000112 SYS99R-CH-LOOP SECTION.
000112 SYS99R-CH-LOOP-01.
000112*.BREAK SYS99R-CH-LOOP-BEFORE
000112*.BREAK SYS99R-CH-LOOP-DEFAULT
000112*.DEFAULT
000112      ADD 1 SYS99R-TOTLEVEL GIVING SYS99R-TOTLEVELPLUS1.
000112      PERFORM SYS99R-CH-PRINT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-CH-LOOP-AFTER
000112 SYS99R-CF-LINES SECTION.
000112 SYS99R-CF-LINES-01.
000112*.BREAK SYS99R-CF-LINES-BEFORE
000112*.BREAK SYS99R-CF-LINES-DEFAULT
000112*.DEFAULT
000112      PERFORM SYS99R-CF-LOOP VARYING SYS99R-TOTLEVEL
000112        FROM SYS99R-ADDLEVEL-SAVE BY 1 UNTIL
000112          SYS99R-TOTLEVEL > SYS99R-BREAKLEVEL.
000112*.END-DEFAULT
000112*.BREAK SYS99R-CF-LINES-AFTER
000112 SYS99R-CF-LOOP SECTION.
000112 SYS99R-CF-LOOP-01.
000112*.BREAK SYS99R-CF-LOOP-BEFORE
000112*.BREAK SYS99R-CF-LOOP-DEFAULT
000112*.DEFAULT
000112      ADD 1 SYS99R-TOTLEVEL GIVING SYS99R-TOTLEVELPLUS1.
000112      PERFORM SYS99R-CF-PRINT.
000112      PERFORM SYS99R-TOTALLOOP.
000112*.END-DEFAULT
000112*.BREAK SYS99R-CF-LOOP-AFTER
000112 SYS99R-TOTALLOOP SECTION.
000112 SYS99R-TOTALLOOP-01.
000112*.BREAK SYS99R-TOTALLOOP-BEFORE
000112*.BREAK SYS99R-TOTALLOOP-DEFAULT
000112*.DEFAULT
000112      ADD 1 SYS99R-TOTLEVEL GIVING SYS99R-TOTLEVELPLUS1.
000112*.END-DEFAULT
000112*.BREAK SYS99R-TOTALLOOP-AFTER
000112 SYS99R-ROLL-TOTALS SECTION.
000112 SYS99R-ROLL-TOTALS-01.
000112*.BREAK SYS99R-ROLL-TOTALS-BEFORE
000112*.BREAK SYS99R-ROLL-TOTALS-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-TOTLEVEL < 1
000112     ADD SYS99R-TOTCOUNT (SYS99R-TOTLEVEL)
000112        TO SYS99R-TOTCOUNT (SYS99R-TOTLEVELPLUS1)
000112     MOVE ZERO TO SYS99R-TOTCOUNT (SYS99R-TOTLEVEL).
000112*.END-DEFAULT
000112*.BREAK SYS99R-ROLL-TOTALS-AFTER
000112 SYS99R-TITLEPRINT SECTION.
000112 SYS99R-TITLEPRINT-01.
000112*.BREAK SYS99R-TITLEPRINT-BEFORE
000112*.BREAK SYS99R-TITLEPRINT-DEFAULT
000112*.DEFAULT
000112     ADD SYS99R-NADVANCE TO SYS99R-LINECNT.
000112     WRITE SYS99R-FDREC FROM
000112          SYS99R-TITLEREC AFTER ADVANCING SYS99R-NADVANCE.
000112*.END-DEFAULT
000112*.BREAK SYS99R-TITLEPRINT-AFTER
000112 SYS99R-SKIP-TO-BOTTOM SECTION.
000112 SYS99R-SKIP-TO-BOTTOM-01.
000112*.BREAK SYS99R-SKIP-TO-BOTTOM-BEFORE
000112*.BREAK SYS99R-SKIP-TO-BOTTOM-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-LINECNT < SYS99R-PAGELENGTH
000112          COMPUTE SYS99R-NADVANCE =
000112              SYS99R-PAGELENGTH - SYS99R-LINECNT
000112          MOVE SYS99R-PAGELENGTH TO SYS99R-LINECNT
000112          WRITE SYS99R-FDREC FROM SYS99R-PAGESKIPSPACE
000112              AFTER ADVANCING SYS99R-NADVANCE
000112               .
000112*.END-DEFAULT
000112*.BREAK SYS99R-SKIP-TO-BOTTOM-AFTER
000112*.COPY S0002#F
000112*PRINT FRAME S0002#F AUTHOR WILLIAM KISIN FEBRUARY 1981.
000112*LATEST CHANGE BY WILLIAM KISIN MARCH 25, 1983.
000112*.REPLACE '' BY ;
000112*.REPLACE FILE BY PRINT      % PRINTFILE NAME
000112*.REPLACE MAXLINECNT BY 57   % NUMBER OF LINES PER PAGE
000112*.REPLACE NTITLES BY ZERO    % NUMBER OF TITLES
000112*.REPLACE FIRSTADVANCE BY 3  % NUMBER OF LINES TO ADVANCE BEFORE
000112*.REPLACE PAGEWIDTH BY 132   % PRINTER COLUMNS
000112*                                  PRINTING FIRST TITLE
000112*.BREAK PARAMETERS
000112*.INSERT PARAMETERS
000112*.REPLACE FILE BY SYS99R   % REPORT FILE NAME
000112*..INSERT-TERMINATED
000112*.REPLACEON ; !
000112 SYS99R-PRINT SECTION.
000112 SYS99R-PRINT-01.
000112*.BREAK SYS99R-PRINT-BEFORE
000112*.BREAK SYS99R-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-OPENFLAG = SPACES OR "C"
000112          PERFORM SYS99R-OUTOPEN.
000112     COMPUTE SYS99R-LINECNT-WORK =
000112         SYS99R-NADVANCE + SYS99R-LINECNT.
000112     IF SYS99R-LINECNT-WORK > SYS99R-PAGELENGTH
000112       OR SYS99R-PAGESKIPFLAG = "T"
000112           PERFORM SYS99R-HEADPAGE
000112           MOVE SPACE TO SYS99R-PAGESKIPFLAG.
000112     ADD SYS99R-NADVANCE TO SYS99R-LINECNT.
000112     WRITE SYS99R-FDREC FROM SYS99R-REC
000112           AFTER ADVANCING SYS99R-NADVANCE.
000112     MOVE SPACES TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE.
000112*.END-DEFAULT
000112*.BREAK SYS99R-PRINT-AFTER
000112 SYS99R-HEADPAGE SECTION.
000112 SYS99R-HEADPAGE-01.
000112*.BREAK SYS99R-HEADPAGE-BEFORE
000112*.BREAK SYS99R-HEADPAGE-DEFAULT
000112*.DEFAULT
000112     PERFORM SYS99R-PAGESKIP.
000112*.END-DEFAULT
000112*.BREAK SYS99R-HEADPAGE-AFTER
000112 SYS99R-PAGESKIP SECTION.
000112 SYS99R-PAGESKIP-01.
000112*.BREAK SYS99R-PAGESKIP-BEFORE
000112*.INSERT SYS99R-PAGESKIP-BEFORE          % chgd 18-AUG-86 RDW
000112     IF SYS99R-FIRSTPAGEFLAG = SPACE
000112        PERFORM SYS99R-SKIP-TO-BOTTOM
000112        PERFORM SYS99R-PF-PRINT.
000112*..INSERT-TERMINATED
000112*.BREAK SYS99R-PAGESKIP-DEFAULT
000112*.DEFAULT
000112*.BREAK SYS99R-BEFORE-PAGESKIP
000112     IF SYS99R-OPENFLAG = SPACES OR "C"
000112          PERFORM SYS99R-OUTOPEN.
000112     MOVE 1 TO SYS99R-LINECNT.
000112     WRITE SYS99R-FDREC FROM SYS99R-PAGESKIPSPACE
000112           AFTER ADVANCING PAGE.
000112     MOVE ZERO TO SYS99R-NADVANCE.
000112     ADD 1 TO SYS99R-PAGENUM-COMP.
000112*.BREAK SYS99R-AFTER-PAGESKIP
000112*.END-DEFAULT
000112*.BREAK SYS99R-PAGESKIP-AFTER
000112*.INSERT SYS99R-PAGESKIP-AFTER           % chgd 18-AUG-86 RDW
000112     MOVE 1 TO SYS99R-LINECNT
000112     PERFORM SYS99R-PH-PRINT.
000112     IF SYS99R-NADVANCE-SAVE < SYS99R-PAGELENGTH
000112         IF SYS99R-NADVANCE-SAVE > SYS99R-NADVANCE
000112             MOVE SYS99R-NADVANCE-SAVE TO SYS99R-NADVANCE.
000112     MOVE SPACE TO SYS99R-FIRSTPAGEFLAG.
000112*.END-INSERT
000112*.BREAK SYS99R-AFTER-HEADPAGE
000112 SYS99R-OUTOPEN SECTION.
000112 SYS99R-OUTOPEN-01.
000112*.BREAK SYS99R-OUTOPEN-BEFORE
000112*.BREAK SYS99R-OUTOPEN-DEFAULT
000112*.DEFAULT
000112     OPEN OUTPUT SYS99R.
000112     MOVE "OU" TO SYS99R-OPENFLAG.
000112     MOVE "T" TO SYS99R-PAGESKIPFLAG.
000112*.END-DEFAULT
000112*.BREAK SYS99R-OUTOPEN-AFTER
000112 SYS99R-CLOSE SECTION.
000112 SYS99R-CLOSE-01.
000112*.BREAK SYS99R-CLOSE-BEFORE
000112*.BREAK SYS99R-CLOSE-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-OPENFLAG NOT = SPACES AND NOT = "C"
000112         CLOSE SYS99R
000112         MOVE "C" TO SYS99R-OPENFLAG.
000112*.END-DEFAULT
000112*.BREAK SYS99R-CLOSE-AFTER
000127*. COPY XTRCT#F
000127*.REPLACEON ; !
000127*.REPLACE XTRCT      BY XTRCT  % Name this module
000127*.REPLACE XINLIB     BY 'Default input library        ' %  X(8)
000127*.REPLACE XINVOL     BY 'Default input volume         ' %  X(6)
000127*.REPLACE XOUTLIB    BY 'Default output library       ' %  X(8)
000127*.REPLACE XOUTVOL    BY 'Default output volume        ' %  X(6)
000127*.REPLACE XCPROGLIB  BY 'Current program library      ' %  X(8)
000127*.REPLACE XCPROGVOL  BY 'Current program volume       ' %  X(6)
000127*.REPLACE XPROGLIB   BY 'Default program library      ' %  X(8)
000127*.REPLACE XPROGVOL   BY 'Default program volume       ' %  X(6)
000127*.REPLACE XRUNLIB    BY 'Run library (initial)        ' %  X(8)
000127*.REPLACE XRUNVOL    BY 'Run volume (initial)         ' %  X(6)
000127*.REPLACE XSPOOLLIB  BY 'Default spool library        ' %  X(8)
000127*.REPLACE XSPOOLVOL  BY 'Default spool volume         ' %  X(6)
000127*.REPLACE XWRKLIB    BY 'Default work library         ' %  X(8)
000127*.REPLACE XWRKVOL    BY 'Default work volume          ' %  X(6)
000127*.REPLACE XFILECLAS  BY 'Default file protect class   ' %  X(1)
000127*.REPLACE XFLS2OPEN  BY '# of openable files available' %  9(5)
000127*.REPLACE XPRTFORMNO BY 'Default printer form number  ' %  9(3)
000127*.REPLACE XPRTLINES  BY 'Default lines/page on printer' %  9(3)
000127*.REPLACE XPRTCLASS  BY 'Default print class          ' %  X(1)
000127*.REPLACE XPRTMODE   BY 'Default print mode           ' %  X(1)
000127*.REPLACE XPRINTER   BY 'Default online printer number' %  9(3)
000127*.REPLACE XJOBCLASS  BY 'Bkgrnd job dflt class        ' %  X(1)
000127*.REPLACE XJOBLIMIT  BY 'Bkgrnd job dflt time limit   ' %  9(5)
000127*.REPLACE XJOBNAME   BY 'Bkgrnd job name              ' %  X(8)
000127*.REPLACE XJOBQUEUE  BY 'Bkgrnd job dflt status (R/H) ' %  X(1)
000127*.REPLACE XUSERID    BY 'Current Users ID             ' %  X(3)
000127*.REPLACE XUSERNAME  BY 'Current Users Name           ' %  X(24)
000127*.REPLACE XTSKNO     BY 'Task number                  ' %  9(5)
000127*.REPLACE XTSKTYPE   BY 'Task type                    ' %  X(1)
000127*.REPLACE XTERMID    BY 'This workstations device #   ' %  9(5)
000127*.REPLACE XSYSLIB    BY 'System library               ' %  X(8)
000127*.REPLACE XSYSVOL    BY 'System volume                ' %  X(6)
000127*.REPLACE XSYSPAGLIB BY 'System paging library        ' %  X(8)
000127*.REPLACE XSYSWRKLIB BY 'System paging volume         ' %  X(6)
000127*.BREAK PARAMETERS
000128*. INSERT PARAMETERS
000161*. REPLACE XUSERID    BY SYS99-USERID-WRK                %  X(3)
000162*. REPLACE XUSERNAME  BY SYS99-USER-NAME-WRK             %  X(24)
000164*. REPLACE XTSKTYPE   BY SYS99-TASK-TYPE                 %  X(1)
000170*. END-INSERT
000170 XTRCT-EXTRACT SECTION.
000170 XTRCT-EXTRACT-1.
000170     CALL "EXTRACT" USING
000170          XTRCT-XUSERID       SYS99-USERID-WRK
000170          XTRCT-XUSERNAME     SYS99-USER-NAME-WRK
000170          XTRCT-XTSKTYPE      SYS99-TASK-TYPE
000170                                                  .
000170 XTRCT-EXTRACT-EXIT.
000170     EXIT.
000109 INITIALIZATION SECTION.
000109 DEGEN-INITIALIZATION-01.
000109*.REPLACE N0011 BY DEGEN
000109*.REPLACE N0012COPY BY YES
000109*.BREAK PARAMETERS
000109 CLOSEFILES SECTION.
000109 DEGEN-CLOSEFILES-01.
000109     CALL "WSCLOSE".
000109*.COPY SCRPRT#S
000112 SYS99R-CLOSEFILES-01.
000112*.BREAK SYS99R-CLOSEFILES-BEFORE
000112*.BREAK SYS99R-CLOSEFILES-DEFAULT
000112*.DEFAULT
000112     PERFORM SYS99R-CLOSE.
000112*.END-DEFAULT
000112*.BREAK SYS99R-CLOSEFILES-AFTER
000109*.BOTTOM
000109 Z1-GENERATE SECTION.
000109 Z1-GENERATE-01.
000109*.BREAK Z1-GENERATE-BEFORE
000109*.BREAK Z1-GENERATE-DEFAULT
000109*.DEFAULT
000109     PERFORM Z1-INITIALIZE.
000109*. BREAK Z1-AFTER-INITIALIZE %for compatibility w. older vers.
000109 Z1-GENERATE-1. % for compatibility with older versions
000109*. BREAK Z1-BEFORE-DISPLAY %compatibility with older versions
000109     PERFORM Z1-DISPLAY.
000109*. BREAK Z1-AFTER-DISPLAY % compatibility with older versions
000109     PERFORM Z1-LOCATE-FIELD
000109     PERFORM Z1-PF-INTERPRET.
000109     IF Z1-RETURNFLAG = "B" OR Z1-RETURNFLAG = "H"
000109        GO TO Z1-GENERATE-1
000109     ELSE IF Z1-RETURNFLAG = "X"
000109        GO TO Z1-GENERATE-EXIT.
000109     ADD 1 TO Z1-CYCLE.
000109     IF Z1-CYCLE > 1
000109        PERFORM Z1-SETFACS
000109           VARYING Z1-FIELD-I FROM 1 BY 1
000109           UNTIL Z1-FIELD-I > Z1-NFIELDS.
000109     MOVE SPACE TO DEGEN-STATUS Z1-STATUS.
000109     PERFORM Z1-IMAGE-TO-OBJECT.
000109     IF DEGEN-STATUS NOT = SPACE
000109        GO TO Z1-GENERATE-1.
000109*. BREAK Z1-BEFORE-VALIDATE % compatibility with older vers.
000109     PERFORM Z1-VALIDATE.
000109*. BREAK Z1-AFTER-VALIDATE  % compatibility with older vers.
000109     IF Z1-STATUS NOT = SPACE
000109        GO TO Z1-GENERATE-1.
000109 Z1-GENERATE-EXIT.
000109     MOVE ZERO TO Z1-LINE.
000109*.END-DEFAULT
000109*.BREAK Z1-GENERATE-AFTER
000109 Z1-INITIALIZE SECTION.
000109 Z1-INITIALIZE-01.
000109*.BREAK Z1-INITIALIZE-BEFORE
000109*.BREAK Z1-INITIALIZE-DEFAULT
000109*.DEFAULT
000109          MOVE "Z1" TO DEGEN-LASTIMAGE.
000109     PERFORM Z1-SOURCE-TO-IMAGE.
000109     MOVE SPACES TO Z1-WARNFLAGS.
000109     MOVE ZERO TO Z1-CYCLE.
000109     PERFORM Z1-SETFACS VARYING Z1-FIELD-I FROM 1
000109          BY 1 UNTIL Z1-FIELD-I > Z1-NFIELDS.
000109     PERFORM Z1-DISPLAY-MSG.
000109*.END-DEFAULT
000109*.BREAK Z1-INITIALIZE-AFTER
000109 Z1-DISPLAY SECTION.
000109 Z1-DISPLAY-01.
000109*.BREAK Z1-DISPLAY-BEFORE
000109*.BREAK Z1-DISPLAY-DEFAULT
000109*.DEFAULT
000109     IF Z1-LINE = -1
000109        MOVE Z1-ROW TO Z1-LINE.
000109     IF Z1-POS = -1
000109        MOVE Z1-COL TO Z1-POS.
000109     PERFORM Z1-DISACCT-SM.
000109* Move -1 to LINE and POS.  If they are changed, then some custom
000109* code has done something to these variables so we should not fool
000109* with them.  If not, we are at liberty to place the cursor
000109* where we want on the screen - e.g. where we found it, or if
000109* there is an error, at the erroneous entry.
000109     MOVE -1 TO Z1-LINE
000109                Z1-POS.
000109     PERFORM Z1-PFACCT-M.
000109     PERFORM Z1-ERASE-MSGS.
000109     IF Z1-PF = 15
000109               MOVE DEGEN-LOPRO TO Z1-MSG-FAC
000109               MOVE "Screen printed" TO Z1-MSG
000109               PERFORM Z1-DISPLAY-MSG
000109               PERFORM Z-100-PRINT-SCREEN
000109               GO TO Z1-DISPLAY-01.
000109     MOVE DEGEN-FLPRO TO Z1-MSG-FAC.
000109*.END-DEFAULT
000109*.BREAK Z1-DISPLAY-AFTER
000109 Z1-LOCATE-FIELD SECTION.
000109 Z1-LOCATE-FIELD-01.
000109*.BREAK Z1-LOCATE-FIELD-BEFORE
000109*.BREAK Z1-LOCATE-FIELD-DEFAULT
000109*.DEFAULT
000109     MOVE SPACE TO Z1-FTAG, Z1-FOUND.
000109     MOVE ZERO TO Z1-OCCURRENCE.
000109     PERFORM Z1-CHECK-FIELD
000109       VARYING Z1-FIELD-INDEX FROM 1 BY 1
000109       UNTIL Z1-FIELD-INDEX > Z1-NFIELDS OR
000109             Z1-FOUND NOT = SPACE.
000109     IF Z1-FOUND = SPACE
000109        MOVE SPACE TO Z1-FTAG
000109        MOVE ZERO TO Z1-FIELD-INDEX, Z1-OCCURRENCE
000109     ELSE
000109        SUBTRACT 1 FROM Z1-FIELD-INDEX.
000109*.END-DEFAULT
000109*.BREAK Z1-LOCATE-FIELD-AFTER
000109 Z1-CHECK-FIELD SECTION.
000109 Z1-CHECK-FIELD-01.
000109*.BREAK Z1-CHECK-FIELD-BEFORE
000109*.BREAK Z1-CHECK-FIELD-DEFAULT
000109*.DEFAULT
000109     IF Z1-TAG (Z1-FIELD-INDEX) = Z1-FTAG
000109        ADD 1 TO Z1-OCCURRENCE
000109     ELSE
000109        MOVE Z1-TAG (Z1-FIELD-INDEX) TO Z1-FTAG
000109        MOVE 1 TO Z1-OCCURRENCE.
000109     IF Z1-ROW = Z1-COORD-ROW (Z1-FIELD-INDEX)
000109        IF Z1-COL NOT < Z1-COORD-COL (Z1-FIELD-INDEX)
000109           IF Z1-COL < Z1-COORD-COL (Z1-FIELD-INDEX)
000109              +  Z1-LENGTH (Z1-FIELD-INDEX)
000109              MOVE "Y" TO Z1-FOUND.
000109*.END-DEFAULT
000109*.BREAK Z1-CHECK-FIELD-AFTER
000109 Z1-PF-INTERPRET SECTION.
000109 Z1-PF-INTERPRET-01.
000109*.BREAK Z1-PF-INTERPRET-BEFORE
000109*.BREAK Z1-PF-INTERPRET-DEFAULT
000109*.DEFAULT
000109     IF Z1-PF = ZERO
000109          MOVE Z1-PFK (33) TO Z1-RETURNFLAG
000109     ELSE IF Z1-PF > 32
000109          DISPLAY "INVALID VALUE IN PF KEY:", Z1-PF
000109          MOVE "B" TO Z1-RETURNFLAG
000109     ELSE
000109          MOVE Z1-PFK (Z1-PF) TO Z1-RETURNFLAG.
000109     IF Z1-RETURNFLAG = "B"
000109          MOVE Z1-BEEP TO Z1-BEEPFLAG
000109          MOVE "Invalid program function key" TO Z1-MSG
000109          PERFORM Z1-DISPLAY-MSG
000109     .
000109*.END-DEFAULT
000109*.BREAK Z1-PF-INTERPRET-AFTER
000109 Z1-SETFACS SECTION.
000109 Z1-SETFACS-01.
000109*.BREAK Z1-SETFACS-BEFORE
000109*.BREAK Z1-SETFACS-DEFAULT
000109*.DEFAULT
000109     MOVE Z1-COORD-ROW (Z1-FIELD-I) TO Z1-ROW-I.
000109     MOVE Z1-COORD-COL (Z1-FIELD-I) TO Z1-COL-I.
000109     MOVE Z1-FAC (Z1-FIELD-I) TO
000109          Z1-COLX (Z1-ROW-I, Z1-COL-I).
000109*.END-DEFAULT
000109*.BREAK Z1-SETFACS-AFTER
000109 Z1-MARKERROR SECTION.
000109 Z1-MARKERROR-01.
000109*.BREAK Z1-MARKERROR-BEFORE
000109*.BREAK Z1-MARKERROR-DEFAULT
000109*.DEFAULT
000109     MOVE Z1-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL)
000109          TO DEGEN-FAC.
000109     SET DEGEN-FLASHING OF DEGEN-FAC ON.
000109     SET DEGEN-DIM OF DEGEN-FAC OFF.
000109     MOVE DEGEN-FAC TO
000109          Z1-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL).
000109     IF Z1-STATUS = SPACE
000109          IF DEGEN-STATUS NOT = SPACE OR (Z1-SEVERITY
000109               = "W" OR "P")
000109             IF Z1-LINE = -1
000109                MOVE DEGEN-COORD-ROW TO Z1-LINE.
000109     IF Z1-STATUS = SPACE
000109          IF DEGEN-STATUS NOT = SPACE OR (Z1-SEVERITY
000109               = "W" OR "P")
000109             MOVE "E" TO Z1-STATUS
000109             IF Z1-POS = -1
000109                ADD 1 DEGEN-COORD-COL GIVING Z1-POS.
000109     IF DEGEN-STATUS NOT = SPACE
000109          MOVE DEGEN-ERROR-MESSAGE (DEGEN-RETURN-CODE)
000109               TO Z1-MSG.
000109     PERFORM Z1-DISPLAY-MSG.
000109*.END-DEFAULT
000109*.BREAK Z1-MARKERROR-AFTER
000109*.BREAK Z1-DISPLAY-HELPMSG-AFTER
000109 Z1-DISPLAY-MSG SECTION.
000109 Z1-DISPLAY-MSG-01.
000109*. BREAK Z1-BEFORE-MSG-DISPLAY % for compatibility w. old vers.
000109*.BREAK Z1-DISPLAY-MSG-BEFORE
000109*.BREAK Z1-DISPLAY-MSG-DEFAULT
000109*.DEFAULT
000109     IF Z1-MSG NOT = SPACES
000109         MOVE SPACES TO Z1-FINDROWFLAG
000109         IF Z1-MSG-LINENO NOT > 024 AND
000109            Z1-MSG-LINENO > ZERO
000109            PERFORM Z1-SETMSG
000109         ELSE
000109             IF Z1-MSG-LINENO = ZERO
000109                 MOVE 024 TO Z1-MSG-I
000109                 PERFORM Z1-FINDROW
000109                     UNTIL Z1-MSG-LINENO NOT = ZERO
000109                 IF Z1-MSG-LINENO NOT > 024
000109                     PERFORM Z1-SETMSG
000109                 ELSE
000109                     MOVE "F" TO Z1-FINDROWFLAG
000109             ELSE
000109                 MOVE "F" TO Z1-FINDROWFLAG.
000109*.END-DEFAULT
000109*.BREAK Z1-DISPLAY-MSG-AFTER
000109*.    REPLACE FINDROWDEFAULT BY YES % This CAP variable is used to
000109*. BREAK Z1-FINDROW % for compatibility with older versions
000109*. DEFAULT              % for compatibility with older versions
000109*.    REPLACE FINDROWDEFAULT BY NO    % To get around bug
000109 Z1-FINDROW SECTION.
000109 Z1-FINDROW-01.
000109*.BREAK Z1-FINDROW-BEFORE
000109*.BREAK Z1-FINDROW-DEFAULT
000109*.DEFAULT
000109     IF Z1-MSG-FLAG (Z1-MSG-I) = "Y"
000109         MOVE Z1-MSG-I TO Z1-MSG-LINENO
000109     ELSE
000109         IF Z1-MSG-I > 1
000109             SUBTRACT 1 FROM Z1-MSG-I
000109         ELSE
000109             MOVE 999 TO Z1-MSG-LINENO.
000109*.END-DEFAULT
000109*.BREAK Z1-FINDROW-AFTER
000109*. END-DEFAULT          % for compatibility with older versions
000109 Z1-SETMSG SECTION.
000109 Z1-SETMSG-01.
000109*.BREAK Z1-SETMSG-BEFORE
000109*.BREAK Z1-SETMSG-DEFAULT
000109*.DEFAULT
000109     IF Z1-MSG-FLAG (Z1-MSG-LINENO) = "Y"
000109         MOVE "M" TO Z1-MSG-FLAG (Z1-MSG-LINENO)
000109         MOVE Z1-MSG-AND-FAC TO
000109         Z1-ROWX(Z1-MSG-LINENO)
000109         MOVE "S" TO Z1-FINDROWFLAG
000109     ELSE
000109         MOVE "F" TO Z1-FINDROWFLAG.
000109*.END-DEFAULT
000109*.BREAK Z1-SETMSG-AFTER
000109 Z1-DISPLAY-BACKGROUND SECTION.
000109 Z1-DISPLAY-BACKGROUND-01.
000109*.BREAK Z1-DISPLAY-BACKGROUND-BEFORE
000109*.BREAK Z1-DISPLAY-BACKGROUND-DEFAULT
000109*.DEFAULT
000109     COMPUTE DEGEN-STR-OUTPUT-OFFSET-LOW =
000109         Z1-NCOLS * (Z1-ROW-I - 1) + Z1-COL-I - 1.
000109     CALL "STRING" USING DEGEN-STR-QUOTE-MI,
000109         DEGEN-BACKGROUND-STRING,
000109         DEGEN-STR-INPUT-OFFSET,
000109         DEGEN-STR-INPUT-LENGTH,
000109         Z1-REC,
000109         DEGEN-STR-OUTPUT-OFFSET.
000109*.END-DEFAULT
000109*.BREAK Z1-DISPLAY-BACKGROUND-AFTER
000109 Z1-ERASE-MSGS SECTION.
000109 Z1-ERASE-MSGS-01.
000109*.BREAK Z1-ERASE-MSGS-BEFORE
000109*.BREAK Z1-ERASE-MSGS-DEFAULT
000109*.DEFAULT
000109     MOVE SPACES TO Z1-MSG.
000109     IF Z1-MSG-LINENO = ZERO
000109         MOVE 024 TO Z1-MSG-I
000109         PERFORM Z1-FINDROW
000109             UNTIL Z1-MSG-LINENO  NOT = ZERO.
000109     IF Z1-MSG-LINENO NOT > 024
000109         MOVE "Y" TO Z1-MSG-FLAG (Z1-MSG-LINENO)
000109         MOVE DEGEN-LOPRO TO Z1-ROWX(Z1-MSG-LINENO).
000109*.END-DEFAULT
000109*.BREAK Z1-ERASE-MSGS-AFTER
000112*.COPY S0003#F
000112*REPORT FRAME S0003#F AUTHOR WILLIAM KISIN MARCH 1981.
000112*LATEST CHANGE BY LINDA BAUMAN PETO NOV 15, 1984.
000112*       CHANGE MAY 20 1981.
000112*.REPLACE S0003VERSION BY ""
000112*.REPLACE REPORT BY REPORT1 % REPORT NAME
000112*REPLACE FILE BY ;REPORT   % REPORT FILE NAME
000112*.REPLACE TOTPIC BY "S9(11)V9(4)" % PICTURE FOR TOTAL MATRIX.
000112*.REPLACE FIRSTADVANCE BY ZERO % MINIMUM BLANK LINES AT TOP OF PAG
000112*.REPLACE MAXLINECNT BY 60 % LAST DETAIL LINE
000112*.REPLACE PAGEWIDTH BY 132  % PRINTER COLUMNS
000112*.REPLACE NTOTLEVELS BY ZERO % NUMBER OF LEVELS OF TOTALS (BREAKS)
000112*.REPLACE NTOTFIELDS BY ZERO % NUMBER OF FIELDS TO BE TOTALLED
000112*.BREAK PARAMETERS
000112*.INSERT PARAMETERS
000112*.REPLACE MAXLINECNT BY 60
000112*.REPLACE PAGEWIDTH BY 80
000112*.REPLACE NTOTLEVELS BY 1
000112*.REPLACE TOTPIC BY S9(11)V9(4)
000112*.REPLACE NTOTFIELDS BY ZERO
000112*.END-INSERT
000112*.REPLACEON ; !
000112* REQUIRES USER SUPPLIED SECTIONS - SYS99R-DE-PRINT
000112*                                 - SYS99R-PH-PRINT
000112*                                 - SYS99R-PF-PRINT
000112 SYS99R-DE-PRINT SECTION.
000112 SYS99R-DE-PRINT-01.
000112*.BREAK SYS99R-DE-PRINT-BEFORE
000112*.BREAK SYS99R-DE-PRINT-DEFAULT
000112*.DEFAULT
000112*.BREAK SYS99R-START-DE-PRINT
000112     PERFORM SYS99R-DE-DE001-PRINT.
000112     PERFORM SYS99R-DE-DE002-PRINT.
000112     PERFORM SYS99R-DE-DE003-PRINT.
000112     PERFORM SYS99R-DE-DE004-PRINT.
000112     PERFORM SYS99R-DE-DE005-PRINT.
000112     PERFORM SYS99R-DE-DE006-PRINT.
000112     PERFORM SYS99R-DE-DE007-PRINT.
000112     PERFORM SYS99R-DE-DE008-PRINT.
000112     PERFORM SYS99R-DE-DE009-PRINT.
000112     PERFORM SYS99R-DE-DE010-PRINT.
000112     PERFORM SYS99R-DE-DE011-PRINT.
000112     PERFORM SYS99R-DE-DE012-PRINT.
000112     PERFORM SYS99R-DE-DE013-PRINT.
000112     PERFORM SYS99R-DE-DE014-PRINT.
000112     PERFORM SYS99R-DE-DE015-PRINT.
000112     PERFORM SYS99R-DE-DE016-PRINT.
000112     PERFORM SYS99R-DE-DE017-PRINT.
000112     PERFORM SYS99R-DE-DE018-PRINT.
000112     PERFORM SYS99R-DE-DE019-PRINT.
000112     PERFORM SYS99R-DE-DE020-PRINT.
000112     PERFORM SYS99R-DE-DE021-PRINT.
000112     PERFORM SYS99R-DE-DE022-PRINT.
000112     PERFORM SYS99R-DE-DE023-PRINT.
000112     PERFORM SYS99R-DE-DE024-PRINT.
000112     PERFORM SYS99R-DE-DE025-PRINT.
000112     PERFORM SYS99R-DE-DE026-PRINT.
000112*.BREAK SYS99R-END-DE-PRINT
000112 SYS99R-END-DE-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-PRINT-AFTER
000112 SYS99R-DE-DE001-PRINT SECTION.
000112 SYS99R-DE-DE001-PRINT-01.
000112*.BREAK SYS99R-DE-DE001-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE001-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE001-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE001-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE001-PRINT
000112     IF SYS99R-DE-DE001-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE001-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE001-PRINT
000112     MOVE SYS99R-DE-DE001-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-USERID-WRK TO SYS99R-DE-DE001-001.
000112     MOVE SYS99-USER-NAME-WRK TO SYS99R-DE-DE001-002.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE001-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE001-PRINT
000112 SYS99R-DE-DE001-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE001-PRINT-AFTER
000112 SYS99R-DE-DE002-PRINT SECTION.
000112 SYS99R-DE-DE002-PRINT-01.
000112*.BREAK SYS99R-DE-DE002-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE002-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE002-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE002-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE002-PRINT
000112     IF SYS99R-DE-DE002-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE002-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE002-PRINT
000112     MOVE SYS99R-DE-DE002-LITERALS TO SYS99R-REC.
000112     COMPUTE SYS99R-DE-DE002-001 ROUNDED = SYS99-DATE-WRK + 0
000112     SIZE ERROR MOVE SYS99R-SIZEERROR TO SYS99R-DE-DE002-A001.
000112     COMPUTE SYS99R-DE-DE002-002 ROUNDED = SYS99-TIME-WRK + 0
000112     SIZE ERROR MOVE SYS99R-SIZEERROR TO SYS99R-DE-DE002-A002.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE002-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE002-PRINT
000112 SYS99R-DE-DE002-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE002-PRINT-AFTER
000112 SYS99R-DE-DE003-PRINT SECTION.
000112 SYS99R-DE-DE003-PRINT-01.
000112*.BREAK SYS99R-DE-DE003-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE003-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE003-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE003-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE003-PRINT
000112     IF SYS99R-DE-DE003-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE003-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE003-PRINT
000112     MOVE SYS99R-DE-DE003-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE003-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE003-PRINT
000112 SYS99R-DE-DE003-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE003-PRINT-AFTER
000112 SYS99R-DE-DE004-PRINT SECTION.
000112 SYS99R-DE-DE004-PRINT-01.
000112*.BREAK SYS99R-DE-DE004-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE004-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE004-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE004-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE004-PRINT
000112     IF SYS99R-DE-DE004-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE004-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE004-PRINT
000112     MOVE SYS99R-DE-DE004-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE004-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE004-PRINT
000112 SYS99R-DE-DE004-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE004-PRINT-AFTER
000112 SYS99R-DE-DE005-PRINT SECTION.
000112 SYS99R-DE-DE005-PRINT-01.
000112*.BREAK SYS99R-DE-DE005-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE005-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE005-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE005-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE005-PRINT
000112     IF SYS99R-DE-DE005-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE005-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE005-PRINT
000112     MOVE SYS99R-DE-DE005-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE005-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE005-PRINT
000112 SYS99R-DE-DE005-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE005-PRINT-AFTER
000112 SYS99R-DE-DE006-PRINT SECTION.
000112 SYS99R-DE-DE006-PRINT-01.
000112*.BREAK SYS99R-DE-DE006-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE006-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE006-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE006-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE006-PRINT
000112     IF SYS99R-DE-DE006-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE006-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE006-PRINT
000112     MOVE SYS99R-DE-DE006-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE006-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE006-PRINT
000112 SYS99R-DE-DE006-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE006-PRINT-AFTER
000112 SYS99R-DE-DE007-PRINT SECTION.
000112 SYS99R-DE-DE007-PRINT-01.
000112*.BREAK SYS99R-DE-DE007-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE007-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE007-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE007-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE007-PRINT
000112     IF SYS99R-DE-DE007-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE007-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE007-PRINT
000112     MOVE SYS99R-DE-DE007-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE007-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE007-PRINT
000112 SYS99R-DE-DE007-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE007-PRINT-AFTER
000112 SYS99R-DE-DE008-PRINT SECTION.
000112 SYS99R-DE-DE008-PRINT-01.
000112*.BREAK SYS99R-DE-DE008-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE008-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE008-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE008-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE008-PRINT
000112     IF SYS99R-DE-DE008-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE008-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE008-PRINT
000112     MOVE SYS99R-DE-DE008-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-PROGRAM TO SYS99R-DE-DE008-001.
000112     MOVE SYS99-CONTEXT TO SYS99R-DE-DE008-002.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE008-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE008-PRINT
000112 SYS99R-DE-DE008-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE008-PRINT-AFTER
000112 SYS99R-DE-DE009-PRINT SECTION.
000112 SYS99R-DE-DE009-PRINT-01.
000112*.BREAK SYS99R-DE-DE009-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE009-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE009-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE009-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE009-PRINT
000112     IF SYS99R-DE-DE009-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE009-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE009-PRINT
000112     MOVE SYS99R-DE-DE009-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-FILE TO SYS99R-DE-DE009-001.
000112     MOVE SYS99-STATUS TO SYS99R-DE-DE009-002.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE009-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE009-PRINT
000112 SYS99R-DE-DE009-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE009-PRINT-AFTER
000112 SYS99R-DE-DE010-PRINT SECTION.
000112 SYS99R-DE-DE010-PRINT-01.
000112*.BREAK SYS99R-DE-DE010-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE010-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE010-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE010-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE010-PRINT
000112     IF SYS99R-DE-DE010-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE010-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE010-PRINT
000112     MOVE SYS99R-DE-DE010-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-LIBRARY TO SYS99R-DE-DE010-001.
000112     MOVE SYS99-FUNCTION TO SYS99R-DE-DE010-002.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE010-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE010-PRINT
000112 SYS99R-DE-DE010-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE010-PRINT-AFTER
000112 SYS99R-DE-DE011-PRINT SECTION.
000112 SYS99R-DE-DE011-PRINT-01.
000112*.BREAK SYS99R-DE-DE011-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE011-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE011-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE011-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE011-PRINT
000112     IF SYS99R-DE-DE011-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE011-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE011-PRINT
000112     MOVE SYS99R-DE-DE011-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-VOLUME TO SYS99R-DE-DE011-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE011-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE011-PRINT
000112 SYS99R-DE-DE011-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE011-PRINT-AFTER
000112 SYS99R-DE-DE012-PRINT SECTION.
000112 SYS99R-DE-DE012-PRINT-01.
000112*.BREAK SYS99R-DE-DE012-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE012-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE012-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE012-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE012-PRINT
000112     IF SYS99R-DE-DE012-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE012-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE012-PRINT
000112     MOVE SYS99R-DE-DE012-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-KEY-NO TO SYS99R-DE-DE012-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE012-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE012-PRINT
000112 SYS99R-DE-DE012-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE012-PRINT-AFTER
000112 SYS99R-DE-DE013-PRINT SECTION.
000112 SYS99R-DE-DE013-PRINT-01.
000112*.BREAK SYS99R-DE-DE013-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE013-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE013-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE013-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE013-PRINT
000112     IF SYS99R-DE-DE013-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE013-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE013-PRINT
000112     MOVE SYS99R-DE-DE013-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-KEY TO SYS99R-DE-DE013-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE013-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE013-PRINT
000112 SYS99R-DE-DE013-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE013-PRINT-AFTER
000112 SYS99R-DE-DE014-PRINT SECTION.
000112 SYS99R-DE-DE014-PRINT-01.
000112*.BREAK SYS99R-DE-DE014-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE014-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE014-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE014-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE014-PRINT
000112     IF SYS99R-DE-DE014-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE014-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE014-PRINT
000112     MOVE SYS99R-DE-DE014-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-KEY-HEX TO SYS99R-DE-DE014-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE014-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE014-PRINT
000112 SYS99R-DE-DE014-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE014-PRINT-AFTER
000112 SYS99R-DE-DE015-PRINT SECTION.
000112 SYS99R-DE-DE015-PRINT-01.
000112*.BREAK SYS99R-DE-DE015-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE015-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE015-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE015-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE015-PRINT
000112     IF SYS99R-DE-DE015-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE015-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE015-PRINT
000112     MOVE SYS99R-DE-DE015-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE015-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE015-PRINT
000112 SYS99R-DE-DE015-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE015-PRINT-AFTER
000112 SYS99R-DE-DE016-PRINT SECTION.
000112 SYS99R-DE-DE016-PRINT-01.
000112*.BREAK SYS99R-DE-DE016-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE016-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE016-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE016-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE016-PRINT
000112     IF SYS99R-DE-DE016-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE016-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE016-PRINT
000112     MOVE SYS99R-DE-DE016-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-RECORD TO SYS99R-DE-DE016-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE016-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE016-PRINT
000112 SYS99R-DE-DE016-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE016-PRINT-AFTER
000112 SYS99R-DE-DE017-PRINT SECTION.
000112 SYS99R-DE-DE017-PRINT-01.
000112*.BREAK SYS99R-DE-DE017-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE017-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE017-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE017-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE017-PRINT
000112     IF SYS99R-DE-DE017-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE017-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE017-PRINT
000112     MOVE SYS99R-DE-DE017-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-RECORD-HEX-1 TO SYS99R-DE-DE017-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE017-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE017-PRINT
000112 SYS99R-DE-DE017-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE017-PRINT-AFTER
000112 SYS99R-DE-DE018-PRINT SECTION.
000112 SYS99R-DE-DE018-PRINT-01.
000112*.BREAK SYS99R-DE-DE018-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE018-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE018-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE018-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE018-PRINT
000112     IF SYS99R-DE-DE018-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE018-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE018-PRINT
000112     MOVE SYS99R-DE-DE018-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-RECORD-HEX-2 TO SYS99R-DE-DE018-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE018-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE018-PRINT
000112 SYS99R-DE-DE018-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE018-PRINT-AFTER
000112 SYS99R-DE-DE019-PRINT SECTION.
000112 SYS99R-DE-DE019-PRINT-01.
000112*.BREAK SYS99R-DE-DE019-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE019-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE019-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE019-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE019-PRINT
000112     IF SYS99R-DE-DE019-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE019-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE019-PRINT
000112     MOVE SYS99R-DE-DE019-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE019-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE019-PRINT
000112 SYS99R-DE-DE019-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE019-PRINT-AFTER
000112 SYS99R-DE-DE020-PRINT SECTION.
000112 SYS99R-DE-DE020-PRINT-01.
000112*.BREAK SYS99R-DE-DE020-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE020-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE020-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE020-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE020-PRINT
000112     IF SYS99R-DE-DE020-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE020-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE020-PRINT
000112     MOVE SYS99R-DE-DE020-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-MESSAGE1 TO SYS99R-DE-DE020-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE020-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE020-PRINT
000112 SYS99R-DE-DE020-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE020-PRINT-AFTER
000112 SYS99R-DE-DE021-PRINT SECTION.
000112 SYS99R-DE-DE021-PRINT-01.
000112*.BREAK SYS99R-DE-DE021-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE021-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE021-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE021-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE021-PRINT
000112     IF SYS99R-DE-DE021-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE021-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE021-PRINT
000112     MOVE SYS99R-DE-DE021-LITERALS TO SYS99R-REC.
000112     MOVE SYS99-MESSAGE2 TO SYS99R-DE-DE021-001.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE021-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE021-PRINT
000112 SYS99R-DE-DE021-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE021-PRINT-AFTER
000112 SYS99R-DE-DE022-PRINT SECTION.
000112 SYS99R-DE-DE022-PRINT-01.
000112*.BREAK SYS99R-DE-DE022-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE022-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE022-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE022-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE022-PRINT
000112     IF SYS99R-DE-DE022-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE022-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE022-PRINT
000112     MOVE SYS99R-DE-DE022-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE022-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE022-PRINT
000112 SYS99R-DE-DE022-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE022-PRINT-AFTER
000112 SYS99R-DE-DE023-PRINT SECTION.
000112 SYS99R-DE-DE023-PRINT-01.
000112*.BREAK SYS99R-DE-DE023-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE023-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE023-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE023-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE023-PRINT
000112     IF SYS99R-DE-DE023-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE023-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE023-PRINT
000112     MOVE SYS99R-DE-DE023-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE023-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE023-PRINT
000112 SYS99R-DE-DE023-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE023-PRINT-AFTER
000112 SYS99R-DE-DE024-PRINT SECTION.
000112 SYS99R-DE-DE024-PRINT-01.
000112*.BREAK SYS99R-DE-DE024-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE024-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE024-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE024-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE024-PRINT
000112     IF SYS99R-DE-DE024-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE024-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE024-PRINT
000112     MOVE SYS99R-DE-DE024-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE024-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE024-PRINT
000112 SYS99R-DE-DE024-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE024-PRINT-AFTER
000112 SYS99R-DE-DE025-PRINT SECTION.
000112 SYS99R-DE-DE025-PRINT-01.
000112*.BREAK SYS99R-DE-DE025-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE025-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE025-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE025-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE025-PRINT
000112     IF SYS99R-DE-DE025-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE025-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE025-PRINT
000112     MOVE SYS99R-DE-DE025-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE025-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE025-PRINT
000112 SYS99R-DE-DE025-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE025-PRINT-AFTER
000112 SYS99R-DE-DE026-PRINT SECTION.
000112 SYS99R-DE-DE026-PRINT-01.
000112*.BREAK SYS99R-DE-DE026-PRINT-BEFORE
000112*.BREAK SYS99R-DE-DE026-PRINT-DEFAULT
000112*.DEFAULT
000112     IF SYS99R-DE-DE026-LEVELFLAG (SYS99R-ADDLEVEL)
000112      NOT = SPACE GO TO SYS99R-DE-DE026-PRINT-EXIT.
000112*.BREAK SYS99R-ENABLE-DE-DE026-PRINT
000112     IF SYS99R-DE-DE026-ENABLEFLAG NOT = SPACE
000112         GO TO SYS99R-DE-DE026-PRINT-EXIT.
000112*.BREAK SYS99R-START-DE-DE026-PRINT
000112     MOVE SYS99R-DE-DE026-LITERALS TO SYS99R-REC.
000112     MOVE 1 TO SYS99R-NADVANCE-SAVE.
000112     IF 1 > SYS99R-NADVANCE
000112       MOVE 1 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-READY-DE-DE026-PRINT
000112     PERFORM SYS99R-PRINT.
000112     MOVE 0 TO SYS99R-NADVANCE.
000112*.BREAK SYS99R-END-DE-DE026-PRINT
000112 SYS99R-DE-DE026-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-DE-DE026-PRINT-AFTER
000112 SYS99R-CH-PRINT SECTION.
000112 SYS99R-CH-PRINT-01.
000112*.BREAK SYS99R-CH-PRINT-BEFORE
000112*.BREAK SYS99R-CH-PRINT-DEFAULT
000112*.DEFAULT
000112*.BREAK SYS99R-START-CH-PRINT
000112*.BREAK SYS99R-END-CH-PRINT
000112 SYS99R-END-CH-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-CH-PRINT-AFTER
000112 SYS99R-CF-PRINT SECTION.
000112 SYS99R-CF-PRINT-01.
000112*.BREAK SYS99R-CF-PRINT-BEFORE
000112*.BREAK SYS99R-CF-PRINT-DEFAULT
000112*.DEFAULT
000112*.BREAK SYS99R-START-CF-PRINT
000112*.BREAK SYS99R-END-CF-PRINT
000112 SYS99R-END-CF-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-CF-PRINT-AFTER
000112 SYS99R-PH-PRINT SECTION.
000112 SYS99R-PH-PRINT-01.
000112*.BREAK SYS99R-PH-PRINT-BEFORE
000112*.BREAK SYS99R-PH-PRINT-DEFAULT
000112*.DEFAULT
000112*.BREAK SYS99R-START-PH-PRINT
000112*.BREAK SYS99R-END-PH-PRINT
000112 SYS99R-END-PH-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-PH-PRINT-AFTER
000112 SYS99R-PF-PRINT SECTION.
000112 SYS99R-PF-PRINT-01.
000112*.BREAK SYS99R-PF-PRINT-BEFORE
000112*.BREAK SYS99R-PF-PRINT-DEFAULT
000112*.DEFAULT
000112*.BREAK SYS99R-START-PF-PRINT
000112*.BREAK SYS99R-END-PF-PRINT
000112 SYS99R-END-PF-PRINT-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-PF-PRINT-AFTER
000112 SYS99R-BREAKTEST SECTION.
000112 SYS99R-BREAKTEST-01.
000112*.BREAK SYS99R-BREAKTEST-BEFORE
000112*.BREAK SYS99R-BREAKTEST-DEFAULT
000112*.DEFAULT
000112*.BREAK SYS99R-START-BREAKTEST
000112*.BREAK SYS99R-END-BREAKTEST
000112*.END-DEFAULT
000112*.BREAK SYS99R-BREAKTEST-AFTER
000112 SYS99R-SAVE-TRIGGERS SECTION.
000112 SYS99R-SAVE-TRIGGERS-01.
000112*.BREAK SYS99R-SAVE-TRIGGERS-BEFORE
000112*.BREAK SYS99R-SAVE-TRIGGERS-DEFAULT
000112*.DEFAULT
000112 SYS99R-SAVE-TRIGGERS-EXIT.
000112*.END-DEFAULT
000112*.BREAK SYS99R-SAVE-TRIGGERS-AFTER
000112 SYS99R-INITIALIZE-LEVELFLAGS SECTION.
000112 SYS99R-INIT-LEVELFLAGS-01.
000112*.BREAK SYS99R-INITIALIZE-LEVELFLAGS-BEFORE
000112*.BREAK SYS99R-INITIALIZE-LEVELFLAGS-DEFAULT
000112*.DEFAULT
000112     MOVE " " TO SYS99R-DE-DE001-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE002-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE003-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE004-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE005-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE006-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE007-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE008-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE009-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE010-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE011-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE012-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE013-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE014-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE015-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE016-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE017-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE018-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE019-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE020-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE021-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE022-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE023-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE024-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE025-LEVELFLAGS.
000112     MOVE " " TO SYS99R-DE-DE026-LEVELFLAGS.
000112*.END-DEFAULT
000112*.BREAK SYS99R-INITIALIZE-LEVELFLAGS-AFTER
