000001******************************************************************
000002*    QAWSFNS -  Program Security Level Maintenance
000003******************************************************************
000004*             Modification History
000005*
000006*   June 19 1990  C. Lim
000007*       - converted to UNIX
000008******************************************************************
000010 IDENTIFICATION DIVISION.
000019 PROGRAM-ID. QAWSFNS.
000021 AUTHOR.
000022 DATE-WRITTEN.
000024 ENVIRONMENT DIVISION.
000025 CONFIGURATION section.
000120 FIGURATIVE-CONSTANTS.
000120     HIPRO             IS "84"
000120     LOPRO             IS "8C"
000120     LOPRONUM          IS "8E"
000120     FLPRO             IS "94"
000120     SUPRO             IS "9C"
000120     SOLID             IS "0B"
000261     RDMN-UNDERSCORE  IS "20"
000261     RDMN-NUMERIC     IS "02"
000269     S1-FIG-CON-8C         IS "8C"
000269     S1-FIG-CON-A1         IS "A1"
000269     S1-FIG-CON-AD         IS "AD"
000269     S2-FIG-CON-8C         IS "8C"
000269     S2-FIG-CON-8D         IS "8D"
000269     S2-FIG-CON-8E         IS "8E"
000269     S2-FIG-CON-A1         IS "A1"
000269     S2-FIG-CON-AD         IS "AD"
000272     S1-NUMERIC-ERROR      IS "3F"
000272     S2-NUMERIC-ERROR      IS "3F"
000272     DEGEN-PROTECTED  IS "04"
000272     DEGEN-DIM        IS "08"
000272     DEGEN-SOLID      IS "0B"
000272     DEGEN-FLASHING   IS "10"
000272     DEGEN-HIPRO      IS "84"
000272     DEGEN-LOPRO      IS "8C"
000272     DEGEN-FLPRO      IS "94"
000272     DEGEN-HIMODUPRUL IS "A1"
000272     DEGEN-HIMODUL    IS "A0"
000272     DEGEN-HIMODNUMUL IS "A2"
000120     .
000024 INPUT-OUTPUT SECTION.
000024 FILE-CONTROL.
000024 DATA DIVISION.
000024 FILE SECTION.
000024 WORKING-STORAGE SECTION.
000269 01  S1-SCREENLINES USAGE BINARY VALUE 24.
000269 01  S1-SFIRST     USAGE BINARY VALUE 7.
000269 01  S1-SLAST       USAGE BINARY VALUE 24.
000269 01  S2-SCREENLINES USAGE BINARY VALUE 24.
000269 01  S2-SFIRST     USAGE BINARY VALUE 8.
000269 01  S2-SLAST       USAGE BINARY VALUE 20.
000024 01  GET-FUNC-TYPE          PIC XX   VALUE "I ".
000024 01  GET-FORM-TYPE          PIC X    VALUE "R".
000024 01  GET-PRNAME             PIC X(8) VALUE "DATA".
000024 01  GET-PFKEY-REC          PIC X    VALUE "@".
000024 01  GET-MESS-ID            PIC X(4) VALUE SPACES.
000024 01  GET-MESS-SOURCE        PIC X(6) VALUE SPACES.
000024 01  GET-MESS-TEXT          PIC X    VALUE SPACES.
000024 01  GET-MESS-TEXT-LENGTH.
000024     05  FILLER USAGE IS      BINARY  VALUE ZERO.
000024     05  FILLER USAGE IS      BINARY  VALUE ZERO.
000024 01  GET-KEYWORD-TYPE       PIC X    VALUE "K".
000024 01  GET-KEYWORD            PIC X(8) VALUE "PARMS".
000024 01  GET-RECEIVER-FIELD              VALUE SPACES.
000024     05  SY104-SS1-PORT      PIC X(4).
000024     05  SY104-SS2-PORT      PIC X(4).
000024     05  SY104-DATASET      PIC X(4).
000024     05  GET-SECURITY-DATA.
000024         10  SY104-USER-SECURITY-CLASS  PIC X(3).
000024         10  SY104-PROG-SECURITY-TYPE   PIC X.
000024     05  GET-MENU-OPT-TYPE              PIC X.
000024 01  GET-MESSAGE-LENGTH.
000024     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000024     05  FILLER USAGE IS     BINARY   VALUE 17.
000024 01  GET-ROW-OF-FIELD.
000024     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000024     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000024 01  GET-COL-OF-FIELD.
000024     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000024     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000024 01  GET-DATA-TYPE          PIC X    VALUE "C".
000024 01  SY104-RECEIVE-PORT     PIC X(4).
000024 01  SY104-RECEIVE-PORT-RED REDEFINES SY104-RECEIVE-PORT
000024                             PIC 9(4).
000024*$WANG_CODE
000024 01  SY104-EXTRACT-PORT.
000024     05  FILLER  BINARY VALUE ZERO.
000024     05  SY104-BIN-PORT BINARY VALUE ZERO.
000024 01  SY104-KEYWORD          PIC XX VALUE "T#".
000024 01  SY104-INTTASK-PORT     PIC X(4).
000024 01  SY104-INTTASK-FUNC     PIC XX.
000024 01  SY104-INTTASK-CHECK-TYPE  PIC X.
000024 01  SY104-INTTASK-RCODE.
000024     05  FILLER USAGE IS BINARY VALUE ZERO.
000024     05  SY104-INTTASK-ECODE USAGE IS BINARY VALUE ZERO.
000024 01  SY104-INTTASK-MSG-LEN.
000024     05  FILLER USAGE IS BINARY VALUE ZERO.
000024     05  SY104-INTTASK-LENGTH USAGE IS BINARY VALUE ZERO.
000024 01  SY104-INTTASK-INTERVAL.
000024     05  FILLER USAGE IS BINARY VALUE ZERO.
000024     05  SY104-INTTASK-WAIT BINARY VALUE 3000.
000024*$WANG_END
000025 01  STDERR-SAVE-FUNCTION  PIC X(3) VALUE SPACES.
000025 01  STDERR-LITERALS.
000025     05  STDERR-C     PIC X   VALUE "C".   % Close
000025     05  STDERR-D     PIC X   VALUE "D".   %
000025     05  STDERR-F     PIC X   VALUE "F".   %
000025     05  STDERR-N     PIC X   VALUE "N".   % No
000025     05  STDERR-O     PIC X   VALUE "O".   % Open
000025     05  STDERR-S     PIC X   VALUE "S".   % Sort
000025     05  STDERR-T     PIC X   VALUE "T".   % Transaction
000025     05  STDERR-W     PIC X   VALUE "W".   % Work
000025     05  STDERR-Y     PIC X   VALUE "Y".   % Yes
000025     05  STDERR-00    PIC XX  VALUE "00".  %
000025     05  STDERR-23    PIC XX  VALUE "23".  %
000025     05  STDERR-CL    PIC XX  VALUE "CL".  % Close
000025     05  STDERR-DL    PIC XX  VALUE "DL".  % Delete
000025     05  STDERR-FE    PIC XX  VALUE "FE".  % Fatal Error
000025     05  STDERR-GC    PIC XX  VALUE "GC".  % Logfile Close
000025     05  STDERR-GIN   PIC XX  VALUE "GI".  % Logfile Open Input
000025     05  STDERR-GRN   PIC XXX VALUE "GRN". % Logfile Read Next
000025     05  STDERR-GSH   PIC XX  VALUE "GS".  % Logfile Open Shared
000025     05  STDERR-IN    PIC XX  VALUE "IN".  % Open Input
000025     05  STDERR-IO    PIC XX  VALUE "IO".  % Open I-O
000025     05  STDERR-FLV   PIC XXX VALUE "FLV". % File/Lib/Vol
000025     05  STDERR-OU    PIC XX  VALUE "OU".  % Open Output
000025     05  STDERR-RK    PIC XX  VALUE "RK".  % Read
000025     05  STDERR-RN    PIC XX  VALUE "RN".  % Read Next
000025     05  STDERR-RW    PIC XX  VALUE "RW".  % Rewrite
000025     05  STDERR-SH    PIC XX  VALUE "SH".  % Open Shared
000025     05  STDERR-SP    PIC XX  VALUE "SP".  % Open Special Input
000025     05  STDERR-WL    PIC XX  VALUE "WL".  % Work Library
000025     05  STDERR-WR    PIC XX  VALUE "WR".  % Write
000025     05  STDERR-WV    PIC XX  VALUE "WV".  % Work Volume
000025     05  STDERR-RKH   PIC XXX VALUE "RKH". % Read Hold
000025     05  STDERR-RNH   PIC XXX VALUE "RNH". % Read Next Hold
000025     05  STDERR-SEQ   PIC XXX VALUE "SEQ". % Start =
000025     05  STDERR-SNL   PIC XXX VALUE "SNL". % Start Not <
000025     05  STDERR-STG   PIC XXX VALUE "STG". % Start >
000025 01  SYS99-BLOCK.
000025     05  SYS99-PROGRAM             PIC X(8)  VALUE SPACES.
000025     05  SYS99-CONTEXT             PIC X(8)  VALUE SPACES.
000025     05  SYS99-FUNCTION            PIC X(3)  VALUE SPACES.
000025     05  SYS99-FILE                PIC X(8)  VALUE SPACES.
000025     05  SYS99-LIBRARY             PIC X(8)  VALUE SPACES.
000025     05  SYS99-VOLUME              PIC X(6)  VALUE SPACES.
000025     05  SYS99-STATUS              PIC X(2)  VALUE SPACES.
000025     05  SYS99-KEY                 PIC X(70) VALUE SPACES.
000025     05  SYS99-KEY-NO              PIC 9(02) VALUE ZERO.
000025     05  SYS99-RECORD              PIC X(70) VALUE SPACES.
000025     05  SYS99-MESSAGE1            PIC X(70) VALUE SPACES.
000025     05  SYS99-MESSAGE2            PIC X(70) VALUE SPACES.
000025  01  SY104-TRANSACTION-NO          PIC 9(2).
000025  01  SY104-DEADLOCK-FLAG           PIC X(1) VALUE "N".
000025      88  SY104-DEADLOCKED              VALUE "Y".
000025      88  SY104-NOT-DEADLOCKED          VALUE "N".
000025*.COMMENTS
000025*$WANG_CODE
000025  01  STDERR-LINK-PROG              PIC X(8) VALUE "SYS99#O".
000025  01  STDERR-LINK-TYPE              PIC X    VALUE "S".
000025  01  STDERR-LINK-LIB               PIC X(8) VALUE SPACES.
000025  01  STDERR-LINK-VOL               PIC X(6) VALUE SPACES.
000025  01  STDERR-LINK-ARG-COUNT.
000025      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000025      05  STDERR-LINK-PARM-COUNT USAGE IS BINARY VALUE 1.
000025  01  STDERR-LINK-COMP-CODE.
000025      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000025      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000025  01  STDERR-LINK-RET-CODE.
000025      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000025      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000025*$WANG_END
000025
000029 01  SAVE-RECORD                   PIC X(2010) VALUE SPACES.
000120 01  RDMN-FILE-STORAGE.
000120     05 RDMN-FILE-START-KEY      PIC X(30) VALUE SPACES.
000120     05 RDMN-FILERECSAVE         PIC X(2010).
000120     05 RDMN-FILE-STATUS         PIC X(2).
000120     05 RDMN-PRIMEKEY-SAVE PIC X(030)
000120        VALUE LOW-VALUES.
000120     05 RDMN-NEXTKEY-SAVE  PIC X(030)
000120        VALUE LOW-VALUES.
000120     05 RDMN-DEFAULTREC           PIC X(2010).
000120 01  RDMN-STATUS-WORKING-STORAGE.
000120     05 RDMN-STATUS           PIC X(02) VALUE "UI".
000120     05 RDMN-I                PIC 9(04).
000120     05 RDMN-COLPLUS1         PIC 9(04).
000120     05 RDMN-ROW              PIC 9(04).
000120     05 RDMN-HOLDFLAG         PIC X.
000120     05 RDMN-SKIP-READNEXT-FLAG PIC X VALUE SPACE.
000120     05 RDMN-EXIT-FLAG        PIC X  VALUE SPACE.
000120     05 RDMN-RETURN-CODE      PIC 9(3) VALUE 4.
000120 01  RDMN-COPYFLAG            PIC X.
000120 01  RDMN-UPDATE-DISABLEFLAG  PIC X    VALUE "N".
000120     88  RDMN-UPDATE-DISABLE           VALUE "Y".
000120 01  RDMN-TITLE.
000120     05 RDMN-TITLE1           PIC X(09)
000120              VALUE "SY103C".
000120     05 RDMN-TITLE2           PIC X(70) VALUE
000120     "FILE MAINTENANCE PROGRAM".
000120 01  RDMN-OPTS VALUE SPACES.
000120     05 RDMN-OPT1.
000120        10 RDMN-OPT11              PIC X(29).
000120        10 RDMN-OPT12              PIC X(17).
000120        10 RDMN-OPT13              PIC X(18).
000120        10 RDMN-OPT14              PIC X(15).
000120     05 RDMN-OPT2.
000120        10 RDMN-OPT21              PIC X(16).
000120        10 RDMN-OPT22              PIC X(13).
000120        10 RDMN-OPT23              PIC X(17).
000120        10 RDMN-OPT24              PIC X(18).
000120        10 RDMN-OPT25              PIC X(15).
000120     05 RDMN-OPT3.
000120        10 RDMN-OPT31              PIC X(16).
000120        10 RDMN-OPT32              PIC X(30).
000120        10 RDMN-OPT33              PIC X(18).
000120        10 RDMN-OPT34              PIC X(15).
000120 01  RDMN-PFK-TABLE
000120         VALUE " BBB BBBBBBBBBBXBBBBBBBBBBBBBSSBB".
000120     05  RDMN-PFK       PIC X   OCCURS 33.
000120 01  RDMN-MSG.
000120     05  RDMN-MSG1      PIC X(35).
000120     05  RDMN-MSG2      PIC X(35).
000120 77  RDMN-OK            PIC X(33) VALUE
000120          "XBBBBBBBBBBBBBBBBBBBBBBBBBBBBSSB ".
000120 77  RDMN-MODE-LOCK     PIC X VALUE "U".
000120 01  RDMN-S2-TITLE        PIC X(79) VALUE SPACES.
000120 01  RDMN-S2-OPT1.
000120     05 RDMN-S2-OPTS1-1    PIC X(30)
000120            VALUE "(en) select record by cursor".
000120     05 RDMN-S2-OPTS1-2    PIC X(10)
000120            VALUE "(2) top   ".
000120     05 RDMN-S2-OPTS1-3    PIC X(11)
000120            VALUE "(5) next   ".
000120     05 RDMN-S2-OPTS1-4    PIC X(27)
000120            VALUE "(16) exit without selecting".
000120
000120 01  RDMN-S2-OPT2         PIC X(21)
000120            VALUE " (5) start next at   ".
000120 01  RDMN-S2-KEYTABLE.
000120     05 RDMN-S2-KEYSAVE     PIC X(030)
000120          OCCURS 16.
000120 01  RDMN-SEARCH-PFKEY   BINARY    VALUE ZERO.
000120 77  RDMN-SEARCHKEY-SAVE          PIC X(030)
000120     VALUE LOW-VALUES.
000120 77  RDMN-SEARCH-REC-SAVE         PIC X(2010).
000120 77  RDMN-SCROLL-FROM-BOTTOM-FLAG PIC X.
000120 77  RDMN-S2-RECNO        PIC S9(3) COMP.
000120 77  RDMN-S2-RECLAST      PIC S9(3) COMP.
000197 01  RDMN-S2-TABLE.
000197     02  RDMN-S2-LINE-WS           OCCURS 16.
000197         05 RDMN-S2-LINEBOX        PIC X.
000198   05 RDMN-SEARCHFIELD-01 PIC X(02).
000199   05 RDMN-SEARCHFIELD-02 PIC X(05).
000200   05 RDMN-SEARCHFIELD-03 PIC S9(03) COMP.
000261 77  RDMN-FAC-I             PIC S9(5) COMP VALUE ZERO.
000261 77  RDMN-KEY-FLAG          PIC X.
000261 77  RDMN-PROTECT-KEY-FLAG  PIC X.
000261 01  RDMN-FACS-TABLES.
000261     05  RDMN-FACS-TABLE    OCCURS 107.
000261         10  RDMN-FACS-SAVE PIC X(1).
000261         10  RDMN-MOD-FLAG  PIC X.
000269 01  S1-REC.
000269     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(55) VALUE
000269     "SY104#Z1                System Control File Maintenance".
000269     05 FILLER PIC X(18) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(6) VALUE
000269     "SY103C".
000269     05 FILLER PIC X(30) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(22) VALUE
000269     "Program Security Level".
000269     05 FILLER PIC X(127) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(9) VALUE
000269     "Subsystem".
000269     05 FILLER PIC X(71) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(14) VALUE
000269     "Program Number".
000269     05 FILLER PIC X(66) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(14) VALUE
000269     "Security Level".
000269     05 FILLER PIC X(48) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(17) VALUE
000269     "Function Security".
000269     05 FILLER PIC X(63) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(8) VALUE
000269     "Pf keys:".
000269     05 FILLER PIC X(72) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(9) VALUE
000269     "(01 - 16)".
000269     05 FILLER PIC X(71) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(9) VALUE
000269     "(17 - 32)".
000269     05 FILLER PIC X(71) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(7) VALUE
000269     "(enter)".
000269     05 FILLER PIC X(73) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(16) VALUE
000269     "Other Functions:".
000269     05 FILLER PIC X(64) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "34".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "35".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "36".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "37".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "38".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "39".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "40".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "41".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "42".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "43".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "44".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "45".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "46".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "47".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "48".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "49".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "50".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "51".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "52".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "53".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "54".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "55".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "56".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "57".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "58".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "59".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "60".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "61".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "62".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "63".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "64".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "65".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "66".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "67".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "68".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "69".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "70".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "71".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "72".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "73".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "74".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "75".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "76".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "77".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "78".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "79".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "80".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "81".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "82".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "83".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "84".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "85".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "86".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "87".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "88".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "89".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "90".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "91".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "92".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "93".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "94".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "95".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "96".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "97".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "98".
000269     05 FILLER PIC X(6) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(2) VALUE
000269     "99".
000269     05 FILLER PIC X(5) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(3) VALUE
000269     "100".
000269     05 FILLER PIC X(429) VALUE DEGEN-LOPRO.
000269 01  FILLER REDEFINES S1-REC.
000269     05 S1-ROWX OCCURS 24.
000269        10 S1-COLX PIC X OCCURS 80.
000269 01  FILLER REDEFINES S1-REC.
000269     05 FILLER PIC X(275).
000269     05 S1-S1-001 PIC X(2).
000269     05 FILLER PIC X(78).
000269     05 S1-S2-001 PIC X(5).
000269     05 FILLER PIC X(75).
000269     05 S1-A-001 PIC X(3).
000269     05 S1-A-00S1-R REDEFINES S1-A-001 PIC Z(3).
000269     05 FILLER PIC X(213).
000269     05 S1-B-001 PIC X(3).
000269     05 S1-B-00S1-R REDEFINES S1-B-001 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-002 PIC X(3).
000269     05 S1-B-00S2-R REDEFINES S1-B-002 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-003 PIC X(3).
000269     05 S1-B-003-R REDEFINES S1-B-003 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-004 PIC X(3).
000269     05 S1-B-004-R REDEFINES S1-B-004 PIC Z(3).
000269     05 FILLER PIC X(3).
000269     05 S1-B-005 PIC X(3).
000269     05 S1-B-005-R REDEFINES S1-B-005 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-006 PIC X(3).
000269     05 S1-B-006-R REDEFINES S1-B-006 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-007 PIC X(3).
000269     05 S1-B-007-R REDEFINES S1-B-007 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-008 PIC X(3).
000269     05 S1-B-008-R REDEFINES S1-B-008 PIC Z(3).
000269     05 FILLER PIC X(3).
000269     05 S1-B-009 PIC X(3).
000269     05 S1-B-009-R REDEFINES S1-B-009 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-010 PIC X(3).
000269     05 S1-B-010-R REDEFINES S1-B-010 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-011 PIC X(3).
000269     05 S1-B-01S1-R REDEFINES S1-B-011 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-012 PIC X(3).
000269     05 S1-B-01S2-R REDEFINES S1-B-012 PIC Z(3).
000269     05 FILLER PIC X(3).
000269     05 S1-B-013 PIC X(3).
000269     05 S1-B-013-R REDEFINES S1-B-013 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-014 PIC X(3).
000269     05 S1-B-014-R REDEFINES S1-B-014 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-015 PIC X(3).
000269     05 S1-B-015-R REDEFINES S1-B-015 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-016 PIC X(3).
000269     05 S1-B-016-R REDEFINES S1-B-016 PIC Z(3).
000269     05 FILLER PIC X(11).
000269     05 S1-B-017 PIC X(3).
000269     05 S1-B-017-R REDEFINES S1-B-017 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-018 PIC X(3).
000269     05 S1-B-018-R REDEFINES S1-B-018 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-019 PIC X(3).
000269     05 S1-B-019-R REDEFINES S1-B-019 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-020 PIC X(3).
000269     05 S1-B-020-R REDEFINES S1-B-020 PIC Z(3).
000269     05 FILLER PIC X(3).
000269     05 S1-B-021 PIC X(3).
000269     05 S1-B-02S1-R REDEFINES S1-B-021 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-022 PIC X(3).
000269     05 S1-B-02S2-R REDEFINES S1-B-022 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-023 PIC X(3).
000269     05 S1-B-023-R REDEFINES S1-B-023 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-024 PIC X(3).
000269     05 S1-B-024-R REDEFINES S1-B-024 PIC Z(3).
000269     05 FILLER PIC X(3).
000269     05 S1-B-025 PIC X(3).
000269     05 S1-B-025-R REDEFINES S1-B-025 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-026 PIC X(3).
000269     05 S1-B-026-R REDEFINES S1-B-026 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-027 PIC X(3).
000269     05 S1-B-027-R REDEFINES S1-B-027 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-028 PIC X(3).
000269     05 S1-B-028-R REDEFINES S1-B-028 PIC Z(3).
000269     05 FILLER PIC X(3).
000269     05 S1-B-029 PIC X(3).
000269     05 S1-B-029-R REDEFINES S1-B-029 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-030 PIC X(3).
000269     05 S1-B-030-R REDEFINES S1-B-030 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-031 PIC X(3).
000269     05 S1-B-03S1-R REDEFINES S1-B-031 PIC Z(3).
000269     05 FILLER PIC X(1).
000269     05 S1-B-032 PIC X(3).
000269     05 S1-B-03S2-R REDEFINES S1-B-032 PIC Z(3).
000269     05 FILLER PIC X(11).
000269     05 S1-B-033 PIC X(3).
000269     05 S1-B-033-R REDEFINES S1-B-033 PIC Z(3).
000269     05 FILLER PIC X(150).
000269     05 S1-B-034 PIC X(3).
000269     05 S1-B-034-R REDEFINES S1-B-034 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-035 PIC X(3).
000269     05 S1-B-035-R REDEFINES S1-B-035 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-036 PIC X(3).
000269     05 S1-B-036-R REDEFINES S1-B-036 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-037 PIC X(3).
000269     05 S1-B-037-R REDEFINES S1-B-037 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-038 PIC X(3).
000269     05 S1-B-038-R REDEFINES S1-B-038 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-039 PIC X(3).
000269     05 S1-B-039-R REDEFINES S1-B-039 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-040 PIC X(3).
000269     05 S1-B-040-R REDEFINES S1-B-040 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-041 PIC X(3).
000269     05 S1-B-04S1-R REDEFINES S1-B-041 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-042 PIC X(3).
000269     05 S1-B-04S2-R REDEFINES S1-B-042 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-043 PIC X(3).
000269     05 S1-B-043-R REDEFINES S1-B-043 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-044 PIC X(3).
000269     05 S1-B-044-R REDEFINES S1-B-044 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-045 PIC X(3).
000269     05 S1-B-045-R REDEFINES S1-B-045 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-046 PIC X(3).
000269     05 S1-B-046-R REDEFINES S1-B-046 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-047 PIC X(3).
000269     05 S1-B-047-R REDEFINES S1-B-047 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-048 PIC X(3).
000269     05 S1-B-048-R REDEFINES S1-B-048 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-049 PIC X(3).
000269     05 S1-B-049-R REDEFINES S1-B-049 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-050 PIC X(3).
000269     05 S1-B-050-R REDEFINES S1-B-050 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-051 PIC X(3).
000269     05 S1-B-05S1-R REDEFINES S1-B-051 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-052 PIC X(3).
000269     05 S1-B-05S2-R REDEFINES S1-B-052 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-053 PIC X(3).
000269     05 S1-B-053-R REDEFINES S1-B-053 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-054 PIC X(3).
000269     05 S1-B-054-R REDEFINES S1-B-054 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-055 PIC X(3).
000269     05 S1-B-055-R REDEFINES S1-B-055 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-056 PIC X(3).
000269     05 S1-B-056-R REDEFINES S1-B-056 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-057 PIC X(3).
000269     05 S1-B-057-R REDEFINES S1-B-057 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-058 PIC X(3).
000269     05 S1-B-058-R REDEFINES S1-B-058 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-059 PIC X(3).
000269     05 S1-B-059-R REDEFINES S1-B-059 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-060 PIC X(3).
000269     05 S1-B-060-R REDEFINES S1-B-060 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-061 PIC X(3).
000269     05 S1-B-06S1-R REDEFINES S1-B-061 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-062 PIC X(3).
000269     05 S1-B-06S2-R REDEFINES S1-B-062 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-063 PIC X(3).
000269     05 S1-B-063-R REDEFINES S1-B-063 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-064 PIC X(3).
000269     05 S1-B-064-R REDEFINES S1-B-064 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-065 PIC X(3).
000269     05 S1-B-065-R REDEFINES S1-B-065 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-066 PIC X(3).
000269     05 S1-B-066-R REDEFINES S1-B-066 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-067 PIC X(3).
000269     05 S1-B-067-R REDEFINES S1-B-067 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-068 PIC X(3).
000269     05 S1-B-068-R REDEFINES S1-B-068 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-069 PIC X(3).
000269     05 S1-B-069-R REDEFINES S1-B-069 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-070 PIC X(3).
000269     05 S1-B-070-R REDEFINES S1-B-070 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-071 PIC X(3).
000269     05 S1-B-07S1-R REDEFINES S1-B-071 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-072 PIC X(3).
000269     05 S1-B-07S2-R REDEFINES S1-B-072 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-073 PIC X(3).
000269     05 S1-B-073-R REDEFINES S1-B-073 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-074 PIC X(3).
000269     05 S1-B-074-R REDEFINES S1-B-074 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-075 PIC X(3).
000269     05 S1-B-075-R REDEFINES S1-B-075 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-076 PIC X(3).
000269     05 S1-B-076-R REDEFINES S1-B-076 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-077 PIC X(3).
000269     05 S1-B-077-R REDEFINES S1-B-077 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-078 PIC X(3).
000269     05 S1-B-078-R REDEFINES S1-B-078 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-079 PIC X(3).
000269     05 S1-B-079-R REDEFINES S1-B-079 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-080 PIC X(3).
000269     05 S1-B-080-R REDEFINES S1-B-080 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-081 PIC X(3).
000269     05 S1-B-08S1-R REDEFINES S1-B-081 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-082 PIC X(3).
000269     05 S1-B-08S2-R REDEFINES S1-B-082 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-083 PIC X(3).
000269     05 S1-B-083-R REDEFINES S1-B-083 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-084 PIC X(3).
000269     05 S1-B-084-R REDEFINES S1-B-084 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-085 PIC X(3).
000269     05 S1-B-085-R REDEFINES S1-B-085 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-086 PIC X(3).
000269     05 S1-B-086-R REDEFINES S1-B-086 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-087 PIC X(3).
000269     05 S1-B-087-R REDEFINES S1-B-087 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-088 PIC X(3).
000269     05 S1-B-088-R REDEFINES S1-B-088 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-089 PIC X(3).
000269     05 S1-B-089-R REDEFINES S1-B-089 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-090 PIC X(3).
000269     05 S1-B-090-R REDEFINES S1-B-090 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-091 PIC X(3).
000269     05 S1-B-09S1-R REDEFINES S1-B-091 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-092 PIC X(3).
000269     05 S1-B-09S2-R REDEFINES S1-B-092 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-093 PIC X(3).
000269     05 S1-B-093-R REDEFINES S1-B-093 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-094 PIC X(3).
000269     05 S1-B-094-R REDEFINES S1-B-094 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-095 PIC X(3).
000269     05 S1-B-095-R REDEFINES S1-B-095 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-096 PIC X(3).
000269     05 S1-B-096-R REDEFINES S1-B-096 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-097 PIC X(3).
000269     05 S1-B-097-R REDEFINES S1-B-097 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-098 PIC X(3).
000269     05 S1-B-098-R REDEFINES S1-B-098 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-099 PIC X(3).
000269     05 S1-B-099-R REDEFINES S1-B-099 PIC Z(3).
000269     05 FILLER PIC X(5).
000269     05 S1-B-100 PIC X(3).
000269     05 S1-B-100-R REDEFINES S1-B-100 PIC Z(3).
000269     05 FILLER PIC X(107).
000269     05 S1-6-001 PIC X(78).
000269     05 FILLER PIC X(2).
000269     05 S1-7-001 PIC X(78).
000269     05 FILLER PIC X(2).
000269     05 S1-8-001 PIC X(78).
000269     05 FILLER PIC X(2).
000269     05 S1-9-001 PIC X(78).
000269 01  S2-REC.
000269     05 FILLER PIC X(1) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(52) VALUE
000269     "SY104#Z2               Program Security Level Search".
000269     05 FILLER PIC X(21) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(6) VALUE
000269     "SY103C".
000269     05 FILLER PIC X(164) VALUE DEGEN-LOPRO.
000269     05 FILLER PIC X(39) VALUE
000269     "Subsystem   Program      Security Level".
000269     05 FILLER PIC X(1637) VALUE DEGEN-LOPRO.
000269 01  FILLER REDEFINES S2-REC.
000269     05 S2-ROWX OCCURS 24.
000269        10 S2-COLX PIC X OCCURS 80.
000269 01  FILLER REDEFINES S2-REC.
000269     05 FILLER PIC X(162).
000269     05 S2-79-001 PIC X(21).
000269     05 FILLER PIC X(2).
000269     05 S2-S1-001 PIC X(2).
000269     05 FILLER PIC X(1).
000269     05 S2-S2-001 PIC X(5).
000269     05 FILLER PIC X(1).
000269     05 S2-D-001 PIC X(3).
000269     05 S2-D-00S1-R REDEFINES S2-D-001 PIC Z(3).
000269     05 FILLER PIC X(205).
000269     05 S2-7A-001 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-001 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-001 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-001 PIC X(3).
000269     05 S2-C-00S1-R REDEFINES S2-C-001 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-002 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-002 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-002 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-002 PIC X(3).
000269     05 S2-C-00S2-R REDEFINES S2-C-002 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-003 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-003 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-003 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-003 PIC X(3).
000269     05 S2-C-003-R REDEFINES S2-C-003 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-004 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-004 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-004 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-004 PIC X(3).
000269     05 S2-C-004-R REDEFINES S2-C-004 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-005 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-005 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-005 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-005 PIC X(3).
000269     05 S2-C-005-R REDEFINES S2-C-005 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-006 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-006 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-006 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-006 PIC X(3).
000269     05 S2-C-006-R REDEFINES S2-C-006 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-007 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-007 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-007 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-007 PIC X(3).
000269     05 S2-C-007-R REDEFINES S2-C-007 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-008 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-008 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-008 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-008 PIC X(3).
000269     05 S2-C-008-R REDEFINES S2-C-008 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-009 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-009 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-009 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-009 PIC X(3).
000269     05 S2-C-009-R REDEFINES S2-C-009 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-010 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-010 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-010 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-010 PIC X(3).
000269     05 S2-C-010-R REDEFINES S2-C-010 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-011 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-011 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-011 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-011 PIC X(3).
000269     05 S2-C-01S1-R REDEFINES S2-C-011 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-012 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-012 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-012 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-012 PIC X(3).
000269     05 S2-C-01S2-R REDEFINES S2-C-012 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-013 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-013 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-013 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-013 PIC X(3).
000269     05 S2-C-013-R REDEFINES S2-C-013 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-014 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-014 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-014 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-014 PIC X(3).
000269     05 S2-C-014-R REDEFINES S2-C-014 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-015 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-015 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-015 PIC X(5).
000269     05 FILLER PIC X(13).
000269     05 S2-C-015 PIC X(3).
000269     05 S2-C-015-R REDEFINES S2-C-015 PIC Z(3).
000269     05 FILLER PIC X(45).
000269     05 S2-7A-016 PIC X(1).
000269     05 FILLER PIC X(4).
000269     05 S2-A-016 PIC X(2).
000269     05 FILLER PIC X(7).
000269     05 S2-B-016 PIC X(7).
000269     05 FILLER PIC X(11).
000269     05 S2-C-016 PIC X(3).
000269     05 S2-C-016-R REDEFINES S2-C-016 PIC Z(3).
000269     05 FILLER PIC X(125).
000269     05 S2-6S1-001 PIC X(78).
000269     05 FILLER PIC X(2).
000269     05 S2-78-001 PIC X(78).
000269 01  S1-SEQS.
000269     05 S1-S1-SEQ PIC 999 VALUE 1.
000269     05 S1-S2-SEQ PIC 999 VALUE 2.
000269     05 S1-6-SEQ PIC 999 VALUE 3.
000269     05 S1-7-SEQ PIC 999 VALUE 4.
000269     05 S1-8-SEQ PIC 999 VALUE 5.
000269     05 S1-9-SEQ PIC 999 VALUE 6.
000269     05 S1-A-SEQ PIC 999 VALUE 7.
000269     05 S1-B-SEQ PIC 999 VALUE 8.
000269 01  S2-SEQS.
000269     05 S2-S1-SEQ PIC 999 VALUE 1.
000269     05 S2-S2-SEQ PIC 999 VALUE 2.
000269     05 S2-A-SEQ PIC 999 VALUE 3.
000269     05 S2-B-SEQ PIC 999 VALUE 19.
000269     05 S2-C-SEQ PIC 999 VALUE 35.
000269     05 S2-D-SEQ PIC 999 VALUE 51.
000269     05 S2-6S1-SEQ PIC 999 VALUE 52.
000269     05 S2-78-SEQ PIC 999 VALUE 53.
000269     05 S2-79-SEQ PIC 999 VALUE 54.
000269     05 S2-7A-SEQ PIC 999 VALUE 55.
000269 01  S1-FIELD-CONTROLS-INIT.
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1004035003X00+1".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1005035006X00+2".
000269       10 FILLER PIC X VALUE S1-FIG-CON-AD.
000269       10 FILLER PIC X(15) VALUE "0021002079X00+6".
000269       10 FILLER PIC X VALUE S1-FIG-CON-8C.
000269       10 FILLER PIC X(15) VALUE "0022002079X00+7".
000269       10 FILLER PIC X VALUE S1-FIG-CON-8C.
000269       10 FILLER PIC X(15) VALUE "0023002079X00+8".
000269       10 FILLER PIC X VALUE S1-FIG-CON-8C.
000269       10 FILLER PIC X(15) VALUE "0024002079X00+9".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1006035004N00+A".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009011004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009015004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009019004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009023004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009029004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009033004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009037004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009041004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009047004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009051004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009055004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009059004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009065004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009069004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009073004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1009077004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010011004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010015004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010019004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010023004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010029004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010033004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010037004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010041004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010047004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010051004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010055004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010059004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010065004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010069004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010073004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1010077004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1011011004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013004004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013012004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013020004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013028004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013036004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013044004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013052004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013060004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013068004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1013076004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014004004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014012004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014020004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014028004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014036004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014044004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014052004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014060004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014068004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1014076004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015004004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015012004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015020004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015028004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015036004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015044004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015052004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015060004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015068004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1015076004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016004004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016012004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016020004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016028004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016036004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016044004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016052004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016060004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016068004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1016076004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017004004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017012004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017020004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017028004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017036004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017044004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017052004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017060004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017068004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1017076004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018004004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018012004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018020004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018028004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018036004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018044004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018052004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018060004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018068004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1018076004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1019004004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1019012004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1019020004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1019028004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1019036004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1019044004N00+B".
000269       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1019052004N00+B".
000269 01  S1-FIELD-CONTROLS REDEFINES S1-FIELD-CONTROLS-INIT.
000269     05 S1-FIELD-CONTROL OCCURS 107.
000269        10 S1-FAC       PIC X.
000269        10 S1-OBJECT    PIC X.
000269        10 S1-COORD-ROW PIC 999.
000269        10 S1-COORD-COL PIC 999.
000269        10 S1-LENGTH    PIC 999.
000269        10 S1-SIGN      PIC X.
000269        10 S1-DECIMALS  PIC S99            SIGN IS TRAILING
000269           SEPARATE CHARACTER.
000269        10 S1-TAG       PIC X.
000269 01  S1-NFIELDS PIC S9(3) USAGE COMP VALUE 107.
000269 01  S1-NROWS PIC S9(3) USAGE COMP VALUE 24.
000269 01  S1-NCOLS PIC S9(3) USAGE COMP VALUE 80.
000269 01  S1-WARNFLAGS.
000269     05 FILLER PIC X.
000269 01  S1-WARNSAVES.
000269     05 FILLER PIC X.
000269 01  S2-FIELD-CONTROLS-INIT.
000269       10 FILLER PIC X VALUE S2-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1003025003X00+1".
000269       10 FILLER PIC X VALUE S2-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1003028006X00+2".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0006007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0007007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0008007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0009007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0010007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0011007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0012007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0013007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0014007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0015007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0016007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0017007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0018007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0019007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0020007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0021007003X00+A".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0006016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0007016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0008016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0009016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0010016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0011016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0012016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0013016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0014016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0015016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0016016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0017016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0018016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0019016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0020016006X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0021016008X00+B".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0006034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0007034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0008034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0009034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0010034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0011034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0012034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0013034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0014034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0015034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0016034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0017034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0018034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0019034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0020034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000269       10 FILLER PIC X(15) VALUE "0021034004N00+C".
000269       10 FILLER PIC X VALUE S2-FIG-CON-A1.
000269       10 FILLER PIC X(15) VALUE "1003034004N00+D".
000269       10 FILLER PIC X VALUE S2-FIG-CON-AD.
000269       10 FILLER PIC X(15) VALUE "0023002079X00+a".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8C.
000269       10 FILLER PIC X(15) VALUE "0024002079X00+x".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8C.
000269       10 FILLER PIC X(15) VALUE "0003002022X00+y".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0006002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0007002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0008002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0009002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0010002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0011002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0012002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0013002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0014002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0015002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0016002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0017002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0018002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0019002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0020002002X00+z".
000269       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000269       10 FILLER PIC X(15) VALUE "0021002002X00+z".
000269 01  S2-FIELD-CONTROLS REDEFINES S2-FIELD-CONTROLS-INIT.
000269     05 S2-FIELD-CONTROL OCCURS 70.
000269        10 S2-FAC       PIC X.
000269        10 S2-OBJECT    PIC X.
000269        10 S2-COORD-ROW PIC 999.
000269        10 S2-COORD-COL PIC 999.
000269        10 S2-LENGTH    PIC 999.
000269        10 S2-SIGN      PIC X.
000269        10 S2-DECIMALS  PIC S99            SIGN IS TRAILING
000269           SEPARATE CHARACTER.
000269        10 S2-TAG       PIC X.
000269 01  S2-NFIELDS PIC S9(3) USAGE COMP VALUE 70.
000269 01  S2-NROWS PIC S9(3) USAGE COMP VALUE 24.
000269 01  S2-NCOLS PIC S9(3) USAGE COMP VALUE 80.
000269 01  S2-WARNFLAGS.
000269     05 FILLER PIC X.
000269 01  S2-WARNSAVES.
000269     05 FILLER PIC X.
000269 01  S1-PFK-TABLE-INIT PIC X(34)
000269     VALUE " ".
000269 01  S1-PFK-TABLE REDEFINES S1-PFK-TABLE-INIT.
000269     05 S1-PFK PIC X OCCURS 34.
000269 01  S1-MSG-FLAGS-INIT.
000269     05 S1-MSG-FLAGS-50-1 PIC X(50) VALUE
000269          "NNNNNNNNNNNNNNNNNNNYNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000269     05 S1-MSG-FLAGS-50-2 PIC X(50) VALUE
000269          "NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000269 01  S1-MSG-FLAGS REDEFINES S1-MSG-FLAGS-INIT.
000269     05 S1-MSG-FLAG PIC X OCCURS 100.
000269 01  FILLER REDEFINES S1-MSG-FLAGS-INIT.
000269     05 S1-MSG-FLAGS-50 PIC X(50) OCCURS 2.
000269 01  S2-PFK-TABLE-INIT PIC X(34)
000269     VALUE " ".
000269 01  S2-PFK-TABLE REDEFINES S2-PFK-TABLE-INIT.
000269     05 S2-PFK PIC X OCCURS 34.
000269 01  S2-MSG-FLAGS-INIT.
000269     05 S2-MSG-FLAGS-50-1 PIC X(50) VALUE
000269          "NNNNNNNNNNNNNNNNNNNNNYNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000269     05 S2-MSG-FLAGS-50-2 PIC X(50) VALUE
000269          "NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000269 01  S2-MSG-FLAGS REDEFINES S2-MSG-FLAGS-INIT.
000269     05 S2-MSG-FLAG PIC X OCCURS 100.
000269 01  FILLER REDEFINES S2-MSG-FLAGS-INIT.
000269     05 S2-MSG-FLAGS-50 PIC X(50) OCCURS 2.
000272 77  S1-VALIDATEFLAG PIC X VALUE "Y". % "Y" = perform edit
000272                                          %       checks
000272 77  S1-RETURNFLAG PIC X.
000272 77  S1-DUMMY     PIC X.  % Dummy variable to pad CALL
000272 77  S1-SEVERITY PIC X.
000272 77  S1-STATUS PIC X.
000272
000272 01  S1-CURRENT-FIELD.
000272     05  S1-FIELD-INDEX  BINARY.
000272     05  S1-OCCURRENCE   BINARY.
000272     05  S1-FTAG         PIC X.  % Field tag, or blank
000272 77  S1-FOUND            PIC X.
000272 01  S1-MSG-AND-FAC.
000272     05 S1-MSG-FAC PIC X VALUE DEGEN-FLPRO.
000272     05 S1-MSG           VALUE SPACES.
000272        10  S1-FILLER    PIC X(74).
000272        10  S1-MSGEND    PIC X(6).
000272 01  S1-MSG-I PIC S9(3) COMP.
000272 01  S1-MSG-LINENO PIC S9(3) COMP VALUE ZERO.
000272 01  S1-FINDROWFLAG PIC X VALUE SPACES.
000272 77  S1-CYCLE PIC S9(3) COMP.
000272 77  S1-ROW-I PIC S9(3) COMP.
000272 77  S1-COL-I PIC S9(3) COMP.
000272 77  S1-FIELD-I PIC S9(3) COMP.
000272
000272 01  S1-LINE            BINARY VALUE ZERO.
000272 01  S1-POS             BINARY VALUE 1.
000272 01  S1-SIZE            BINARY VALUE 80.
000272 77  S1-FN              PIC XX.
000272 77  S1-BEEPFLAG        PIC X         VALUE SPACE.
000272 77  S1-BEEP            PIC X         VALUE "B".
000272 01  S1-ROW             BINARY VALUE ZERO.
000272 01  S1-COL             BINARY VALUE ZERO.
000272 01  S1-PF              BINARY VALUE 35.
000272 01  S1-PF-DISP         PIC 99 VALUE ZERO.
000272
000272 77  S2-VALIDATEFLAG PIC X VALUE "Y". % "Y" = perform edit
000272                                          %       checks
000272 77  S2-RETURNFLAG PIC X.
000272 77  S2-DUMMY     PIC X.  % Dummy variable to pad CALL
000272 77  S2-SEVERITY PIC X.
000272 77  S2-STATUS PIC X.
000272
000272 01  S2-CURRENT-FIELD.
000272     05  S2-FIELD-INDEX  BINARY.
000272     05  S2-OCCURRENCE   BINARY.
000272     05  S2-FTAG         PIC X.  % Field tag, or blank
000272 77  S2-FOUND            PIC X.
000272 01  S2-MSG-AND-FAC.
000272     05 S2-MSG-FAC PIC X VALUE DEGEN-FLPRO.
000272     05 S2-MSG           VALUE SPACES.
000272        10  S2-FILLER    PIC X(74).
000272        10  S2-MSGEND    PIC X(6).
000272 01  S2-MSG-I PIC S9(3) COMP.
000272 01  S2-MSG-LINENO PIC S9(3) COMP VALUE ZERO.
000272 01  S2-FINDROWFLAG PIC X VALUE SPACES.
000272 77  S2-CYCLE PIC S9(3) COMP.
000272 77  S2-ROW-I PIC S9(3) COMP.
000272 77  S2-COL-I PIC S9(3) COMP.
000272 77  S2-FIELD-I PIC S9(3) COMP.
000272
000272 01  S2-LINE            BINARY VALUE ZERO.
000272 01  S2-POS             BINARY VALUE 1.
000272 01  S2-SIZE            BINARY VALUE 80.
000272 77  S2-FN              PIC XX.
000272 77  S2-BEEPFLAG        PIC X         VALUE SPACE.
000272 77  S2-BEEP            PIC X         VALUE "B".
000272 01  S2-ROW             BINARY VALUE ZERO.
000272 01  S2-COL             BINARY VALUE ZERO.
000272 01  S2-PF              BINARY VALUE 35.
000272 01  S2-PF-DISP         PIC 99 VALUE ZERO.
000272
000272 01  DEGEN-ALPHA PIC X(16).     % alphanumeric screen
000272                                 % variable manipulator
000272 01  FILLER REDEFINES DEGEN-ALPHA.
000272     05 DEGEN-ALPHA-16 PIC X OCCURS 16.
000272 01  DEGEN-FIELD-CONTROL.       % screen variable attributes
000272     05 DEGEN-FAC PIC X.
000272     05 DEGEN-OBJECT    PIC X.
000272     05 DEGEN-COORD-ROW PIC 999.
000272     05 DEGEN-COORD-COL PIC 999.
000272     05 DEGEN-LENGTH    PIC 999.
000272     05 DEGEN-SIGN      PIC X.
000272     05 DEGEN-DECIMALS  PIC S99
000272                      SIGN IS TRAILING SEPARATE CHARACTER.
000272     05 DEGEN-TAG       PIC X.
000272 77  DEGEN-NUMERIC PIC S9(12)V9(4).      % numeric screen
000272                                         % variable manipulator
000272 77  DEGEN-I PIC S9(5) COMP VALUE ZERO.
000272 77  DEGEN-J PIC S9(5) COMP VALUE ZERO.
000272 77  DEGEN-K PIC S9(5) COMP VALUE ZERO.
000272 77  DEGEN-L PIC S9(5) COMP VALUE ZERO.
000272 77  DEGEN-F1 PIC S9(5) COMP VALUE ZERO.
000272 77  DEGEN-F2 PIC S9(5) COMP VALUE ZERO.
000272 77  DEGEN-STATUS               PIC X.
000272 77  DEGEN-RETURN-CODE PIC 9. % return code for bad entries in
000272                               % numeric screen variables - for
000272                               % meaning see following messages
000272 01  DEGEN-ERROR-MESSAGES.
000272     05 FILLER PIC X(30) VALUE "A number is required.         ".
000272     05 FILLER PIC X(30) VALUE "negative value not acceptable ".
000272     05 FILLER PIC X(30) VALUE "decimal point not acceptable  ".
000272     05 FILLER PIC X(30) VALUE "entry too large for this field".
000272 01  FILLER REDEFINES DEGEN-ERROR-MESSAGES.
000272     05 DEGEN-ERROR-MESSAGE PIC X(30) OCCURS 4.
000272 77  DEGEN-EDITFLAG PIC X. % 0 = error in last edit checked item
000272                            % 1 = no error
000272 77  DEGEN-WORKX    PIC X(79)     VALUE SPACES.
000272                     % holding variable for alpha screen variables
000272                     % when they are checked for errors.
000272 77  DEGEN-WORKN    PIC S9(12)V9(6) COMP VALUE ZERO.
000272                     % numeric analogue for DEGEN-WORKX
000272 77  DEGEN-WORK-INTEGER     PIC S9(12) COMP VALUE ZERO.
000272 77  DEGEN-LASTIMAGE PIC X(6) VALUE SPACES.
000272 01  DEGEN-STR-USERSUB-VARIABLES.
000272     05 DEGEN-STR-QUOTE-MV PIC XX VALUE "MV".
000272     05 DEGEN-STR-QUOTE-MI PIC XX VALUE "MI".
000272     05 DEGEN-STR-INPUT-LENGTH.
000272        10 FILLER                      BINARY VALUE 0.
000272        10 DEGEN-STR-INPUT-LENGTH-LOW BINARY VALUE 1.
000272     05 DEGEN-STR-INPUT-OFFSET.
000272        10 FILLER                      BINARY VALUE 0.
000272        10 DEGEN-STR-INPUT-OFFSET-LOW BINARY VALUE 0.
000272     05 DEGEN-STR-OUTPUT-OFFSET.
000272        10 FILLER                       BINARY VALUE 0.
000272        10 DEGEN-STR-OUTPUT-OFFSET-LOW BINARY VALUE 0.
000272 01  DEGEN-BACKGROUND-STRING PIC X(60).
000272 01  FILLER REDEFINES DEGEN-BACKGROUND-STRING.
000272     05 DEGEN-BACKGROUND-X PIC X OCCURS 60.
000272 77  DEGEN-BACKGROUND-LENGTH PIC 999. % Length of above
000272 77  DEGEN-BACKGROUND-I PIC S9(3) COMP.
000272 01  DEGEN-PAUSE-LENGTH.
000272     05  DEGEN-PAUSE1                  BINARY VALUE 0.
000272     05  DEGEN-PAUSE-TIME              BINARY VALUE 200.
000272 01  SCRPRT-WORKSTATION-STATUS        PIC X(01) VALUE "C".
000272 01  SCRPRT-ID                        PIC X(02) VALUE "ID".
000272 01  SCRPRT-UFB-ADDRESS               PIC X(02) VALUE SPACES.
000272 01  SCRPRT-PRINT-TYPE                PIC X(01) VALUE "P".
000272 01  SCRPRT-PRINT-FILE.
000272     05   SCRPRT-FILE-NAME.
000272          10   SCRPRT-NAME-A          PIC X(01) VALUE SPACE.
000272          10   SCRPRT-NAME-B          PIC X(03) VALUE SPACE.
000272          10   SCRPRT-NAME-C          PIC X(01) VALUE SPACE.
000272          10   SCRPRT-NAME-D          PIC X(03) VALUE SPACE.
000272     05   SCRPRT-LIB-NAME.
000272          10   SCRPRT-LIB-A           PIC X(03) VALUE SPACE.
000272          10   SCRPRT-LIB-B           PIC X(05) VALUE SPACE.
000272     05   SCRPRT-VOL-NAME             PIC X(06) VALUE SPACE.
000272 01  SCRPRT-BELL-TIME.
000272     05  FILLER                        BINARY    VALUE ZERO.
000272     05  FILLER                        BINARY    VALUE 1.
000292 01  SY103C-FILE-DATA.
000292     05  SY103C-FILE-STATUS          PIC X(02).
000292         88  SY103C-DUP-KEY          VALUE "22".
000292     05  SY103C-ERROR-FLAG           PIC X(01) VALUE SPACES.
000292         88  SY103C-FOUND                      VALUE "Y".
000292         88  SY103C-NOT-FOUND                  VALUE "N".
000292     05  SY103C-FILE-LOCATION.
000292         10  SY103C-NAME       PIC X(08) VALUE "SY103C".
000292         10  SY103C-LIBRARY    PIC X(08) VALUE SPACES.
000292         10  SY103C-VOLUME     PIC X(06) VALUE SPACES.
000292     05  SY103C-SPACE          PIC S9(5) COMP
000292                                         VALUE 100.
000292
000292     05  SY103C-AUTOLOG-FLAG   PIC X     VALUE "Y".
000292     05  SY103C-FILE-TYPE-FLAG PIC X     VALUE "C".
000292     05  SY103A-ERROR-FLAG          PIC X     VALUE SPACES.
000292         88  SY103A-FOUND                     VALUE "Y".
000292         88  SY103A-NOT-FOUND                 VALUE "N".
000292     05  SY103A-TIME-STAMP-LOG.
000292         10  SY103A-TRANSACTION-LOG PIC X     VALUE SPACES.
000292         10  SY103A-USERID-LOG      PIC X(3)  VALUE SPACES.
000292         10  SY103A-DATE-LOG        PIC 9(6)  VALUE ZERO.
000292         10  SY103A-TIME-LOG        PIC 99V99 VALUE ZERO.
000292     05  SY103C-IOCALL-FILLER          PIC X(05) VALUE SPACES.
000292 01 SY103C-RECORD.
000292     05 SY103C-KEY                  PIC X(30).
000292     05 SY103C-DATA-AREA            PIC X(1980).
000292 01  SY103C-REC-1 REDEFINES SY103C-RECORD.
000292     05  SY103C-KEY-1.
000292         10  SY103C-REC-TYPE-1               PIC X(03).
000292         10  SY103C-SUBSYSTEM-1              PIC X(02).
000292         10  SY103C-KEY-FILLER-1             PIC X(25).
000292     05  SY103C-LEVEL-FLAG-1                 PIC X(01).
000292     05  SY103C-FULL-FUND-FLAG-1             PIC X(01).
000292     05  SY103C-FILLER                       PIC X(1978).
000292
000292 01  SY103C-REC-101 REDEFINES SY103C-RECORD.
000292     05  SY103C-KEY-101.
000292         10  SY103C-REC-TYPE-101             PIC X(03).
000292         10  SY103C-SUBSYSTEM-101            PIC X(02).
000292         10  SY103C-FUND-101                 PIC X(03).
000292         10  SY103C-SUBFUND-101              PIC X(03).
000292         10  SY103C-KEY-FILLER-101           PIC X(19).
000292     05  SY103C-DAC-DUE-TO-101.
000292         10  SY103C-TO-DEPT-GROUP-101        PIC X(03).
000292         10  SY103C-TO-CHARGE-CODE-101       PIC X(18).
000292     05  SY103C-DAC-DUE-FROM-101.
000292         10  SY103C-FROM-DEPT-GROUP-101      PIC X(03).
000292         10  SY103C-FROM-CHARGE-CODE-101     PIC X(18).
000292     05  FILLER                               PIC X(1938).
000292
000292 01  SY103C-REC-102 REDEFINES SY103C-RECORD.
000292     05  SY103C-KEY-102.
000292         10  SY103C-REC-TYPE-102             PIC X(03).
000292         10  SY103C-SUBSYSTEM-102            PIC X(02).
000292         10  SY103C-ACCOUNT-SEQ-102          PIC X(01).
000292         10  SY103C-FUND-102                 PIC X(03).
000292         10  SY103C-SUBFUND-102              PIC X(03).
000292         10  SY103C-KEY-FILLER-102           PIC X(18).
000292     05  SY103C-DAC-DUE-TO-102.
000292         10  SY103C-TO-DEPT-GROUP-102        PIC X(03).
000292         10  SY103C-TO-CHARGE-CODE-102       PIC X(18).
000292     05  SY103C-DAC-DUE-FROM-102.
000292         10  SY103C-FROM-DEPT-GROUP-102      PIC X(03).
000292         10  SY103C-FROM-CHARGE-CODE-102     PIC X(18).
000292     05  FILLER                               PIC X(1938).
000292
000292 01  SY103C-REC-2 REDEFINES SY103C-RECORD.
000292     05  SY103C-KEY-2.
000292         10  SY103C-REC-TYPE-2               PIC X(03).
000292         10  SY103C-SUBSYSTEM-2              PIC X(02).
000292         10  SY103C-USERID-2                 PIC X(08).
000292         10  SY103C-KEY-FILLER-2             PIC X(17).
000292     05  SY103C-USER-SEC-LEVEL               PIC S9(03) COMP.
000292     05  FILLER                               PIC X(1978).
000292
000292 01  SY103C-REC-3 REDEFINES SY103C-RECORD.
000292     05  SY103C-KEY-3.
000292         10  SY103C-REC-TYPE-3               PIC X(03).
000292         10  SY103C-SUBSYSTEM-3              PIC X(02).
000292         10  SY103C-PROGRAM-3                PIC X(05).
000292         10  SY103C-KEY-FILLER-3             PIC X(20).
000292     05  SY103C-PROG-SEC-LEVEL               PIC S9(03) COMP.
000292     05  SY103C-FUNCTION-TABLE.
000292         10  SY103C-FUNCTION-SEC-LEVEL     OCCURS 100 TIMES
000292                                              PIC S9(03) COMP.
000292     05  FILLER                               PIC X(1778).
000292 01  FUND-SUBFUND-CODE                   PIC X(03) VALUE "100".
000292 01  INTERFUND-BALANCE-CODE              PIC X(03) VALUE "101".
000292 01  INTERFUND-WITH-SEQUENCE-CODE        PIC X(03) VALUE "102".
000292 01  USER-SECURITY-CODE                  PIC X(03) VALUE "200".
000292 01  PROG-SECURITY-CODE                  PIC X(03) VALUE "201".
000031 LINKAGE SECTION.
000024 PROCEDURE DIVISION.
000038 MAIN SECTION.
000039 MAIN-1.
000040     PERFORM INITIALIZATION.
000041     PERFORM RDMN-GENERATE.
000044 MAIN-EXIT.
000045     EXIT PROGRAM.             % allows program to be subroutine
000046 MAIN-STOP.
000047     STOP RUN.
000273
000024*.COMMENTS
000024*.REPLACEON
000024*.REPLACE PORT BY YES    % YES, NO OR PORT # IS ALLOWED
000024*.REPLACE PORTINC BY YES % AUTOMATIC INCREMENTING OF PORT
000024*.REPLACE CREATEPORT BY YES % CREATE PORT LOGIC
000024*.REPLACE WAITTIME   BY 3000
000025 SY104-FREE-ALL SECTION.
000025 SY104-FREE-ALL-1.
000025      FREE ALL ON ERROR MOVE RETURN-CODE TO RETURN-CODE.
000025 SY104-FREE-ALL-RETURN.  EXIT.
000025 FATAL-ERROR  SECTION.
000025 FATAL-ERROR-PARA.
000025*.COMMENTS
000025*$WANG_CODE
000025       CALL "WSCLOSE".
000025       CALL "LINK" USING STDERR-LINK-PROG
000025                         STDERR-LINK-TYPE
000025                         STDERR-LINK-LIB
000025                         STDERR-LINK-VOL
000025                         STDERR-LINK-ARG-COUNT
000025                          SYS99-BLOCK
000025                         STDERR-LINK-COMP-CODE
000025                         STDERR-LINK-RET-CODE.
000025*$WANG_ELSE
000025*      CALL "QASYS99" USING SYS99-BLOCK.
000025*$WANG_END
000025 FATAL-ERROR-STOP.
000025     STOP RUN.
000120 RDMN-GENERATE SECTION.
000120 RDMN-GENERATE-1.
000120     PERFORM RDMN-INITIALIZATION.
000120     PERFORM RDMN-FAC-INITIALIZATION.
000120     PERFORM RDMN-OPEN-FILES.
000120     MOVE "DI" TO RDMN-STATUS.
000120     PERFORM RDMN-S1-OPTIONS-LOOP
000120          UNTIL RDMN-EXIT-FLAG = "E".
000120     MOVE "TE" TO RDMN-STATUS.
000120     PERFORM RDMN-CLOSE.
000120     MOVE RDMN-RETURN-CODE TO RETURN-CODE.
000120 RDMN-EXIT.
000120 RDMN-INITIALIZATION SECTION.
000120 RDMN-INITIALIZATION-1.
000120     PERFORM RDMN-SET-ALL-FIELDS-PRO VARYING RDMN-FAC-I FROM
000120          1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000120     MOVE SPACE       TO RDMN-EXIT-FLAG.
000120     MOVE RDMN-TITLE TO RDMN-S2-TITLE.
000120 RDMN-OPEN-FILES SECTION.
000120 RDMN-OPEN-FILES-1.
000120     PERFORM SY103C-OPEN.
000120     PERFORM RDMN-BLANKRECORD.
000120     MOVE SY103C-REC-3 TO
000120           RDMN-FILERECSAVE.
000120     MOVE SY103C-REC-3 TO
000120              RDMN-DEFAULTREC.
000120 RDMN-OPEN-EXIT.
000120 RDMN-BLANKRECORD SECTION.
000120 RDMN-BLANKRECORD-1.
000121     MOVE SPACES TO SY103C-REC-3.
000122     MOVE ZEROES TO SY103C-PROG-SEC-LEVEL.
000123     PERFORM A-100-INIT-SECURITY-TABLE VARYING DEGEN-I FROM 1
000124          BY 1 UNTIL DEGEN-I > 100.
000125
000127 RDMN-BLANKRECORD-EXIT.
000127 RDMN-CLOSE SECTION.
000127 RDMN-CLOSE-1.
000127         PERFORM SY103C-CLOSE.
000127     CALL "WSCLOSE".
000127 RDMN-CLOSE-EXIT.
000127 RDMN-S1-OPTIONS-LOOP SECTION.
000127 RDMN-S1-OPTIONS-LOOP-1.
000127     PERFORM RDMN-SET-UP-SCREEN1.
000127     IF RDMN-SEARCH-PFKEY = ZERO
000127          PERFORM RDMN-S1-GENERATE
000127     ELSE
000127         MOVE RDMN-SEARCH-PFKEY TO S1-PF
000127         MOVE ZERO TO RDMN-SEARCH-PFKEY
000127                                        .
000127     MOVE FLPRO  TO S1-MSG-FAC.
000127     MOVE SPACES TO S1-MSG RDMN-OPTS.
000127     MOVE SPACE  TO S1-BEEPFLAG.
000127     MOVE "Y"    TO S1-VALIDATEFLAG.
000127     PERFORM RDMN-SCREENS1-PF-CHOICE.
000127 RDMN-S1-OPTIONS-LOOP-EXIT.
000127     EXIT.
000127 RDMN-SET-UP-SCREEN1 SECTION.
000127 RDMN-SET-UP-SCREENS1-1.
000127     MOVE "DI" TO RDMN-STATUS.
000127     MOVE SPACES TO RDMN-OPTS.
000127     MOVE "Enter key value then press" TO RDMN-OPT11.
000127     MOVE " (1) display" TO RDMN-OPT12.
000127          MOVE " (3) set defaults" TO RDMN-OPT13
000127          MOVE " " TO RDMN-PFK (3).
000127     MOVE " (5) next" TO RDMN-OPT14.
000127          MOVE " (6) search" TO RDMN-OPT21
000127          MOVE " " TO RDMN-PFK (6).
000127         MOVE " (8) delete" TO RDMN-OPT22
000127         MOVE " " TO RDMN-PFK (8).
000127         MOVE " (9) modify" TO  RDMN-OPT23
000127         MOVE " " TO RDMN-PFK (9).
000127         MOVE "(10) copy" TO RDMN-OPT24
000127         MOVE " " TO RDMN-PFK (10).
000127         MOVE "(11) add" TO RDMN-OPT25
000127         MOVE " " TO RDMN-PFK (11).
000127            MOVE "(12) set tabs" TO RDMN-OPT31
000127            MOVE " " TO RDMN-PFK (12).
000127     IF RDMN-MODE-LOCK NOT = "L"
000127          MOVE "(14) enter lockmode" TO RDMN-OPT32
000127     ELSE
000127          MOVE "(14) exit lockmode" TO RDMN-OPT32.
000127     MOVE " " TO RDMN-PFK (14).
000127     MOVE SPACES      TO RDMN-OPT33.
000127     MOVE "(16) exit" TO RDMN-OPT34.
000127     MOVE 0 TO RDMN-PROTECT-KEY-FLAG.
000127     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000127          FROM 1 BY 1  UNTIL RDMN-FAC-I > S1-NFIELDS
000127     MOVE "B" TO RDMN-PFK (33).
000127     MOVE RDMN-PFK-TABLE TO S1-PFK-TABLE.
000127     MOVE "N" TO S1-VALIDATEFLAG.
000127 RDMN-SET-UP-SCREENS1-EXIT.
000127 RDMN-SCREENS1-PF-CHOICE SECTION.
000127 RDMN-SCREENS1-PF-CHOICE-1.
000128     MOVE PROG-SECURITY-CODE TO SY103C-REC-TYPE-3.
000129     IF S1-PF = 1
000129          PERFORM RDMN-INDEXED-LOOKUP
000129     ELSE IF S1-PF = 3
000129          PERFORM RDMN-CREATE-DEFAULTS
000129     ELSE IF S1-PF = 5
000129          PERFORM RDMN-SEQUENTIAL-LOOKUP
000129     ELSE IF S1-PF = 6
000129          PERFORM RDMN-SEARCH-SCREEN
000129     ELSE IF S1-PF = 8
000129          PERFORM RDMN-DELETE-RECORD
000129     ELSE IF S1-PF = 9
000129          PERFORM RDMN-MODIFY-RECORD
000129     ELSE IF S1-PF = 10
000129          MOVE "Y" TO RDMN-COPYFLAG
000129          PERFORM RDMN-ADD-RECORD
000129
000129     ELSE IF S1-PF = 11
000129          MOVE "N" TO RDMN-COPYFLAG
000129          PERFORM RDMN-ADD-RECORD
000129     ELSE IF S1-PF = 12
000129          PERFORM RDMN-SET-TABS
000129     ELSE IF S1-PF = 14
000129          PERFORM RDMN-MODE-LOCK-UNLOCK
000129     ELSE IF S1-PF = 16
000129          MOVE "E" TO RDMN-EXIT-FLAG.
000129 RDMN-SCREENS1-PF-CHOICE-EXIT.
000129 RDMN-INDEXED-LOOKUP SECTION.
000129 RDMN-INDEXED-LOOKUP-1.
000129     MOVE SPACE TO RDMN-HOLDFLAG.
000129     PERFORM RDMN-START-PRIMEKEY.
000129     IF SY103C-FOUND
000129          PERFORM RDMN-READ.
000129     IF SY103C-NOT-FOUND
000129          MOVE SY103C-KEY-3 TO
000129               RDMN-PRIMEKEY-SAVE
000129          PERFORM RDMN-BLANKRECORD
000129          MOVE RDMN-PRIMEKEY-SAVE TO
000129               SY103C-KEY-3
000129          MOVE "There is no record with this key value."
000129                         TO S1-MSG
000129          MOVE S1-BEEP TO S1-BEEPFLAG
000129     ELSE
000129          MOVE "Record is being displayed" TO S1-MSG
000129          MOVE LOPRO TO S1-MSG-FAC.
000129 RDMN-INDEXED-LOOKUP-EXIT.
000129 RDMN-CREATE-DEFAULTS SECTION.
000129 RDMN-CREATE-DEFAULTS-1.
000129     MOVE "CD" TO RDMN-STATUS.
000129     MOVE SY103C-REC-3 TO
000129                RDMN-FILERECSAVE.
000129     MOVE RDMN-DEFAULTREC TO
000129             SY103C-REC-3.
000129     MOVE RDMN-OK TO S1-PFK-TABLE.
000129     MOVE "N" TO S1-VALIDATEFLAG.
000129     MOVE "Enter defaults to be used in add mode"
000129          TO RDMN-OPT1.
000129     MOVE "SET DEFAULTS" TO RDMN-OPT14.
000129     MOVE "(en) set defaults as shown" TO RDMN-OPT2.
000129     MOVE " (1) do not change defaults" TO RDMN-OPT3.
000129     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000129     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000129         FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000129     PERFORM RDMN-SET-MOD-FIELDS-MOD VARYING RDMN-FAC-I
000129          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000129     PERFORM RDMN-S1-GENERATE.
000129     MOVE SPACES TO S1-MSG.
000129     MOVE SPACE TO S1-BEEPFLAG.
000129     IF S1-PF = 0
000129          MOVE "Defaults set as requested" TO S1-MSG
000129          MOVE SY103C-REC-3 TO
000129               RDMN-DEFAULTREC
000129          MOVE SPACE TO RDMN-FILE-START-KEY
000129     ELSE
000129          MOVE RDMN-FILERECSAVE TO
000129                SY103C-REC-3
000129          MOVE "Defaults not set" TO S1-MSG.
000129     MOVE LOPRO TO S1-MSG-FAC.
000129     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000129          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000129     MOVE "Y" TO S1-VALIDATEFLAG.
000129 RDMN-CREATE-DEFAULTS-EXIT.
000129 RDMN-SEQUENTIAL-LOOKUP SECTION.
000129 RDMN-SEQUENTIAL-LOOKUP-1.
000130     MOVE SY103C-REC-3 TO SAVE-RECORD.
000131     MOVE SPACES TO RDMN-HOLDFLAG.
000132     IF SY103C-KEY NOT = RDMN-PRIMEKEY-SAVE
000133          MOVE SPACES TO RDMN-FILE-START-KEY.
000134     MOVE PROG-SECURITY-CODE TO SY103C-REC-TYPE-3.
000135     PERFORM RDMN-START-NEXTKEY.
000136     IF SY103C-FOUND
000137          PERFORM RDMN-READNEXT
000138          MOVE SY103C-KEY TO RDMN-PRIMEKEY-SAVE.
000139     IF SY103C-NOT-FOUND
000140         MOVE LOW-VALUES TO RDMN-PRIMEKEY-SAVE
000141         MOVE "There is no record beyond this key value" TO S1-MSG
000142         MOVE S1-BEEP TO S1-BEEPFLAG
000143     ELSE
000144       IF SY103C-REC-TYPE-3 NOT = PROG-SECURITY-CODE
000145         MOVE LOW-VALUES TO RDMN-PRIMEKEY-SAVE
000146         MOVE SAVE-RECORD TO SY103C-REC-3
000147         MOVE "There is no record beyond this key value" TO S1-MSG
000148         MOVE S1-BEEP TO S1-BEEPFLAG
000149       ELSE
000150         MOVE "Record is being displayed" TO S1-MSG
000151         MOVE LOPRO TO S1-MSG-FAC.
000153 RDMN-SEQUENTIAL-LOOKUP-EXIT.
000153 RDMN-SEARCH-SCREEN SECTION.
000153 RDMN-SEARCH-SCREEN-1.
000154     MOVE "SE" TO RDMN-STATUS.
000155     MOVE SY103C-REC-3 TO RDMN-FILERECSAVE.
000156     MOVE SPACES TO S2-MSG.
000157     MOVE 1 TO RDMN-SEARCHKEY-SAVE.
000158     MOVE "BXBB BBBBBBBBBBXBBBBBBBBBBBBBSSB " TO S2-PFK-TABLE.
000159     PERFORM RDMN-SEARCH-SCREEN-IMAGE.
000160
000161 RDMN-SEARCH-SCREEN-LOOP.
000162     PERFORM RDMN-S2-GENERATE.
000163
000164     MOVE SPACE TO S2-BEEPFLAG.
000165     MOVE SPACES TO S2-MSG.
000166     IF S2-PF = 16
000167          MOVE RDMN-FILERECSAVE TO SY103C-RECORD
000168          PERFORM RDMN-READ
000169          GO RDMN-SEARCH-SCREEN-EXIT
000170     ELSE
000171     IF S2-PF = 5
000172          PERFORM RDMN-SEARCH-SCREEN-IMAGE
000173          GO RDMN-SEARCH-SCREEN-LOOP
000174     ELSE
000175     IF S2-PF = 2
000176          MOVE "201" TO SY103C-KEY-3
000177          PERFORM RDMN-SEARCH-SCREEN-IMAGE
000178          GO RDMN-SEARCH-SCREEN-LOOP.
000179
000180     SUBTRACT 6 FROM S2-ROW GIVING RDMN-S2-RECNO.
000181     ADD 1 TO RDMN-S2-RECNO.
000182
000183     IF RDMN-S2-RECNO > ZERO AND
000184        RDMN-S2-RECNO NOT > RDMN-S2-RECLAST
000185          MOVE RDMN-S2-KEYSAVE (RDMN-S2-RECNO) TO SY103C-KEY
000186          MOVE SPACE  TO RDMN-HOLDFLAG
000187          PERFORM RDMN-START-PRIMEKEY
000188          PERFORM RDMN-READ
000189          MOVE SY103C-RECORD TO RDMN-FILERECSAVE
000190          MOVE S2-PF TO RDMN-SEARCH-PFKEY
000191          GO RDMN-SEARCH-SCREEN-EXIT.
000192
000193     MOVE S2-BEEP TO S2-BEEPFLAG.
000194     GO RDMN-SEARCH-SCREEN-LOOP.
000195
000197 RDMN-SEARCH-SCREEN-EXIT.
000197 RDMN-DELETE-RECORD SECTION.
000197 RDMN-DELETE-RECORD-1.
000197     MOVE "DE" TO RDMN-STATUS.
000197     MOVE SY103C-KEY-3
000197          TO RDMN-PRIMEKEY-SAVE.
000197     PERFORM RDMN-START-PRIMEKEY.
000197     IF SY103C-FOUND
000197          MOVE "H" TO RDMN-HOLDFLAG
000197          PERFORM RDMN-READ.
000197     IF SY103C-NOT-FOUND
000197          MOVE "There is no record with this key value."
000197               TO S1-MSG
000197          MOVE S1-BEEP TO S1-BEEPFLAG
000197          GO RDMN-DELETE-RECORD-EXIT.
000197     MOVE "N" TO S1-VALIDATEFLAG.
000197 RDMN-MULTIPLE-DELETE-LOOP.
000197     MOVE RDMN-OK TO S1-PFK-TABLE.
000197     MOVE "(en)  delete this record" TO RDMN-OPT1.
000197     MOVE "DELETE MODE"              TO RDMN-OPT14.
000197     MOVE " (1)  do not delete"      TO RDMN-OPT2.
000197     IF RDMN-MODE-LOCK = "L"
000197          MOVE "(16)  exit multiple delete mode" TO RDMN-OPT3
000197          MOVE "X" TO S1-PFK(16).
000197     PERFORM RDMN-SET-FIELDS-FLASH VARYING RDMN-FAC-I
000197        FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000197     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000197         FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197
000197     PERFORM RDMN-DELETE-DISABLE.
000197
000197     PERFORM RDMN-S1-GENERATE.
000197     MOVE SPACE TO S1-BEEPFLAG.
000197     IF S1-PF = 0
000197          PERFORM RDMN-DELETE
000197          IF SY103C-FOUND
000197               MOVE "Record deleted as requested" TO
000197                    S1-MSG
000197               MOVE LOPRO TO S1-MSG-FAC.
000197     IF S1-PF = 1
000197          MOVE "Record not deleted" TO S1-MSG
000197          MOVE LOPRO TO S1-MSG-FAC.
000197     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     IF RDMN-MODE-LOCK = "L"
000197          IF S1-PF = 16
000197               MOVE "Multiple deleted terminated" TO S1-MSG
000197               MOVE LOPRO TO S1-MSG-FAC
000197               GO TO RDMN-DELETE-RECORD-EXIT
000197          ELSE
000197               PERFORM RDMN-START-NEXTKEY
000197               IF SY103C-NOT-FOUND
000197                    MOVE "End of file encountered" TO
000197                         S1-MSG
000197                    MOVE HIPRO TO S1-MSG-FAC
000197                    MOVE S1-BEEP TO
000197                              S1-BEEPFLAG
000197               ELSE
000197                    MOVE "H" TO RDMN-HOLDFLAG
000197                    PERFORM RDMN-READNEXT
000197                    IF SY103C-NOT-FOUND
000197                         MOVE "End of file encountered"
000197                              TO S1-MSG
000197                         MOVE HIPRO TO S1-MSG-FAC
000197                         MOVE S1-BEEP TO
000197                                   S1-BEEPFLAG
000197                    ELSE
000197                         GO TO RDMN-MULTIPLE-DELETE-LOOP.
000197     MOVE "N" TO S1-VALIDATEFLAG.
000197 RDMN-DELETE-RECORD-EXIT.
000197 RDMN-DELETE-DISABLE SECTION.
000197 RDMN-DELETE-DISABLE-1.
000197     IF RDMN-UPDATE-DISABLE
000197         MOVE "Record deletion is not allowed" TO S1-MSG.
000197     IF RDMN-UPDATE-DISABLE
000197         PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000197         FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS
000197         MOVE "N" TO RDMN-UPDATE-DISABLEFLAG
000197         MOVE S1-BEEP TO S1-BEEPFLAG
000197         IF RDMN-MODE-LOCK = "L"
000197             MOVE SPACES TO RDMN-OPT11
000197             MOVE FLPRO TO S1-MSG-FAC
000197             MOVE "B" TO S1-PFK(33)
000197         ELSE
000197              IF RDMN-MODE-LOCK NOT = "L"
000197                  GO TO RDMN-DELETE-RECORD-EXIT.
000197 RDMN-DELETE-DISABLE-EXIT.
000197 RDMN-MODIFY-RECORD SECTION.
000197 RDMN-MODIFY-RECORD-1.
000197     MOVE "RW" TO RDMN-STATUS.
000197     MOVE SY103C-KEY-3 TO
000197          RDMN-PRIMEKEY-SAVE.
000197     PERFORM RDMN-START-PRIMEKEY.
000197     IF SY103C-FOUND
000197          MOVE "H" TO RDMN-HOLDFLAG
000197          PERFORM RDMN-READ.
000197     IF SY103C-NOT-FOUND
000197          MOVE "There is no record with this key value."
000197               TO S1-MSG
000197          MOVE S1-BEEP TO S1-BEEPFLAG
000197          GO RDMN-MODIFY-RECORD-EXIT.
000197 RDMN-MULTIPLE-MODIFY-LOOP.
000197     MOVE RDMN-OK TO S1-PFK-TABLE.
000197     MOVE "(en)  modify record as shown" TO RDMN-OPT1.
000197     MOVE "MODIFY MODE"                 TO RDMN-OPT14.
000197     MOVE " (1)  do not modify"          TO RDMN-OPT2.
000197     IF RDMN-MODE-LOCK = "L"
000197          MOVE "(16)  exit multiple modify mode" TO RDMN-OPT3
000197          MOVE "X" TO S1-PFK(16).
000197     PERFORM RDMN-SET-MOD-FIELDS-MOD VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000197     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     MOVE "Y" TO S1-VALIDATEFLAG.
000197     PERFORM RDMN-MODIFY-DISABLE.
000197 RDMN-ACCEPT-MODIFICATIONS.
000197
000197     PERFORM RDMN-S1-GENERATE.
000197     MOVE SPACES TO S1-MSG.
000197     MOVE SPACE TO S1-BEEPFLAG.
000197     IF S1-PF = 0
000197          MOVE SY103C-REC-3 TO
000197               RDMN-FILERECSAVE
000197          PERFORM RDMN-REWRITE
000197          IF SY103C-FOUND
000197               MOVE "Record modified as requested" TO
000197                    S1-MSG
000197               MOVE LOPRO TO S1-MSG-FAC
000197          ELSE MOVE "Invalid rewrite -- duplicate key"
000197                              TO S1-MSG
000197               MOVE FLPRO TO S1-MSG-FAC
000197               MOVE S1-BEEP TO S1-BEEPFLAG
000197               MOVE "H" TO RDMN-HOLDFLAG
000197               PERFORM RDMN-START-PRIMEKEY
000197               PERFORM RDMN-READ
000197               MOVE RDMN-FILERECSAVE TO
000197                    SY103C-REC-3
000197               GO TO RDMN-ACCEPT-MODIFICATIONS.
000197     IF S1-PF = 1
000197          MOVE "Record not modified" TO S1-MSG
000197          MOVE LOPRO TO S1-MSG-FAC.
000197     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     IF RDMN-MODE-LOCK = "L"
000197          IF S1-PF = 16
000197               MOVE "Multiple modify terminated" TO S1-MSG
000197               MOVE LOPRO TO S1-MSG-FAC
000197               GO TO RDMN-MODIFY-RECORD-EXIT
000197          ELSE
000197               PERFORM RDMN-START-NEXTKEY
000197               IF SY103C-NOT-FOUND
000197                    MOVE "End of file encountered"
000197                         TO S1-MSG
000197                    MOVE HIPRO TO S1-MSG-FAC
000197                    MOVE S1-BEEP TO
000197                         S1-BEEPFLAG
000197               ELSE
000197                    MOVE "H" TO RDMN-HOLDFLAG
000197                    PERFORM RDMN-READNEXT
000197                    IF SY103C-NOT-FOUND
000197                         MOVE "End of file encountered"
000197                              TO S1-MSG
000197                         MOVE HIPRO TO S1-MSG-FAC
000197                         MOVE S1-BEEP TO
000197                              S1-BEEPFLAG
000197                    ELSE
000197                         GO TO RDMN-MULTIPLE-MODIFY-LOOP.
000197 RDMN-MODIFY-RECORD-EXIT.
000197
000197 RDMN-MODIFY-DISABLE SECTION.
000197 RDMN-MODIFY-DISABLE-1.
000197     IF RDMN-UPDATE-DISABLE
000197         MOVE "Record modification is not allowed" TO
000197            S1-MSG.
000197     IF RDMN-UPDATE-DISABLE
000197         PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000197         FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS
000197         MOVE "N" TO RDMN-UPDATE-DISABLEFLAG
000197         MOVE S1-BEEP TO S1-BEEPFLAG
000197         IF RDMN-MODE-LOCK = "L"
000197             MOVE SPACES TO RDMN-OPT11
000197             MOVE FLPRO TO S1-MSG-FAC
000197             MOVE "B" TO S1-PFK(33)
000197         ELSE
000197              IF RDMN-MODE-LOCK NOT = "L"
000197                  GO TO RDMN-MODIFY-RECORD-EXIT.
000197 RDMN-MODIFY-DISABLE-EXIT.
000197 RDMN-ADD-RECORD SECTION.
000197 RDMN-ADD-RECORD-1.
000197     MOVE "WR" TO RDMN-STATUS.
000197     MOVE SY103C-KEY-3 TO
000197            RDMN-PRIMEKEY-SAVE.
000197     PERFORM RDMN-START-PRIMEKEY.
000197     IF SY103C-FOUND
000197          MOVE "There already is a record with this key value."
000197                         TO S1-MSG
000197          MOVE S1-BEEP TO S1-BEEPFLAG
000197          GO TO RDMN-ADD-RECORD-EXIT.
000197     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000197     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000197           FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197 RDMN-MULTIPLE-ADD-LOOP.
000197     IF RDMN-COPYFLAG = "N"
000197     MOVE RDMN-DEFAULTREC TO
000197               SY103C-REC-3.
000197     MOVE RDMN-PRIMEKEY-SAVE TO
000197          SY103C-KEY-3.
000197     MOVE RDMN-OK TO S1-PFK-TABLE.
000197     MOVE "(en)  add record as shown" TO RDMN-OPT1.
000197     MOVE "ADD MODE"                    TO RDMN-OPT14.
000197     MOVE " (1)  do not add"          TO RDMN-OPT2.
000197     IF RDMN-MODE-LOCK = "L"
000197          MOVE "(16)  exit multiple add mode" TO RDMN-OPT3
000197          MOVE "X" TO S1-PFK(16).
000197     PERFORM RDMN-SET-MOD-FIELDS-MOD VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     MOVE "Y" TO S1-VALIDATEFLAG.
000197 RDMN-ADD-RECORD-LOOP.
000197     PERFORM RDMN-S1-GENERATE.
000197     MOVE SPACES TO S1-MSG.
000197     MOVE SPACE TO S1-BEEPFLAG.
000197     IF S1-PF NOT = 0
000197          GO TO RDMN-ADD-AFTER-WRITE.
000197     PERFORM RDMN-WRITE
000197      IF SY103C-NOT-FOUND
000197           MOVE "Invalid write -- duplicate key"
000197                          TO S1-MSG
000197           MOVE FLPRO TO S1-MSG-FAC
000197           MOVE S1-BEEP TO S1-BEEPFLAG
000197           GO RDMN-ADD-RECORD-LOOP.
000197     MOVE SY103C-KEY-3 TO
000197               RDMN-PRIMEKEY-SAVE.
000197 RDMN-ADD-AFTER-WRITE.
000197     IF S1-PF = 0
000197          MOVE "Record added as requested" TO
000197                S1-MSG
000197     ELSE
000197         MOVE "Record not added" TO S1-MSG.
000197     MOVE LOPRO TO S1-MSG-FAC.
000197     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     IF S1-PF = 1 OR S1-PF = 16
000197          PERFORM RDMN-BLANKRECORD.
000197 RDMN-ADD-RECORD-ENDLOOP.
000197     IF RDMN-MODE-LOCK = "L"
000197          IF S1-PF = 16
000197              MOVE "Multiple add terminated" TO S1-MSG
000197              MOVE LOPRO TO S1-MSG-FAC
000197          ELSE
000197             MOVE 0 TO RDMN-PROTECT-KEY-FLAG
000197             PERFORM RDMN-PROTECT-KEY-FIELDS VARYING
000197                  RDMN-FAC-I FROM 1 BY 1 UNTIL
000197                  RDMN-FAC-I > S1-NFIELDS
000197              GO TO RDMN-MULTIPLE-ADD-LOOP.
000197     MOVE SPACES TO RDMN-FILE-START-KEY.
000197 RDMN-ADD-RECORD-EXIT.
000197 RDMN-SET-TABS SECTION.
000197 RDMN-SET-TABS-1.
000197     MOVE "ST" TO RDMN-STATUS.
000197     MOVE
000197     "Modifiability of fields can be changed by entering"
000197          TO RDMN-OPT1.
000197     MOVE
000197     "any character in the first position of the field."
000197          TO RDMN-OPT2.
000197     MOVE
000197     "Bright fields are modifiable dim fields are not."
000197          TO RDMN-OPT3.
000197     MOVE "SET TABS"     TO RDMN-OPT14.
000197     MOVE "(en) accept"  TO RDMN-OPT25.
000197     MOVE " (1) exit"   TO RDMN-OPT34.
000197     PERFORM RDMN-PROTECT-TO-MODIFY VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000197     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     MOVE "XBBBBBBBBBBBBBBBBBBBBBBBBBBBBSSBX"
000197          TO S1-PFK-TABLE.
000197     MOVE SY103C-REC-3
000197          TO RDMN-FILERECSAVE.
000197 RDMN-SET-TABS-LOOP.
000197     PERFORM RDMN-BLANKRECORD.
000197     PERFORM RDMN-S1-GENERATE.
000197     MOVE SPACE TO S1-BEEPFLAG.
000197     IF S1-PF = 1
000197               MOVE "Set tabs aborted" TO S1-MSG
000197               MOVE LOPRO TO S1-MSG-FAC
000197               GO RDMN-SET-TABS-END.
000197     MOVE 1 TO RDMN-I.
000197 RDMN-CHANGE-TABS-LOOP.
000197     MOVE S1-COORD-ROW (RDMN-I) TO RDMN-ROW.
000197     ADD S1-COORD-COL (RDMN-I) 1
000197          GIVING RDMN-COLPLUS1.
000197     IF S1-OBJECT (RDMN-I) = 1
000197         IF S1-COLX (RDMN-ROW, RDMN-COLPLUS1 )
000197               NOT = SPACE
000197             IF RDMN-MOD-FLAG (RDMN-I) = 0
000197                   MOVE 1 TO RDMN-MOD-FLAG (RDMN-I)
000197                   SET DEGEN-DIM OF S1-FAC(RDMN-I)
000197                         OFF
000197             ELSE
000197                   MOVE 0 TO RDMN-MOD-FLAG (RDMN-I)
000197                   SET DEGEN-DIM OF S1-FAC(RDMN-I) ON
000197                         .
000197     ADD 1 TO RDMN-I.
000197     IF RDMN-I NOT > S1-NFIELDS
000197          GO TO RDMN-CHANGE-TABS-LOOP
000197     ELSE
000197          MOVE "Set tabs completed" TO S1-MSG
000197          MOVE LOPRO TO S1-MSG-FAC.
000197 RDMN-SET-TABS-END.
000197     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000197          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000197     MOVE ZERO TO S1-LINE S1-POS.
000197     MOVE RDMN-FILERECSAVE TO
000197          SY103C-REC-3.
000197 RDMN-SET-TABS-EXIT.
000197 RDMN-MODE-LOCK-UNLOCK SECTION.
000197 RDMN-MODE-LOCK-UNLOCK-1.
000197     IF RDMN-MODE-LOCK NOT = "L"
000197          MOVE "L" TO RDMN-MODE-LOCK
000197          MOVE "Lock mode entered" TO S1-MSG
000197     ELSE
000197          MOVE SPACE TO RDMN-MODE-LOCK
000197          MOVE "Lock mode exited" TO S1-MSG.
000197     MOVE LOPRO TO S1-MSG-FAC.
000197 RDMN-MODE-LOCK-UNLOCK-EXIT.
000202 RDMN-SEARCH-SCREEN-IMAGE SECTION.
000202 RDMN-SEARCH-SCREEN-IMAGE-1.
000204     MOVE LOW-VALUES TO RDMN-S2-TABLE.
000205     MOVE ZERO TO RDMN-S2-RECLAST.
000206     MOVE 1 TO RDMN-S2-RECNO.
000207     MOVE SPACE TO RDMN-HOLDFLAG.
000209     IF  SY103C-KEY-3 = RDMN-SEARCHKEY-SAVE
000210     AND SY103C-KEY-3 NOT = LOW-VALUES
000211     AND SY103C-FOUND
000212          MOVE "Y" TO RDMN-SCROLL-FROM-BOTTOM-FLAG
000213     ELSE
000214          PERFORM RDMN-START-SEARCHKEY
000215          IF SY103C-NOT-FOUND
000216               MOVE "This key value is greater than any on file"
000217                    TO S2-MSG
000218               MOVE S2-BEEP TO S2-BEEPFLAG
000219               GO RDMN-SEARCH-SCREEN-IMAGE-EXIT.
000221 RDMN-SEARCH-SCREEN-IMAGE-LOOP.
000222     IF RDMN-SCROLL-FROM-BOTTOM-FLAG = "Y"
000223          MOVE "N" TO RDMN-SCROLL-FROM-BOTTOM-FLAG
000224          MOVE RDMN-SEARCH-REC-SAVE
000225               TO SY103C-REC-3
000226     ELSE
000227          PERFORM RDMN-READNEXT.
000228
000229     IF SY103C-REC-TYPE-1 NOT = "201"
000230          MOVE "N" TO SY103C-ERROR-FLAG
000231          MOVE SAVE-RECORD TO SY103C-REC-3.
000233     IF SY103C-NOT-FOUND
000234          SUBTRACT 1 FROM RDMN-S2-RECNO
000235          GIVING RDMN-S2-RECLAST
000236          MOVE LOW-VALUES
000237               TO RDMN-SEARCHKEY-SAVE
000238          GO TO RDMN-SEARCH-SCREEN-IMAGE-EXIT.
000239
000240     MOVE SY103C-KEY-3 TO
000241          RDMN-S2-KEYSAVE (RDMN-S2-RECNO).
000242     MOVE SY103C-KEY-3 TO
000243          RDMN-SEARCHKEY-SAVE.
000244     MOVE SY103C-REC-3
000245           TO RDMN-SEARCH-REC-SAVE.
000246
000247      MOVE SY103C-SUBSYSTEM-3    TO RDMN-SEARCHFIELD-01
000248                                   (RDMN-S2-RECNO).
000249      MOVE SY103C-PROGRAM-3      TO RDMN-SEARCHFIELD-02
000250                                   (RDMN-S2-RECNO).
000251      MOVE SY103C-PROG-SEC-LEVEL TO RDMN-SEARCHFIELD-03
000252                                   (RDMN-S2-RECNO).
000253
000254     MOVE SOLID TO RDMN-S2-LINEBOX
000255          (RDMN-S2-RECNO).
000256     ADD 1 TO RDMN-S2-RECNO.
000257     IF RDMN-S2-RECNO NOT > 16
000258          GO RDMN-SEARCH-SCREEN-IMAGE-LOOP.
000259     MOVE 16 TO RDMN-S2-RECLAST.
000261 RDMN-SEARCH-SCREEN-IMAGE-EXIT.
000261 RDMN-S1-GENERATE SECTION.
000261 RDMN-S1-GENERATE-1.
000261     PERFORM S1-GENERATE.
000261 RDMN-S1-GENERATE-EXIT.
000261 RDMN-S2-GENERATE SECTION.
000261 RDMN-S2-GENERATE-1.
000261     PERFORM S2-GENERATE.
000261 RDMN-S2-GENERATE-EXIT.
000261 RDMN-START-PRIMEKEY SECTION.
000261 RDMN-START-PRIMEKEY-01.
000261     MOVE "SY103C-KEY-3" TO
000261              RDMN-FILE-START-KEY.
000261     PERFORM SY103C-START-EQUAL.
000261 RDMN-START-PRIMEKEY-EXIT.
000261 RDMN-START-SEARCHKEY SECTION.
000261 RDMN-START-SEARCHKEY-01.
000261     MOVE "SY103C-KEY-3"
000261          TO RDMN-FILE-START-KEY.
000261     MOVE SY103C-KEY-3 TO
000261          RDMN-PRIMEKEY-SAVE.
000261          PERFORM SY103C-START-NOT-LESS-THAN.
000261 RDMN-START-SEARCHKEY-EXIT.
000261 RDMN-START-NEXTKEY SECTION.
000261 RDMN-START-NEXTKEY-01.
000261     IF RDMN-FILE-START-KEY = "SY103C-KEY-3"
000261          IF SY103C-FOUND
000261               GO TO RDMN-START-NEXTKEY-EXIT.
000261     IF  RDMN-FILE-START-KEY = "SY103C-KEY-3"
000261     AND SY103C-FOUND
000261          MOVE SY103C-KEY-3
000261               TO RDMN-PRIMEKEY-SAVE
000261     ELSE
000261          MOVE LOW-VALUES
000261               TO RDMN-PRIMEKEY-SAVE.
000261     MOVE "SY103C-KEY-3"
000261           TO RDMN-FILE-START-KEY.
000261          PERFORM SY103C-START-GREATER-THAN.
000261 RDMN-START-NEXTKEY-EXIT.
000261 RDMN-READ SECTION.
000261 RDMN-READ-01.
000261     MOVE "SY103C-KEY-3"
000261          TO RDMN-FILE-START-KEY.
000261     IF RDMN-HOLDFLAG = "H"
000261          PERFORM SY103C-READ-WITH-HOLD
000261     ELSE
000261          PERFORM SY103C-READ.
000261 RDMN-READ-EXIT.
000261 RDMN-READNEXT SECTION.
000261 RDMN-READNEXT-01.
000262     MOVE SY103C-REC-3 TO SAVE-RECORD.
000266     IF SY103C-FOUND
000266     AND RDMN-SKIP-READNEXT-FLAG = SPACE
000266     IF RDMN-HOLDFLAG = "H"
000266          PERFORM SY103C-READ-NEXT-WITH-HOLD
000266     ELSE
000266          PERFORM SY103C-READ-NEXT.
000266     MOVE SPACE TO RDMN-SKIP-READNEXT-FLAG.
000266 RDMN-READNEXT-EXIT.
000266 RDMN-WRITE SECTION.
000266 RDMN-WRITE-01.
000267     MOVE PROG-SECURITY-CODE TO SY103C-REC-TYPE-3.
000269     MOVE SY103C-REC-3 TO
000269            RDMN-FILERECSAVE.
000269     PERFORM SY103C-WRITE.
000269     PERFORM SY104-FREE-ALL.
000269     MOVE RDMN-FILERECSAVE TO
000269              SY103C-REC-3.
000269 RDMN-WRITE-EXIT.
000269 RDMN-REWRITE SECTION.
000269 RDMN-REWRITE-01.
000269     PERFORM SY103C-REWRITE.
000269     PERFORM SY104-FREE-ALL.
000269 RDMN-REWRITE-EXIT.
000269 RDMN-DELETE SECTION.
000269 RDMN-DELETE-01.
000269     MOVE SY103C-REC-3
000269          TO RDMN-FILERECSAVE.
000269     PERFORM SY103C-DELETE.
000269     PERFORM SY104-FREE-ALL.
000269 RDMN-DELETE-EXIT.
000269 S1-BACKGROUND SECTION.
000269 S1-BACKGROUND-01.
000269 S2-BACKGROUND SECTION.
000269 S2-BACKGROUND-01.
000269 S1-SOURCE-TO-IMAGE SECTION.
000269 S1-SOURCE-TO-IMAGE-01.
000269     MOVE SY103C-SUBSYSTEM-3 TO S1-S1-001.
000269     MOVE SY103C-PROGRAM-3 TO S1-S2-001.
000269     MOVE " " TO S1-6-001.
000269     MOVE RDMN-OPT1 TO S1-7-001.
000269     MOVE RDMN-OPT2 TO S1-8-001.
000269     MOVE RDMN-OPT3 TO S1-9-001.
000269     COMPUTE S1-A-00S1-R ROUNDED =
                 SY103C-PROG-SEC-LEVEL + 0 SIZE
000269           ERROR MOVE S1-NUMERIC-ERROR TO S1-A-001.
000269     COMPUTE S1-B-00S1-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (1) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-001.
000269     COMPUTE S1-B-00S2-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (2) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-002.
000269     COMPUTE S1-B-003-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (3) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-003.
000269     COMPUTE S1-B-004-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (4) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-004.
000269     COMPUTE S1-B-005-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (5) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-005.
000269     COMPUTE S1-B-006-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (6) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-006.
000269     COMPUTE S1-B-007-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (7) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-007.
000269     COMPUTE S1-B-008-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (8) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-008.
000269     COMPUTE S1-B-009-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (9) + 0
000269           SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-009.
000269     COMPUTE S1-B-010-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (10) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-010.
000269     COMPUTE S1-B-01S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (11) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-011.
000269     COMPUTE S1-B-01S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (12) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-012.
000269     COMPUTE S1-B-013-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (13) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-013.
000269     COMPUTE S1-B-014-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (14) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-014.
000269     COMPUTE S1-B-015-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (15) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-015.
000269     COMPUTE S1-B-016-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (16) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-016.
000269     COMPUTE S1-B-017-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (17) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-017.
000269     COMPUTE S1-B-018-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (18) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-018.
000269     COMPUTE S1-B-019-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (19) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-019.
000269     COMPUTE S1-B-020-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (20) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-020.
000269     COMPUTE S1-B-02S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (21) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-021.
000269     COMPUTE S1-B-02S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (22) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-022.
000269     COMPUTE S1-B-023-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (23) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-023.
000269     COMPUTE S1-B-024-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (24) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-024.
000269     COMPUTE S1-B-025-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (25) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-025.
000269     COMPUTE S1-B-026-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (26) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-026.
000269     COMPUTE S1-B-027-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (27) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-027.
000269     COMPUTE S1-B-028-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (28) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-028.
000269     COMPUTE S1-B-029-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (29) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-029.
000269     COMPUTE S1-B-030-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (30) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-030.
000269     COMPUTE S1-B-03S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (31) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-031.
000269     COMPUTE S1-B-03S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (32) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-032.
000269     COMPUTE S1-B-033-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (33) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-033.
000269     COMPUTE S1-B-034-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (34) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-034.
000269     COMPUTE S1-B-035-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (35) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-035.
000269     COMPUTE S1-B-036-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (36) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-036.
000269     COMPUTE S1-B-037-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (37) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-037.
000269     COMPUTE S1-B-038-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (38) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-038.
000269     COMPUTE S1-B-039-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (39) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-039.
000269     COMPUTE S1-B-040-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (40) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-040.
000269     COMPUTE S1-B-04S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (41) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-041.
000269     COMPUTE S1-B-04S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (42) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-042.
000269     COMPUTE S1-B-043-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (43) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-043.
000269     COMPUTE S1-B-044-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (44) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-044.
000269     COMPUTE S1-B-045-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (45) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-045.
000269     COMPUTE S1-B-046-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (46) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-046.
000269     COMPUTE S1-B-047-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (47) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-047.
000269     COMPUTE S1-B-048-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (48) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-048.
000269     COMPUTE S1-B-049-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (49) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-049.
000269     COMPUTE S1-B-050-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (50) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-050.
000269     COMPUTE S1-B-05S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (51) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-051.
000269     COMPUTE S1-B-05S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (52) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-052.
000269     COMPUTE S1-B-053-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (53) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-053.
000269     COMPUTE S1-B-054-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (54) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-054.
000269     COMPUTE S1-B-055-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (55) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-055.
000269     COMPUTE S1-B-056-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (56) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-056.
000269     COMPUTE S1-B-057-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (57) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-057.
000269     COMPUTE S1-B-058-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (58) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-058.
000269     COMPUTE S1-B-059-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (59) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-059.
000269     COMPUTE S1-B-060-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (60) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-060.
000269     COMPUTE S1-B-06S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (61) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-061.
000269     COMPUTE S1-B-06S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (62) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-062.
000269     COMPUTE S1-B-063-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (63) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-063.
000269     COMPUTE S1-B-064-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (64) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-064.
000269     COMPUTE S1-B-065-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (65) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-065.
000269     COMPUTE S1-B-066-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (66) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-066.
000269     COMPUTE S1-B-067-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (67) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-067.
000269     COMPUTE S1-B-068-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (68) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-068.
000269     COMPUTE S1-B-069-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (69) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-069.
000269     COMPUTE S1-B-070-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (70) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-070.
000269     COMPUTE S1-B-07S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (71) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-071.
000269     COMPUTE S1-B-07S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (72) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-072.
000269     COMPUTE S1-B-073-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (73) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-073.
000269     COMPUTE S1-B-074-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (74) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-074.
000269     COMPUTE S1-B-075-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (75) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-075.
000269     COMPUTE S1-B-076-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (76) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-076.
000269     COMPUTE S1-B-077-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (77) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-077.
000269     COMPUTE S1-B-078-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (78) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-078.
000269     COMPUTE S1-B-079-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (79) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-079.
000269     COMPUTE S1-B-080-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (80) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-080.
000269     COMPUTE S1-B-08S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (81) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-081.
000269     COMPUTE S1-B-08S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (82) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-082.
000269     COMPUTE S1-B-083-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (83) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-083.
000269     COMPUTE S1-B-084-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (84) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-084.
000269     COMPUTE S1-B-085-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (85) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-085.
000269     COMPUTE S1-B-086-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (86) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-086.
000269     COMPUTE S1-B-087-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (87) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-087.
000269     COMPUTE S1-B-088-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (88) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-088.
000269     COMPUTE S1-B-089-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (89) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-089.
000269     COMPUTE S1-B-090-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (90) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-090.
000269     COMPUTE S1-B-09S1-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (91) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-091.
000269     COMPUTE S1-B-09S2-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (92) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-092.
000269     COMPUTE S1-B-093-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (93) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-093.
000269     COMPUTE S1-B-094-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (94) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-094.
000269     COMPUTE S1-B-095-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (95) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-095.
000269     COMPUTE S1-B-096-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (96) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-096.
000269     COMPUTE S1-B-097-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (97) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-097.
000269     COMPUTE S1-B-098-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (98) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-098.
000269     COMPUTE S1-B-099-R ROUNDED = 
                 SY103C-FUNCTION-SEC-LEVEL (99) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-099.
000269     COMPUTE S1-B-100-R ROUNDED =
                 SY103C-FUNCTION-SEC-LEVEL (100) +
000269           0 SIZE ERROR MOVE S1-NUMERIC-ERROR TO S1-B-100.
000269     PERFORM S1-SET-PSEUDOBLANKS.
000269 S1-SET-PSEUDOBLANKS SECTION.
000269 S1-SET-PSEUDOBLANKS-01.
000269 S1-RESET-PSEUDOBLANKS SECTION.
000269 S1-RESET-PSEUDOBLANKS-01.
000269 S2-SOURCE-TO-IMAGE SECTION.
000269 S2-SOURCE-TO-IMAGE-01.
000269     MOVE SY103C-SUBSYSTEM-3 TO S2-S1-001.
000269     MOVE SY103C-PROGRAM-3 TO S2-S2-001.
000269     MOVE RDMN-SEARCHFIELD-01 (1) TO S2-A-001.
000269     MOVE RDMN-SEARCHFIELD-01 (2) TO S2-A-002.
000269     MOVE RDMN-SEARCHFIELD-01 (3) TO S2-A-003.
000269     MOVE RDMN-SEARCHFIELD-01 (4) TO S2-A-004.
000269     MOVE RDMN-SEARCHFIELD-01 (5) TO S2-A-005.
000269     MOVE RDMN-SEARCHFIELD-01 (6) TO S2-A-006.
000269     MOVE RDMN-SEARCHFIELD-01 (7) TO S2-A-007.
000269     MOVE RDMN-SEARCHFIELD-01 (8) TO S2-A-008.
000269     MOVE RDMN-SEARCHFIELD-01 (9) TO S2-A-009.
000269     MOVE RDMN-SEARCHFIELD-01 (10) TO S2-A-010.
000269     MOVE RDMN-SEARCHFIELD-01 (11) TO S2-A-011.
000269     MOVE RDMN-SEARCHFIELD-01 (12) TO S2-A-012.
000269     MOVE RDMN-SEARCHFIELD-01 (13) TO S2-A-013.
000269     MOVE RDMN-SEARCHFIELD-01 (14) TO S2-A-014.
000269     MOVE RDMN-SEARCHFIELD-01 (15) TO S2-A-015.
000269     MOVE RDMN-SEARCHFIELD-01 (16) TO S2-A-016.
000269     MOVE RDMN-SEARCHFIELD-02 (1) TO S2-B-001.
000269     MOVE RDMN-SEARCHFIELD-02 (2) TO S2-B-002.
000269     MOVE RDMN-SEARCHFIELD-02 (3) TO S2-B-003.
000269     MOVE RDMN-SEARCHFIELD-02 (4) TO S2-B-004.
000269     MOVE RDMN-SEARCHFIELD-02 (5) TO S2-B-005.
000269     MOVE RDMN-SEARCHFIELD-02 (6) TO S2-B-006.
000269     MOVE RDMN-SEARCHFIELD-02 (7) TO S2-B-007.
000269     MOVE RDMN-SEARCHFIELD-02 (8) TO S2-B-008.
000269     MOVE RDMN-SEARCHFIELD-02 (9) TO S2-B-009.
000269     MOVE RDMN-SEARCHFIELD-02 (10) TO S2-B-010.
000269     MOVE RDMN-SEARCHFIELD-02 (11) TO S2-B-011.
000269     MOVE RDMN-SEARCHFIELD-02 (12) TO S2-B-012.
000269     MOVE RDMN-SEARCHFIELD-02 (13) TO S2-B-013.
000269     MOVE RDMN-SEARCHFIELD-02 (14) TO S2-B-014.
000269     MOVE RDMN-SEARCHFIELD-02 (15) TO S2-B-015.
000269     MOVE RDMN-SEARCHFIELD-02 (16) TO S2-B-016.
000269     COMPUTE S2-C-00S1-R ROUNDED = 
                 RDMN-SEARCHFIELD-03 (1) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-001.
000269     COMPUTE S2-C-00S2-R ROUNDED =
                 RDMN-SEARCHFIELD-03 (2) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-002.
000269     COMPUTE S2-C-003-R ROUNDED = 
                 RDMN-SEARCHFIELD-03 (3) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-003.
000269     COMPUTE S2-C-004-R ROUNDED = 
                 RDMN-SEARCHFIELD-03 (4) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-004.
000269     COMPUTE S2-C-005-R ROUNDED = 
                 RDMN-SEARCHFIELD-03 (5) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-005.
000269     COMPUTE S2-C-006-R ROUNDED = 
                 RDMN-SEARCHFIELD-03 (6) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-006.
000269     COMPUTE S2-C-007-R ROUNDED = 
                 RDMN-SEARCHFIELD-03 (7) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-007.
000269     COMPUTE S2-C-008-R ROUNDED = 
                 RDMN-SEARCHFIELD-03 (8) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-008.
000269     COMPUTE S2-C-009-R ROUNDED = 
                 RDMN-SEARCHFIELD-03 (9) + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-C-009.
000269     COMPUTE S2-C-010-R ROUNDED = 
                  RDMN-SEARCHFIELD-03 (10) + 0 SIZE
000269            ERROR MOVE S2-NUMERIC-ERROR TO S2-C-010.
000269     COMPUTE S2-C-01S1-R ROUNDED = 
                  RDMN-SEARCHFIELD-03 (11) + 0 SIZE
000269            ERROR MOVE S2-NUMERIC-ERROR TO S2-C-011.
000269     COMPUTE S2-C-01S2-R ROUNDED = 
                  RDMN-SEARCHFIELD-03 (12) + 0 SIZE
000269            ERROR MOVE S2-NUMERIC-ERROR TO S2-C-012.
000269     COMPUTE S2-C-013-R ROUNDED = 
                  RDMN-SEARCHFIELD-03 (13) + 0 SIZE
000269            ERROR MOVE S2-NUMERIC-ERROR TO S2-C-013.
000269     COMPUTE S2-C-014-R ROUNDED = 
                  RDMN-SEARCHFIELD-03 (14) + 0 SIZE
000269            ERROR MOVE S2-NUMERIC-ERROR TO S2-C-014.
000269     COMPUTE S2-C-015-R ROUNDED = 
                  RDMN-SEARCHFIELD-03 (15) + 0 SIZE
000269            ERROR MOVE S2-NUMERIC-ERROR TO S2-C-015.
000269     COMPUTE S2-C-016-R ROUNDED = 
                  RDMN-SEARCHFIELD-03 (16) + 0 SIZE
000269            ERROR MOVE S2-NUMERIC-ERROR TO S2-C-016.
000269     COMPUTE S2-D-00S1-R ROUNDED = 
                 SY103C-PROG-SEC-LEVEL + 0 SIZE
000269           ERROR MOVE S2-NUMERIC-ERROR TO S2-D-001.
000269     MOVE " " TO S2-6S1-001.
000269     MOVE RDMN-S2-OPT1 TO S2-78-001.
000269     MOVE RDMN-S2-OPT2 TO S2-79-001.
000269     MOVE RDMN-S2-LINEBOX (1) TO S2-7A-001.
000269     MOVE RDMN-S2-LINEBOX (2) TO S2-7A-002.
000269     MOVE RDMN-S2-LINEBOX (3) TO S2-7A-003.
000269     MOVE RDMN-S2-LINEBOX (4) TO S2-7A-004.
000269     MOVE RDMN-S2-LINEBOX (5) TO S2-7A-005.
000269     MOVE RDMN-S2-LINEBOX (6) TO S2-7A-006.
000269     MOVE RDMN-S2-LINEBOX (7) TO S2-7A-007.
000269     MOVE RDMN-S2-LINEBOX (8) TO S2-7A-008.
000269     MOVE RDMN-S2-LINEBOX (9) TO S2-7A-009.
000269     MOVE RDMN-S2-LINEBOX (10) TO S2-7A-010.
000269     MOVE RDMN-S2-LINEBOX (11) TO S2-7A-011.
000269     MOVE RDMN-S2-LINEBOX (12) TO S2-7A-012.
000269     MOVE RDMN-S2-LINEBOX (13) TO S2-7A-013.
000269     MOVE RDMN-S2-LINEBOX (14) TO S2-7A-014.
000269     MOVE RDMN-S2-LINEBOX (15) TO S2-7A-015.
000269     MOVE RDMN-S2-LINEBOX (16) TO S2-7A-016.
000269     PERFORM S2-SET-PSEUDOBLANKS.
000269 S2-SET-PSEUDOBLANKS SECTION.
000269 S2-SET-PSEUDOBLANKS-01.
000269 S2-RESET-PSEUDOBLANKS SECTION.
000269 S2-RESET-PSEUDOBLANKS-01.
000269 S1-IMAGE-TO-OBJECT SECTION.
000269 S1-IMAGE-TO-OBJECT-01.
000269     MOVE S1-OBJECT (1) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-S1-001 TO SY103C-SUBSYSTEM-3.
000269     MOVE S1-OBJECT (2) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-S2-001 TO SY103C-PROGRAM-3.
000269     MOVE S1-OBJECT (7) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-A-001 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (7) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-PROG-SEC-LEVEL
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (8) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-001 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (8) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (1)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (9) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-002 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (9) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (2)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (10) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-003 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (10) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (3)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (11) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-004 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (11) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (4)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (12) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-005 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (12) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (5)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (13) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-006 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (13) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (6)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (14) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-007 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (14) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (7)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (15) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-008 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (15) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (8)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (16) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-009 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (16) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (9)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (17) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-010 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (17) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (10)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (18) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-011 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (18) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (11)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (19) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-012 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (19) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (12)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (20) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-013 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (20) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (13)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (21) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-014 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (21) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (14)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (22) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-015 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (22) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (15)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (23) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-016 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (23) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (16)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (24) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-017 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (24) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (17)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (25) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-018 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (25) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (18)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (26) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-019 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (26) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (19)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (27) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-020 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (27) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (20)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (28) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-021 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (28) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (21)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (29) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-022 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (29) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (22)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (30) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-023 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (30) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (23)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (31) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-024 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (31) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (24)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (32) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-025 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (32) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (25)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (33) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-026 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (33) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (26)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (34) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-027 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (34) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (27)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (35) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-028 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (35) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (28)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (36) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-029 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (36) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (29)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (37) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-030 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (37) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (30)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (38) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-031 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (38) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (31)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (39) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-032 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (39) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (32)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (40) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-033 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (40) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (33)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (41) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-034 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (41) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (34)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (42) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-035 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (42) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (35)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (43) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-036 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (43) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (36)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (44) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-037 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (44) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (37)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (45) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-038 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (45) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (38)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (46) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-039 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (46) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (39)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (47) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-040 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (47) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (40)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (48) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-041 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (48) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (41)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (49) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-042 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (49) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (42)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (50) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-043 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (50) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (43)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (51) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-044 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (51) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (44)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (52) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-045 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (52) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (45)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (53) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-046 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (53) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (46)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (54) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-047 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (54) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (47)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (55) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-048 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (55) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (48)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (56) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-049 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (56) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (49)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (57) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-050 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (57) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (50)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (58) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-051 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (58) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (51)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (59) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-052 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (59) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (52)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (60) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-053 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (60) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (53)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (61) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-054 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (61) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (54)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (62) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-055 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (62) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (55)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (63) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-056 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (63) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (56)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (64) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-057 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (64) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (57)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (65) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-058 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (65) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (58)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (66) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-059 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (66) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (59)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (67) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-060 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (67) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (60)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (68) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-061 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (68) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (61)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (69) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-062 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (69) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (62)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (70) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-063 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (70) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (63)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (71) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-064 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (71) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (64)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (72) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-065 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (72) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (65)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (73) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-066 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (73) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (66)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (74) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-067 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (74) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (67)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (75) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-068 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (75) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (68)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (76) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-069 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (76) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (69)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (77) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-070 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (77) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (70)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (78) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-071 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (78) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (71)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (79) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-072 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (79) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (72)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (80) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-073 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (80) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (73)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (81) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-074 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (81) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (74)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (82) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-075 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (82) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (75)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (83) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-076 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (83) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (76)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (84) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-077 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (84) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (77)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (85) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-078 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (85) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (78)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (86) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-079 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (86) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (79)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (87) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-080 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (87) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (80)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (88) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-081 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (88) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (81)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (89) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-082 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (89) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (82)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (90) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-083 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (90) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (83)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (91) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-084 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (91) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (84)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (92) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-085 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (92) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (85)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (93) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-086 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (93) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (86)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (94) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-087 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (94) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (87)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (95) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-088 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (95) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (88)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (96) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-089 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (96) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (89)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (97) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-090 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (97) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (90)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (98) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-091 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (98) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (91)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (99) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-092 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (99) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (92)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (100) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-093 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (100) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (93)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (101) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-094 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (101) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (94)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (102) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-095 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (102) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (95)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (103) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-096 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (103) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (96)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (104) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-097 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (104) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (97)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (105) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-098 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (105) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (98)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (106) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-099 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (106) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (99)
000269       ELSE PERFORM S1-MARKERROR.
000269     MOVE S1-OBJECT (107) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S1-B-100 TO DEGEN-ALPHA
000269       MOVE S1-FIELD-CONTROL (107) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-FUNCTION-SEC-LEVEL (100)
000269       ELSE PERFORM S1-MARKERROR.
000269 S2-IMAGE-TO-OBJECT SECTION.
000269 S2-IMAGE-TO-OBJECT-01.
000269     MOVE S2-OBJECT (1) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S2-S1-001 TO SY103C-SUBSYSTEM-3.
000269     MOVE S2-OBJECT (2) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S2-S2-001 TO SY103C-PROGRAM-3.
000269     MOVE S2-OBJECT (51) TO DEGEN-OBJECT.
000269     IF DEGEN-OBJECT = "1"
000269       MOVE S2-D-001 TO DEGEN-ALPHA
000269       MOVE S2-FIELD-CONTROL (51) TO DEGEN-FIELD-CONTROL
000269       PERFORM DEGEN-CONVERT
000269       IF DEGEN-RETURN-CODE = ZERO
000269         MOVE DEGEN-NUMERIC TO SY103C-PROG-SEC-LEVEL
000269       ELSE PERFORM S2-MARKERROR.
000269 S1-VALIDATE SECTION.
000269 S1-VALIDATE-01.
000270     MOVE PROG-SECURITY-CODE TO SY103C-REC-TYPE-3.
000272     PERFORM S1-B-VALIDATE
000272        VARYING DEGEN-I FROM 1 BY 1
000272        UNTIL DEGEN-I > 100
000272        OR S1-VALIDATEFLAG NOT = "Y".
000272 S2-VALIDATE SECTION.
000272 S2-VALIDATE-01.
000272 S1-B-VALIDATE SECTION.
000272 S1-B-VALIDATE-01.
000272     ADD DEGEN-I 7 GIVING DEGEN-J.
000272     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000272     IF DEGEN-OBJECT = "0"
000272      GO S1-B-VALIDATE-EXIT.
000272     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000272     MOVE SY103C-FUNCTION-SEC-LEVEL (DEGEN-I) TO
000272           DEGEN-WORK-INTEGER
000272      MOVE DEGEN-WORK-INTEGER TO DEGEN-WORKN
000272     MOVE 1 TO DEGEN-EDITFLAG
000272     IF SY103C-FUNCTION-SEC-LEVEL (DEGEN-I) NOT = ZEROES
000272           PERFORM Z-100-FN-SECURITY-EDIT
000272      MOVE DEGEN-WORKN TO DEGEN-WORK-INTEGER
000272      MOVE DEGEN-WORK-INTEGER TO SY103C-FUNCTION-SEC-LEVEL
000272           (DEGEN-I)
000272      IF DEGEN-EDITFLAG = ZERO
000272      MOVE "P" TO S1-SEVERITY
000272      MOVE S1-MSG TO S1-MSG
000272       PERFORM S1-MARKERROR.
000272 S1-B-VALIDATE-EXIT.
000272 S1-DISACCT-SM SECTION.
000272 S1-DISACCT-SM-01.
000272     MOVE "DS" TO S1-FN.
000272     CALL "WSFNS" USING S1-FN S1-REC S1-LINE
000272                        S1-POS S1-BEEPFLAG.
000272     MOVE "AS" TO S1-FN.
000272     CALL "WSFNS" USING S1-FN S1-REC S1-LINE
000272                        S1-POS S1-BEEPFLAG.
000272     MOVE SPACE TO S1-BEEPFLAG.
000272 S1-MSG-DISPLAY SECTION.
000272 S1-MSG-DISPLAY-1.
000272     PERFORM S1-DISPLAY-MSG.
000272     MOVE 80 TO S1-POS.
000272     MOVE 1 TO S1-LINE.
000272     MOVE "DS" TO S1-FN.
000272     CALL "WSFNS" USING S1-FN S1-REC S1-LINE
000272                        S1-POS S1-BEEPFLAG.
000272     MOVE "DI" TO S1-FN.
000272     CALL "WSFNS" USING S1-FN S1-REC S1-LINE
000272                        S1-POS S1-BEEPFLAG.
000272     CALL "PAUSE" USING DEGEN-PAUSE-LENGTH.
000272     PERFORM S1-ERASE-MSGS.
000272 S1-MSG-DISPLAY-RETURN.  EXIT.
000272 S1-PFACCT-M SECTION.
000272 S1-PFACCT-M-01.
000272     MOVE "PF" TO S1-FN.
000272     CALL "WSFNS" USING S1-FN S1-PF
000272                        S1-ROW S1-COL
000272                         .
000272 S2-DISACCT-SM SECTION.
000272 S2-DISACCT-SM-01.
000272     MOVE "DS" TO S2-FN.
000272     CALL "WSFNS" USING S2-FN S2-REC S2-LINE
000272                        S2-POS S2-BEEPFLAG.
000272     MOVE "AS" TO S2-FN.
000272     CALL "WSFNS" USING S2-FN S2-REC S2-LINE
000272                        S2-POS S2-BEEPFLAG.
000272     MOVE SPACE TO S2-BEEPFLAG.
000272 S2-MSG-DISPLAY SECTION.
000272 S2-MSG-DISPLAY-1.
000272     PERFORM S2-DISPLAY-MSG.
000272     MOVE 80 TO S2-POS.
000272     MOVE 1 TO S2-LINE.
000272     MOVE "DS" TO S2-FN.
000272     CALL "WSFNS" USING S2-FN S2-REC S2-LINE
000272                        S2-POS S2-BEEPFLAG.
000272     MOVE "DI" TO S2-FN.
000272     CALL "WSFNS" USING S2-FN S2-REC S2-LINE
000272                        S2-POS S2-BEEPFLAG.
000272     CALL "PAUSE" USING DEGEN-PAUSE-LENGTH.
000272     PERFORM S2-ERASE-MSGS.
000272 S2-MSG-DISPLAY-RETURN.  EXIT.
000272 S2-PFACCT-M SECTION.
000272 S2-PFACCT-M-01.
000272     MOVE "PF" TO S2-FN.
000272     CALL "WSFNS" USING S2-FN S2-PF
000272                        S2-ROW S2-COL
000272                         .
000272                                  % value 010000.
000272                                 % anything else otherwise.
000272                                  % buggy ON ERROR code.
000272                                  % replace this by ","
000272 DEGEN-CONVERT SECTION.
000272 DEGEN-CONVERT-START.
000272     MOVE 0 TO DEGEN-RETURN-CODE.
000272     INSPECT DEGEN-ALPHA REPLACING ALL LOW-VALUES BY SPACE.
000272     PERFORM DEGEN-CHECK-IF-NUMERIC.
000272     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000272        PERFORM DEGEN-CHECK-IF-NEGATIVE.
000272     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000272        PERFORM DEGEN-CHECK-DECIMALS.
000272     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000272        PERFORM DEGEN-CHECK-SIZE.
000272     IF DEGEN-RETURN-CODE NOT = ZERO
000272          MOVE "N" TO DEGEN-STATUS.
000272 DEGEN-CHECK-IF-NUMERIC SECTION.
000272 DEGEN-CHECK-IF-NUMERIC-01.
000272     MOVE ZERO TO DEGEN-RETURN-CODE.
000272     MOVE -9876543210.1234                     TO DEGEN-NUMERIC.
000272     MOVE WITH CONVERSION DEGEN-ALPHA TO DEGEN-NUMERIC.
000272     IF DEGEN-NUMERIC = -9876543210.1234
000272                   MOVE 1 TO DEGEN-RETURN-CODE.
000272 DEGEN-CHECK-IF-NEGATIVE SECTION.
000272 DEGEN-CHECK-IF-NEGATIVE-01.
000272     MOVE ZERO TO DEGEN-RETURN-CODE.
000272     IF (DEGEN-SIGN = "N") AND (DEGEN-NUMERIC < ZERO)
000272          MOVE 2 TO DEGEN-RETURN-CODE.
000272 DEGEN-CHECK-DECIMALS SECTION.
000272 DEGEN-CHECK-DECIMALS-01.
000272     IF DEGEN-DECIMALS = ZERO
000272         % Store length of variable without FAC
000272         SUBTRACT 1 FROM DEGEN-LENGTH GIVING DEGEN-L
000272         PERFORM DEGEN-DUMMY VARYING DEGEN-J FROM 1 BY 1
000272            UNTIL DEGEN-ALPHA-16(DEGEN-J) = "."
000272            OR DEGEN-J NOT < DEGEN-L
000272         IF DEGEN-ALPHA-16(DEGEN-J) = "."
000272            MOVE 3 TO DEGEN-RETURN-CODE.
000272 DEGEN-CHECK-SIZE SECTION.
000272 DEGEN-CHECK-SIZE-01.
000272     IF (DEGEN-SIGN = "N") AND (DEGEN-DECIMALS = ZERO)
000272          GO DEGEN-CHECK-SIZE-EXIT.
000272     SUBTRACT 1 FROM DEGEN-LENGTH GIVING DEGEN-L.
000272     MOVE DEGEN-L TO DEGEN-I.
000272     IF DEGEN-SIGN = "Y"
000272          SUBTRACT 1 FROM DEGEN-I.
000272     IF DEGEN-DECIMALS NOT = ZERO
000272          SUBTRACT 1 FROM DEGEN-I   % for decimal point
000272          SUBTRACT DEGEN-DECIMALS FROM DEGEN-I.
000272     PERFORM DEGEN-DUMMY VARYING DEGEN-J FROM 1 BY 1 UNTIL
000272        (DEGEN-ALPHA-16(DEGEN-J) NOT < "1"
000272                 AND NOT > "9" OR = ".")
000272        OR (DEGEN-J = DEGEN-L).
000272     IF DEGEN-ALPHA-16(DEGEN-J) = "."
000272        GO TO DEGEN-CHECK-SIZE-EXIT.
000272     ADD 1, DEGEN-J GIVING DEGEN-K.
000272     PERFORM DEGEN-DUMMY VARYING DEGEN-K FROM DEGEN-K BY 1
000272        UNTIL (DEGEN-ALPHA-16(DEGEN-K) < "0" OR  > "9")
000272           OR DEGEN-K = DEGEN-L
000272           OR DEGEN-K = 16.
000272     IF DEGEN-ALPHA-16(DEGEN-K) < "0" OR > "9"
000272        SUBTRACT 1 FROM DEGEN-K.
000272     SUBTRACT -1 DEGEN-J FROM DEGEN-K GIVING DEGEN-K
000272     IF DEGEN-K > DEGEN-I
000272        MOVE 4 TO DEGEN-RETURN-CODE.
000272 DEGEN-CHECK-SIZE-EXIT.
000272 DEGEN-DUMMY SECTION.  % This dummy section does nothing
000272 DEGEN-DUMMY-START.
000272     EXIT.
000272 Z-100-PRINT-SCREEN SECTION.
000272 Z-100-PRINT-SCREEN-1.
000272     CALL "WSCLOSE".
000272     MOVE "#"          TO SCRPRT-NAME-A.
000272     CALL "EXTRACT" USING SCRPRT-ID
000272                          SCRPRT-NAME-B.
000272     MOVE "0"          TO SCRPRT-NAME-C.
000272     MOVE SPACE        TO SCRPRT-NAME-D.
000272     CALL "SCREEN"  USING SCRPRT-WORKSTATION-STATUS
000272                          SCRPRT-UFB-ADDRESS
000272                          SCRPRT-PRINT-TYPE
000272                          SCRPRT-PRINT-FILE.
000272     CALL "BELL"    USING SCRPRT-BELL-TIME.
000272 Z-100-EXIT.  EXIT.
000272
000276 A-100-INIT-SECURITY-TABLE SECTION.
000276 A-100-INIT-SECURITY-TABLE-1.
000277     MOVE ZEROES TO SY103C-FUNCTION-SEC-LEVEL (DEGEN-I).
000278 A-100-RETURN.  EXIT.
000279
000280 Z-100-FN-SECURITY-EDIT SECTION.
000280 Z-100-FN-SECURITY-EDIT-1.
000281     IF SY103C-FUNCTION-SEC-LEVEL (DEGEN-I) <
000282        SY103C-PROG-SEC-LEVEL
000283          MOVE "Function security level cannot be less than progra
000284-              "m security level" TO S1-MSG
000285          MOVE 0 TO DEGEN-EDITFLAG.
000286 Z-100-RETURN.  EXIT.
000287
000292 SY103C-OPEN SECTION.
000292 SY103C-OPEN-RETURN.  EXIT.
000292 SY103C-OPEN-INPUT SECTION.
000292 SY103C-OPEN-INPUT-1.
000292      MOVE STDERR-IN  TO SYS99-FUNCTION.
000292      PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-OPEN-INPUT-RTN. EXIT.
000292 SY103C-OPEN-OUTPUT SECTION.
000292 SY103C-OPEN-OUTPUT-1.
000292      MOVE STDERR-OU  TO SYS99-FUNCTION.
000292      PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-OPENOUTPUT-RETURN.  EXIT.
000292 SY103C-OPEN-IO SECTION.
000292 SY103C-OPEN-IO-1.
000292      MOVE STDERR-IO TO SYS99-FUNCTION.
000292      PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-OPENIO-RETURN.  EXIT.
000292 SY103C-OPEN-SPECIAL-INPUT SECTION.
000292 SY103C-OPEN-SPECIAL-INPUT-1.
000292      MOVE STDERR-SP TO SYS99-FUNCTION.
000292      PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-OPEN-SP-IN-RTN. EXIT.
000292 SY103C-FILE-LIB-VOL SECTION.
000292 SY103C-FILE-LIB-VOL-1.
000292      MOVE STDERR-FLV TO SYS99-FUNCTION.
000292      PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-FILE-LIB-VOL-RTN. EXIT.
000292 SY103C-CLOSE SECTION.
000292 SY103C-CLOSE-1.
000292      MOVE STDERR-CL TO SYS99-FUNCTION.
000292      PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-CLOSE-RETURN.  EXIT.
000292 SY103C-READ SECTION.
000292 SY103C-READ-1.
000292     MOVE STDERR-RK TO SYS99-FUNCTION.
000292     MOVE ZERO  TO SYS99-KEY-NO.
000292         PERFORM SY103C-IOMODULE-CALL
000292         .
000292 SY103C-READ-RETURN.  EXIT.
000292 SY103C-READ-WITH-HOLD SECTION.
000292 SY103C-READ-WITH-HOLD-1.
000292     MOVE STDERR-RKH TO SYS99-FUNCTION.
000292     MOVE ZERO  TO SYS99-KEY-NO.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-READWITHHOLD-RETURN.  EXIT.
000292 SY103C-DELETE SECTION.
000292 SY103C-DELETE-1.
000292     MOVE STDERR-DL TO SYS99-FUNCTION.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-DELETE-RETURN.  EXIT.
000292 SY103C-REWRITE SECTION.
000292 SY103C-REWRITE-1.
000292     MOVE STDERR-RW TO SYS99-FUNCTION.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-REWRITE-RETURN.  EXIT.
000292 SY103C-WRITE SECTION.
000292 SY103C-WRITE-1.
000292     MOVE STDERR-WR  TO SYS99-FUNCTION.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-WRITE-RETURN.  EXIT.
000292 SY103C-START-NOT-LESS-THAN SECTION.
000292 SY103C-START-NOT-LESS-THAN-1.
000292     MOVE STDERR-SNL TO SYS99-FUNCTION.
000292     MOVE ZERO  TO SYS99-KEY-NO.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-STARTNOTLESSTHAN-RETURN.  EXIT.
000292 SY103C-START-EQUAL SECTION.
000292 SY103C-START-EQUAL-1.
000292     MOVE STDERR-SEQ TO SYS99-FUNCTION.
000292     MOVE ZERO  TO SYS99-KEY-NO.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-STARTEQUAL-RETURN.  EXIT.
000292 SY103C-START-GREATER-THAN SECTION.
000292 SY103C-START-GREATER-THAN-1.
000292     MOVE STDERR-STG TO SYS99-FUNCTION.
000292     MOVE ZERO  TO SYS99-KEY-NO.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-STARTGREATERTHAN-RETURN.  EXIT.
000292 SY103C-READ-NEXT SECTION.
000292 SY103C-READ-NEXT-1.
000292     MOVE STDERR-RN TO SYS99-FUNCTION.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-READNEXT-RETURN.  EXIT.
000292 SY103C-READ-NEXT-WITH-HOLD SECTION.
000292 SY103C-READ-NEXT-WITH-HOLD-1.
000292     MOVE STDERR-RNH TO SYS99-FUNCTION.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103C-READNEXTWITHHOLD-RETURN.  EXIT.
000292 SY103A-OPEN-INPUT SECTION.
000292 SY103A-OPEN-INPUT-1.
000292      MOVE STDERR-GIN TO SYS99-FUNCTION.
000292      PERFORM SY103C-IOMODULE-CALL.
000292 SY103A-OPEN-INPUT-RTN. EXIT.
000292 SY103A-CLOSE SECTION.
000292 SY103A-CLOSE-1.
000292      MOVE STDERR-GC TO SYS99-FUNCTION.
000292      PERFORM SY103C-IOMODULE-CALL.
000292 SY103A-CLOSE-RTN. EXIT.
000292 SY103A-READ-NEXT SECTION.
000292 SY103A-READ-NEXT-1.
000292     MOVE STDERR-GRN TO SYS99-FUNCTION.
000292     PERFORM SY103C-IOMODULE-CALL.
000292 SY103A-READ-NEXT-RTN. EXIT.
000292 SY103C-IOMODULE-CALL SECTION.
000292 SY103C-IOMODULE-CALL-1.
000292      MOVE SYS99-FUNCTION TO STDERR-SAVE-FUNCTION.
000292*      CALL "SY103C" USING  SY103C-FILE-DATA
000292*                                  SY103C-RECORD
000292*                                  SY104-RECEIVE-PORT
000292*                                  SY104-SS1-PORT
000292*                                  SY104-DATASET
000292*                                  SY104-DEADLOCK-FLAG
000292*                                  SYS99-BLOCK.
000292      IF SYS99-FUNCTION = STDERR-FE
000292          MOVE STDERR-SAVE-FUNCTION TO SYS99-FUNCTION
000292          PERFORM SY103C-FATAL-ERROR
000292      ELSE
000292      IF SY104-DEADLOCK-FLAG = STDERR-Y
000292          MOVE "FILE IN DEADLOCK" TO SYS99-MESSAGE1
000292          PERFORM SY103C-FATAL-ERROR.
000292 SY103C-IOMODULECALL-RETURN.  EXIT.
000292 SY103C-FATAL-ERROR SECTION.
000292 SY103C-FATAL-ERROR-PARA.
000292     IF SYS99-FILE        = SPACES
000292        MOVE "SY103C"                TO SYS99-FILE.
000292     IF SYS99-LIBRARY     = SPACES
000292        MOVE SY103C-LIBRARY          TO SYS99-LIBRARY.
000292     IF SYS99-VOLUME      = SPACES
000292        MOVE SY103C-VOLUME           TO SYS99-VOLUME.
000292     IF SYS99-STATUS      = SPACES
000292        MOVE SY103C-FILE-STATUS      TO SYS99-STATUS.
000292     IF SYS99-RECORD      = SPACES
000292        MOVE SY103C-RECORD        TO SYS99-RECORD.
000292     IF SYS99-KEY         = SPACES
000292        MOVE SY103C-KEY           TO SYS99-KEY.
000292     PERFORM FATAL-ERROR.
000292 SY103C-FATALERROR-RETURN.  EXIT.
000024 INITIALIZATION SECTION.
000024 INITIALIZATION-1.
000024     IF GET-RECEIVER-FIELD = SPACES
000024         CALL "GETPARM" USING GET-FUNC-TYPE
000024                          GET-FORM-TYPE
000024                          GET-PRNAME
000024                          GET-PFKEY-REC
000024                          GET-MESS-ID
000024                          GET-MESS-SOURCE
000024                          GET-MESS-TEXT
000024                          GET-MESS-TEXT-LENGTH
000024                          GET-KEYWORD-TYPE
000024                          GET-KEYWORD
000024                          GET-RECEIVER-FIELD
000024                          GET-MESSAGE-LENGTH
000024                          GET-ROW-OF-FIELD
000024                          GET-COL-OF-FIELD
000024                          GET-DATA-TYPE.
000024*$WANG_CODE
000024     MOVE "CR" TO SY104-INTTASK-FUNC.
000024     CALL "EXTRACT" USING SY104-KEYWORD
000024                          SY104-EXTRACT-PORT.
000024     MOVE SY104-BIN-PORT TO SY104-RECEIVE-PORT-RED.
000024 SY104-CREATE-PORT-RETRY.
000024     MOVE SY104-RECEIVE-PORT TO SY104-INTTASK-PORT.
000024     CALL "MESSAGE" USING SY104-INTTASK-FUNC,
000024                          SY104-INTTASK-PORT,
000024                          SY104-INTTASK-RCODE.
000024     IF SY104-INTTASK-ECODE = 4
000024         ADD 1 TO SY104-RECEIVE-PORT-RED
000024         GO TO SY104-CREATE-PORT-RETRY.
000024     MOVE SY104-INTTASK-PORT TO SY104-RECEIVE-PORT.
000024*$WANG_END
000025     MOVE "SY104" TO SYS99-PROGRAM.
000025     MOVE ZERO     TO SY104-TRANSACTION-NO.
000261 RDMN-FAC-INITIALIZATION-2.
000261     PERFORM RDMN-FAC-INITIALIZATION.
000269 DEGEN-INITIALIZATION-01.
000292     MOVE SPACES TO SY103C-FILLER.
000272 CLOSEFILES SECTION.
000272 DEGEN-CLOSEFILES-01.
000272     CALL "WSCLOSE".
000261 RDMN-FAC-INITIALIZATION SECTION.
000261 RDMN-FAC-INITIALIZATION-1.
000261     IF S1-NFIELDS > 107
000261         DISPLAY "ERROR: The number of fields on the maintenance s
000261-            "creen ",
000261             "is larger than the frame parameter SCREEN1FIELDS. ",
000261             "This parameter must be adjusted."
000261         STOP RUN.
000261 RDMN-FAC-INITIALIZATION-EXIT.
000261 RDMN-SET-ALL-FIELDS-PRO SECTION.
000261 RDMN-SET-ALL-FIELDS-PRO-01.
000261     MOVE S1-FAC (RDMN-FAC-I)
000261          TO RDMN-FACS-SAVE (RDMN-FAC-I).
000261     IF S1-OBJECT (RDMN-FAC-I) = 1
000261        IF DEGEN-PROTECTED OF S1-FAC (RDMN-FAC-I) OFF
000261           SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I)
000261                 ON
000261           SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) ON
000261           SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I)
000261                 OFF
000261           SET RDMN-NUMERIC OF S1-FAC(RDMN-FAC-I)
000261                 OFF
000261           MOVE 1 TO RDMN-MOD-FLAG (RDMN-FAC-I).
000261 RDMN-SET-ALL-FIELDS-PRO-EXIT.
000261 RDMN-PROTECT-TO-MODIFY SECTION.
000261 RDMN-PROTECT-TO-MODIFY-01.
000261     PERFORM RDMN-FIND-KEY-FIELD.
000261     IF RDMN-KEY-FLAG = 1
000261          GO TO RDMN-PROTECT-TO-MODIFY-EXIT.
000261     IF S1-OBJECT (RDMN-FAC-I) = 0
000261          GO TO RDMN-PROTECT-TO-MODIFY-EXIT.
000261     SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I) OFF .
000261     SET RDMN-UNDERSCORE OF S1-FAC(RDMN-FAC-I) ON .
000261     IF RDMN-MOD-FLAG (RDMN-FAC-I) = 1
000261          SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) OFF
000261     ELSE
000261          SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) ON .
000261     SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I) OFF .
000261     SET RDMN-NUMERIC OF S1-FAC(RDMN-FAC-I) OFF .
000261 RDMN-PROTECT-TO-MODIFY-EXIT.
000261 RDMN-MODIFY-TO-PROTECT SECTION.
000261 RDMN-MODIFY-TO-PROTECT-01.
000261     PERFORM RDMN-FIND-KEY-FIELD.
000261     IF RDMN-KEY-FLAG = 1
000261          GO TO RDMN-MODIFY-TO-PROTECT-EXIT.
000261     IF S1-OBJECT (RDMN-FAC-I) = 0
000261          GO TO RDMN-MODIFY-TO-PROTECT-EXIT.
000261     MOVE RDMN-FACS-SAVE (RDMN-FAC-I)
000261          TO S1-FAC (RDMN-FAC-I).
000261          SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I)
000261                ON .
000261          SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) ON.
000261          SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I)
000261                OFF.
000261          SET RDMN-NUMERIC OF S1-FAC(RDMN-FAC-I) OFF.
000261          IF RDMN-MOD-FLAG (RDMN-FAC-I) = 0
000261              SET RDMN-UNDERSCORE OF
000261                    S1-FAC(RDMN-FAC-I) OFF .
000261 RDMN-MODIFY-TO-PROTECT-EXIT.
000261 RDMN-SET-MOD-FIELDS-MOD SECTION.
000261 RDMN-SET-MOD-FIELDS-MOD-01.
000261     PERFORM RDMN-FIND-KEY-FIELD.
000261     IF RDMN-KEY-FLAG = 1
000261          GO TO RDMN-SET-MOD-FIELDS-MOD-EXIT.
000261     IF S1-OBJECT (RDMN-FAC-I) = 0
000261          GO TO RDMN-SET-MOD-FIELDS-MOD-EXIT.
000261     IF RDMN-MOD-FLAG (RDMN-FAC-I) = 1
000261         MOVE RDMN-FACS-SAVE (RDMN-FAC-I) TO
000261                 S1-FAC (RDMN-FAC-I).
000261 RDMN-SET-MOD-FIELDS-MOD-EXIT.
000261 RDMN-PROTECT-KEY-FIELDS SECTION.
000261 RDMN-PROTECT-KEY-FIELDS-01.
000261     PERFORM RDMN-FIND-KEY-FIELD.
000261     IF RDMN-KEY-FLAG = 0
000261          GO TO RDMN-PROTECT-KEY-FIELDS-EXIT.
000261     IF S1-OBJECT (RDMN-FAC-I) = 0
000261          GO TO RDMN-PROTECT-KEY-FIELDS-EXIT.
000261     MOVE RDMN-FACS-SAVE (RDMN-FAC-I) TO
000261            S1-FAC (RDMN-FAC-I).
000261     IF RDMN-PROTECT-KEY-FLAG = 1
000261          SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) ON
000261          SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I)
000261                OFF
000261          SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I)
000261                ON
000261          SET RDMN-NUMERIC OF S1-FAC(RDMN-FAC-I) OFF
000261       ELSE
000261         IF RDMN-MOD-FLAG (RDMN-FAC-I) = 1
000261            SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) OFF
000261            SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I)
000261                  OFF .
000261 RDMN-PROTECT-KEY-FIELDS-EXIT.
000261 RDMN-SET-FIELDS-FLASH SECTION.
000261 RDMN-SET-FIELDS-FLASH-01.
000261     PERFORM RDMN-FIND-KEY-FIELD.
000261     IF RDMN-KEY-FLAG = 1
000261          GO TO RDMN-SET-FIELDS-FLASH-EXIT.
000261     IF S1-OBJECT (RDMN-FAC-I) = 0
000261          GO TO RDMN-SET-FIELDS-FLASH-EXIT.
000261     SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) OFF
000261     SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I) ON .
000261 RDMN-SET-FIELDS-FLASH-EXIT.
000261 RDMN-FIND-KEY-FIELD SECTION.
000261 RDMN-FIND-KEY-FIELD-01.
000261     MOVE 1 TO RDMN-KEY-FLAG.
000261     IF S1-S1-SEQ NOT = RDMN-FAC-I
000261     IF S1-S2-SEQ NOT = RDMN-FAC-I
000261          MOVE 0 TO RDMN-KEY-FLAG.
000261 RDMN-FIND-KEY-FIELD-EXIT.
000272 S1-GENERATE SECTION.
000272 S1-GENERATE-01.
000272     PERFORM S1-INITIALIZE.
000272 S1-GENERATE-1. % for compatibility with older versions
000272     PERFORM S1-DISPLAY.
000272     PERFORM S1-LOCATE-FIELD
000272     PERFORM S1-PF-INTERPRET.
000272     IF S1-RETURNFLAG = "B" OR S1-RETURNFLAG = "H"
000272        GO TO S1-GENERATE-1
000272     ELSE IF S1-RETURNFLAG = "X"
000272        GO TO S1-GENERATE-EXIT.
000272     ADD 1 TO S1-CYCLE.
000272     IF S1-CYCLE > 1
000272        PERFORM S1-SETFACS
000272           VARYING S1-FIELD-I FROM 1 BY 1
000272           UNTIL S1-FIELD-I > S1-NFIELDS.
000272     MOVE SPACE TO DEGEN-STATUS S1-STATUS.
000272     PERFORM S1-IMAGE-TO-OBJECT.
000272     IF DEGEN-STATUS NOT = SPACE
000272        GO TO S1-GENERATE-1.
000272     PERFORM S1-VALIDATE.
000272     IF S1-STATUS NOT = SPACE
000272        GO TO S1-GENERATE-1.
000272 S1-GENERATE-EXIT.
000272     MOVE ZERO TO S1-LINE.
000272 S1-INITIALIZE SECTION.
000272 S1-INITIALIZE-01.
000272          MOVE "1" TO DEGEN-LASTIMAGE.
000272     PERFORM S1-SOURCE-TO-IMAGE.
000272     MOVE SPACES TO S1-WARNFLAGS.
000272     MOVE ZERO TO S1-CYCLE.
000272     PERFORM S1-SETFACS VARYING S1-FIELD-I FROM 1
000272          BY 1 UNTIL S1-FIELD-I > S1-NFIELDS.
000272     PERFORM S1-DISPLAY-MSG.
000272 S1-DISPLAY SECTION.
000272 S1-DISPLAY-01.
000272     IF S1-LINE = -1
000272        MOVE S1-ROW TO S1-LINE.
000272     IF S1-POS = -1
000272        MOVE S1-COL TO S1-POS.
000272     PERFORM S1-DISACCT-SM.
000272     MOVE -1 TO S1-LINE
000272                S1-POS.
000272     PERFORM S1-PFACCT-M.
000272     PERFORM S1-ERASE-MSGS.
000272     IF S1-PF = 15
000272               MOVE DEGEN-LOPRO TO S1-MSG-FAC
000272               MOVE "Screen printed" TO S1-MSG
000272               PERFORM S1-DISPLAY-MSG
000272               PERFORM Z-100-PRINT-SCREEN
000272               GO TO S1-DISPLAY-01.
000272     MOVE DEGEN-FLPRO TO S1-MSG-FAC.
000272     MOVE FLPRO TO S1-MSG-FAC.
000272 S1-LOCATE-FIELD SECTION.
000272 S1-LOCATE-FIELD-01.
000272     MOVE SPACE TO S1-FTAG, S1-FOUND.
000272     MOVE ZERO TO S1-OCCURRENCE.
000272     PERFORM S1-CHECK-FIELD
000272       VARYING S1-FIELD-INDEX FROM 1 BY 1
000272       UNTIL S1-FIELD-INDEX > S1-NFIELDS OR
000272             S1-FOUND NOT = SPACE.
000272     IF S1-FOUND = SPACE
000272        MOVE SPACE TO S1-FTAG
000272        MOVE ZERO TO S1-FIELD-INDEX, S1-OCCURRENCE
000272     ELSE
000272        SUBTRACT 1 FROM S1-FIELD-INDEX.
000272 S1-CHECK-FIELD SECTION.
000272 S1-CHECK-FIELD-01.
000272     IF S1-TAG (S1-FIELD-INDEX) = S1-FTAG
000272        ADD 1 TO S1-OCCURRENCE
000272     ELSE
000272        MOVE S1-TAG (S1-FIELD-INDEX) TO S1-FTAG
000272        MOVE 1 TO S1-OCCURRENCE.
000272     IF S1-ROW = S1-COORD-ROW (S1-FIELD-INDEX)
000272        IF S1-COL NOT < S1-COORD-COL (S1-FIELD-INDEX)
000272           IF S1-COL < S1-COORD-COL (S1-FIELD-INDEX)
000272              +  S1-LENGTH (S1-FIELD-INDEX)
000272              MOVE "Y" TO S1-FOUND.
000272 S1-PF-INTERPRET SECTION.
000272 S1-PF-INTERPRET-01.
000272     IF S1-PF = ZERO
000272          MOVE S1-PFK (33) TO S1-RETURNFLAG
000272     ELSE IF S1-PF > 32
000272          MOVE S1-PF TO S1-PF-DISP
000272          DISPLAY "INVALID VALUE IN PF KEY:", S1-PF-DISP
000272          MOVE "B" TO S1-RETURNFLAG
000272     ELSE
000272          MOVE S1-PFK (S1-PF) TO S1-RETURNFLAG.
000272     IF S1-RETURNFLAG = "B"
000272          MOVE S1-BEEP TO S1-BEEPFLAG
000272          MOVE "Invalid program function key" TO S1-MSG
000272          PERFORM S1-DISPLAY-MSG
000272     .
000272 S1-SETFACS SECTION.
000272 S1-SETFACS-01.
000272     MOVE S1-COORD-ROW (S1-FIELD-I) TO S1-ROW-I.
000272     MOVE S1-COORD-COL (S1-FIELD-I) TO S1-COL-I.
000272     MOVE S1-FAC (S1-FIELD-I) TO
000272          S1-COLX (S1-ROW-I, S1-COL-I).
000272 S1-MARKERROR SECTION.
000272 S1-MARKERROR-01.
000272     MOVE S1-BEEP TO S1-BEEPFLAG.
000272     MOVE S1-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL)
000272          TO DEGEN-FAC.
000272     SET DEGEN-FLASHING OF DEGEN-FAC ON.
000272     SET DEGEN-DIM OF DEGEN-FAC OFF.
000272     MOVE DEGEN-FAC TO
000272          S1-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL).
000272     IF S1-STATUS = SPACE
000272          IF DEGEN-STATUS NOT = SPACE OR (S1-SEVERITY
000272               = "W" OR "P")
000272             IF S1-LINE = -1
000272                MOVE DEGEN-COORD-ROW TO S1-LINE.
000272     IF S1-STATUS = SPACE
000272          IF DEGEN-STATUS NOT = SPACE OR (S1-SEVERITY
000272               = "W" OR "P")
000272             MOVE "E" TO S1-STATUS
000272             IF S1-POS = -1
000272                ADD 1 DEGEN-COORD-COL GIVING S1-POS.
000272     IF DEGEN-STATUS NOT = SPACE
000272          MOVE DEGEN-ERROR-MESSAGE (DEGEN-RETURN-CODE)
000272               TO S1-MSG.
000272     PERFORM S1-DISPLAY-MSG.
000272 S1-DISPLAY-MSG SECTION.
000272 S1-DISPLAY-MSG-01.
000272     IF S1-MSGEND = SPACES
000272          STRING DEGEN-HIPRO, SY104-DATASET
000272          DELIMITED BY SIZE INTO S1-MSGEND.
000272     IF S1-MSG NOT = SPACES
000272         MOVE SPACES TO S1-FINDROWFLAG
000272         IF S1-MSG-LINENO NOT > 024 AND
000272            S1-MSG-LINENO > ZERO
000272            PERFORM S1-SETMSG
000272         ELSE
000272             IF S1-MSG-LINENO = ZERO
000272                 MOVE 024 TO S1-MSG-I
000272                 PERFORM S1-FINDROW
000272                     UNTIL S1-MSG-LINENO NOT = ZERO
000272                 IF S1-MSG-LINENO NOT > 024
000272                     PERFORM S1-SETMSG
000272                 ELSE
000272                     MOVE "F" TO S1-FINDROWFLAG
000272             ELSE
000272                 MOVE "F" TO S1-FINDROWFLAG.
000272 S1-FINDROW SECTION.
000272 S1-FINDROW-01.
000272     IF S1-MSG-FLAG (S1-MSG-I) = "Y"
000272         MOVE S1-MSG-I TO S1-MSG-LINENO
000272     ELSE
000272         IF S1-MSG-I > 1
000272             SUBTRACT 1 FROM S1-MSG-I
000272         ELSE
000272             MOVE 999 TO S1-MSG-LINENO.
000272 S1-SETMSG SECTION.
000272 S1-SETMSG-01.
000272     IF S1-MSG-FLAG (S1-MSG-LINENO) = "Y"
000272         MOVE "M" TO S1-MSG-FLAG (S1-MSG-LINENO)
000272         MOVE S1-MSG-AND-FAC TO
000272         S1-ROWX(S1-MSG-LINENO)
000272         MOVE "S" TO S1-FINDROWFLAG
000272     ELSE
000272         MOVE "F" TO S1-FINDROWFLAG.
000272 S1-DISPLAY-BACKGROUND SECTION.
000272 S1-DISPLAY-BACKGROUND-01.
000272     COMPUTE DEGEN-STR-OUTPUT-OFFSET-LOW =
000272         S1-NCOLS * (S1-ROW-I - 1) + S1-COL-I - 1.
000272     CALL "STRING" USING DEGEN-STR-QUOTE-MI,
000272         DEGEN-BACKGROUND-STRING,
000272         DEGEN-STR-INPUT-OFFSET,
000272         DEGEN-STR-INPUT-LENGTH,
000272         S1-REC,
000272         DEGEN-STR-OUTPUT-OFFSET.
000272 S1-ERASE-MSGS SECTION.
000272 S1-ERASE-MSGS-01.
000272     MOVE SPACES TO S1-MSG.
000272     IF S1-MSG-LINENO = ZERO
000272         MOVE 024 TO S1-MSG-I
000272         PERFORM S1-FINDROW
000272             UNTIL S1-MSG-LINENO  NOT = ZERO.
000272     IF S1-MSG-LINENO NOT > 024
000272         MOVE "Y" TO S1-MSG-FLAG (S1-MSG-LINENO)
000272         MOVE DEGEN-LOPRO TO S1-ROWX(S1-MSG-LINENO).
000272 S2-GENERATE SECTION.
000272 S2-GENERATE-01.
000272     PERFORM S2-INITIALIZE.
000272 S2-GENERATE-1. % for compatibility with older versions
000272     PERFORM S2-DISPLAY.
000272     PERFORM S2-LOCATE-FIELD
000272     PERFORM S2-PF-INTERPRET.
000272     IF S2-RETURNFLAG = "B" OR S2-RETURNFLAG = "H"
000272        GO TO S2-GENERATE-1
000272     ELSE IF S2-RETURNFLAG = "X"
000272        GO TO S2-GENERATE-EXIT.
000272     ADD 1 TO S2-CYCLE.
000272     IF S2-CYCLE > 1
000272        PERFORM S2-SETFACS
000272           VARYING S2-FIELD-I FROM 1 BY 1
000272           UNTIL S2-FIELD-I > S2-NFIELDS.
000272     MOVE SPACE TO DEGEN-STATUS S2-STATUS.
000272     PERFORM S2-IMAGE-TO-OBJECT.
000272     IF DEGEN-STATUS NOT = SPACE
000272        GO TO S2-GENERATE-1.
000272     PERFORM S2-VALIDATE.
000272     IF S2-STATUS NOT = SPACE
000272        GO TO S2-GENERATE-1.
000272 S2-GENERATE-EXIT.
000272     MOVE ZERO TO S2-LINE.
000272 S2-INITIALIZE SECTION.
000272 S2-INITIALIZE-01.
000272          MOVE "2" TO DEGEN-LASTIMAGE.
000272     PERFORM S2-SOURCE-TO-IMAGE.
000272     MOVE SPACES TO S2-WARNFLAGS.
000272     MOVE ZERO TO S2-CYCLE.
000272     PERFORM S2-SETFACS VARYING S2-FIELD-I FROM 1
000272          BY 1 UNTIL S2-FIELD-I > S2-NFIELDS.
000272     PERFORM S2-DISPLAY-MSG.
000272 S2-DISPLAY SECTION.
000272 S2-DISPLAY-01.
000272     IF S2-LINE = -1
000272        MOVE S2-ROW TO S2-LINE.
000272     IF S2-POS = -1
000272        MOVE S2-COL TO S2-POS.
000272     PERFORM S2-DISACCT-SM.
000272     MOVE -1 TO S2-LINE
000272                S2-POS.
000272     PERFORM S2-PFACCT-M.
000272     PERFORM S2-ERASE-MSGS.
000272     IF S2-PF = 15
000272               MOVE DEGEN-LOPRO TO S2-MSG-FAC
000272               MOVE "Screen printed" TO S2-MSG
000272               PERFORM S2-DISPLAY-MSG
000272               PERFORM Z-100-PRINT-SCREEN
000272               GO TO S2-DISPLAY-01.
000272     MOVE DEGEN-FLPRO TO S2-MSG-FAC.
000272 S2-LOCATE-FIELD SECTION.
000272 S2-LOCATE-FIELD-01.
000272     MOVE SPACE TO S2-FTAG, S2-FOUND.
000272     MOVE ZERO TO S2-OCCURRENCE.
000272     PERFORM S2-CHECK-FIELD
000272       VARYING S2-FIELD-INDEX FROM 1 BY 1
000272       UNTIL S2-FIELD-INDEX > S2-NFIELDS OR
000272             S2-FOUND NOT = SPACE.
000272     IF S2-FOUND = SPACE
000272        MOVE SPACE TO S2-FTAG
000272        MOVE ZERO TO S2-FIELD-INDEX, S2-OCCURRENCE
000272     ELSE
000272        SUBTRACT 1 FROM S2-FIELD-INDEX.
000272 S2-CHECK-FIELD SECTION.
000272 S2-CHECK-FIELD-01.
000272     IF S2-TAG (S2-FIELD-INDEX) = S2-FTAG
000272        ADD 1 TO S2-OCCURRENCE
000272     ELSE
000272        MOVE S2-TAG (S2-FIELD-INDEX) TO S2-FTAG
000272        MOVE 1 TO S2-OCCURRENCE.
000272     IF S2-ROW = S2-COORD-ROW (S2-FIELD-INDEX)
000272        IF S2-COL NOT < S2-COORD-COL (S2-FIELD-INDEX)
000272           IF S2-COL < S2-COORD-COL (S2-FIELD-INDEX)
000272              +  S2-LENGTH (S2-FIELD-INDEX)
000272              MOVE "Y" TO S2-FOUND.
000272 S2-PF-INTERPRET SECTION.
000272 S2-PF-INTERPRET-01.
000272     IF S2-PF = ZERO
000272          MOVE S2-PFK (33) TO S2-RETURNFLAG
000272     ELSE IF S2-PF > 32
000272          MOVE S2-PF TO S2-PF-DISP
000272          DISPLAY "INVALID VALUE IN PF KEY:", S2-PF-DISP
000272          MOVE "B" TO S2-RETURNFLAG
000272     ELSE
000272          MOVE S2-PFK (S2-PF) TO S2-RETURNFLAG.
000272     IF S2-RETURNFLAG = "B"
000272          MOVE S2-BEEP TO S2-BEEPFLAG
000272          MOVE "Invalid program function key" TO S2-MSG
000272          PERFORM S2-DISPLAY-MSG
000272     .
000272 S2-SETFACS SECTION.
000272 S2-SETFACS-01.
000272     MOVE S2-COORD-ROW (S2-FIELD-I) TO S2-ROW-I.
000272     MOVE S2-COORD-COL (S2-FIELD-I) TO S2-COL-I.
000272     MOVE S2-FAC (S2-FIELD-I) TO
000272          S2-COLX (S2-ROW-I, S2-COL-I).
000272 S2-MARKERROR SECTION.
000272 S2-MARKERROR-01.
000272     MOVE S2-BEEP TO S2-BEEPFLAG.
000272     MOVE S2-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL)
000272          TO DEGEN-FAC.
000272     SET DEGEN-FLASHING OF DEGEN-FAC ON.
000272     SET DEGEN-DIM OF DEGEN-FAC OFF.
000272     MOVE DEGEN-FAC TO
000272          S2-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL).
000272     IF S2-STATUS = SPACE
000272          IF DEGEN-STATUS NOT = SPACE OR (S2-SEVERITY
000272               = "W" OR "P")
000272             IF S2-LINE = -1
000272                MOVE DEGEN-COORD-ROW TO S2-LINE.
000272     IF S2-STATUS = SPACE
000272          IF DEGEN-STATUS NOT = SPACE OR (S2-SEVERITY
000272               = "W" OR "P")
000272             MOVE "E" TO S2-STATUS
000272             IF S2-POS = -1
000272                ADD 1 DEGEN-COORD-COL GIVING S2-POS.
000272     IF DEGEN-STATUS NOT = SPACE
000272          MOVE DEGEN-ERROR-MESSAGE (DEGEN-RETURN-CODE)
000272               TO S2-MSG.
000272     PERFORM S2-DISPLAY-MSG.
000272 S2-DISPLAY-MSG SECTION.
000272 S2-DISPLAY-MSG-01.
000272     IF S2-MSGEND = SPACES
000272          STRING DEGEN-HIPRO, SY104-DATASET
000272          DELIMITED BY SIZE INTO S2-MSGEND.
000272     IF S2-MSG NOT = SPACES
000272         MOVE SPACES TO S2-FINDROWFLAG
000272         IF S2-MSG-LINENO NOT > 024 AND
000272            S2-MSG-LINENO > ZERO
000272            PERFORM S2-SETMSG
000272         ELSE
000272             IF S2-MSG-LINENO = ZERO
000272                 MOVE 024 TO S2-MSG-I
000272                 PERFORM S2-FINDROW
000272                     UNTIL S2-MSG-LINENO NOT = ZERO
000272                 IF S2-MSG-LINENO NOT > 024
000272                     PERFORM S2-SETMSG
000272                 ELSE
000272                     MOVE "F" TO S2-FINDROWFLAG
000272             ELSE
000272                 MOVE "F" TO S2-FINDROWFLAG.
000272 S2-FINDROW SECTION.
000272 S2-FINDROW-01.
000272     IF S2-MSG-FLAG (S2-MSG-I) = "Y"
000272         MOVE S2-MSG-I TO S2-MSG-LINENO
000272     ELSE
000272         IF S2-MSG-I > 1
000272             SUBTRACT 1 FROM S2-MSG-I
000272         ELSE
000272             MOVE 999 TO S2-MSG-LINENO.
000272 S2-SETMSG SECTION.
000272 S2-SETMSG-01.
000272     IF S2-MSG-FLAG (S2-MSG-LINENO) = "Y"
000272         MOVE "M" TO S2-MSG-FLAG (S2-MSG-LINENO)
000272         MOVE S2-MSG-AND-FAC TO
000272         S2-ROWX(S2-MSG-LINENO)
000272         MOVE "S" TO S2-FINDROWFLAG
000272     ELSE
000272         MOVE "F" TO S2-FINDROWFLAG.
000272 S2-DISPLAY-BACKGROUND SECTION.
000272 S2-DISPLAY-BACKGROUND-01.
000272     COMPUTE DEGEN-STR-OUTPUT-OFFSET-LOW =
000272         S2-NCOLS * (S2-ROW-I - 1) + S2-COL-I - 1.
000272     CALL "STRING" USING DEGEN-STR-QUOTE-MI,
000272         DEGEN-BACKGROUND-STRING,
000272         DEGEN-STR-INPUT-OFFSET,
000272         DEGEN-STR-INPUT-LENGTH,
000272         S2-REC,
000272         DEGEN-STR-OUTPUT-OFFSET.
000272 S2-ERASE-MSGS SECTION.
000272 S2-ERASE-MSGS-01.
000272     MOVE SPACES TO S2-MSG.
000272     IF S2-MSG-LINENO = ZERO
000272         MOVE 024 TO S2-MSG-I
000272         PERFORM S2-FINDROW
000272             UNTIL S2-MSG-LINENO  NOT = ZERO.
000272     IF S2-MSG-LINENO NOT > 024
000272         MOVE "Y" TO S2-MSG-FLAG (S2-MSG-LINENO)
000272         MOVE DEGEN-LOPRO TO S2-ROWX(S2-MSG-LINENO).
