000100**   Copyright (c) Shell Stream Software LLC, All Rights Reserved.
000300**
000400**   File:       t2x1.wcb
000500**
000600**   Project:    WISP/SAMPLE
000700**
000800**   Purpose:    Test the COBOL verb DISPLAY.
000900**
001000**   Example:
001100**
001200 IDENTIFICATION DIVISION.
001300 PROGRAM-ID. t2x1.
001400 
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
       FIGURATIVE-CONSTANTS. NL IS "0D".
001700 INPUT-OUTPUT SECTION.
001800
001900 DATA DIVISION.
002000 FILE SECTION.
002100 WORKING-STORAGE SECTION.
       
002300 PROCEDURE DIVISION.
002400 0000-MAIN SECTION.
       	   display "Beginning of T2X1".
       	   display "12345678901234567890",
	           "12345678901234567890",
	           "12345678901234567890",
	           "12345678901234567890".
       	   display "12345678901234567890",
	           "12345678901234567890",
	           "12345678901234567890",
	           "12345678901234567890",
       	           "12345678901234567890",
	           "12345678901234567890",
	           "12345678901234567890",
	           "12345678901234567890".
       	   display "First line", NL, "Second Line".

002500
002600 9999-END SECTION.
002700 9999-EXIT.
002800     EXIT PROGRAM.
002900 9999-STOP.
003000     STOP RUN.
006500**
006600**   End of t2x1.wcb
006700**
