      **   Copyright (c) 2003 NeoMedia Technologies, All rights reserved.
      **
      **
      **   File:       WC0002A.wcb
      **
      **   Project:    WISP/TEST - WANG COBOL Functionality
      **
      **   Purpose:    RETURN-CODE special register processing
      **
      **   Tests:	This program is called from WC0002 and sets the
      **		RETURN-CODE to '20'.
      **
       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC0002A.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.


       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

      *==============================================================
       PROCEDURE DIVISION.
       0000-MAIN SECTION.

           MOVE 20 TO RETURN-CODE.

       9999-END SECTION.
       9999-EXIT.
           EXIT PROGRAM.
       9999-STOP.
           STOP RUN.
      **
      **   End of WC0002A.wcb
      **
