      **   Copyright (c) 2002-2003 NeoMedia Technologies, All rights reserved.
      **   $Id:$
      **
      **   File:       WC0001.wcb
      **
      **   Project:    WISP/TEST - WANG COBOL Functionality
      **
      **   Purpose:    Test Repeating fields wrapping on a Screen 
      **
      **   Example:
      **
       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC0001.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CRT
               ASSIGN TO "CRT",      "DISPLAY",
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS RANDOM
               RELATIVE KEY    IS CRT-RELKEY
               PFKEY           IS CRT-PFKEY
               CURSOR POSITION IS CRT-CURSOR-POS
               FILE STATUS     IS CRT-FILE-STATUS.


       DATA DIVISION.
       FILE SECTION.

       FD  CRT
           LABEL RECORDS ARE OMITTED.
       01  CRT-RECORD                         PIC X(1924).

       WORKING-STORAGE SECTION.
      *
      *   CRT FILE VARIABLES
      *
       77  CRT-RELKEY  PIC 9(02) VALUE 1.
       77  CRT-PFKEY   PIC X(02) VALUE ZERO.
       01  CRT-CURSOR-POS.
           03  CRT-CURSOR-POS-COL  BINARY.
           03  CRT-CURSOR-POS-ROW  BINARY.
       01  CRT-FILE-STATUS.
           03  CRT-FILE-STATUS-ERR        PIC X(01).
           03  CRT-FILE-STATUS-AID        PIC X(01).

      *==============================================================
       01  TEST1-SCREEN display-ws.
           05  FILLER  PIC X(60) ROW 01 COLUMN 20
	       VALUE "TEST1: HORZ REPEAT PIC X(79) OCCURS 4 COL 2".
	   05  FILLER  PIC X(40) ROW 09 COLUMN 01
	       VALUE "----+----1----+----2----+----3----+----4".
           05  SC-F1   PIC X(79) 
      		       ROW 10 COLUMN 2 
      		       OCCURS 4
      		       SOURCE WS-F1
      		       OBJECT WS-F1.
      	   05  FILLER PIC X(40) ROW 24 COLUMN 20
      	       VALUE "(1) - Repeat  (16) - Next".		     

       01  FILLER.
           05  WS-F1-ELEMENTS.
      	       10 FILLER PIC X(79) VALUE "ONE".
      	       10 FILLER PIC X(79) VALUE "TWO".
      	       10 FILLER PIC X(79) VALUE "THREE".
      	       10 FILLER PIC X(79) VALUE "FOUR".
           05  WS-F1 REDEFINES WS-F1-ELEMENTS
      	       OCCURS 4 PIC X(79).

      *==============================================================
       01  TEST2-SCREEN display-ws.
           05  FILLER  PIC X(60) ROW 01 COLUMN 20
	       VALUE "TEST2: HORZ REPEAT PIC X(39) OCCURS 4 COL 2".
	   05  FILLER  PIC X(40) ROW 09 COLUMN 01
	       VALUE "----+----1----+----2----+----3----+----4".
           05  SC-F2   PIC X(39) 
      		       ROW 10 COLUMN 2 
      		       OCCURS 4
      		       SOURCE WS-F2
      		       OBJECT WS-F2.
      	   05  FILLER PIC X(40) ROW 24 COLUMN 20
      	       VALUE "(1) - Repeat  (16) - Next".		     

       01  FILLER.
           05  WS-F2-ELEMENTS.
      	       10 FILLER PIC X(39) VALUE "ONE".
      	       10 FILLER PIC X(39) VALUE "TWO".
      	       10 FILLER PIC X(39) VALUE "THREE".
      	       10 FILLER PIC X(39) VALUE "FOUR".
           05  WS-F2 REDEFINES WS-F2-ELEMENTS
      	       OCCURS 4 PIC X(39).

      *==============================================================
       01  TEST3-SCREEN display-ws.
           05  FILLER  PIC X(60) ROW 01 COLUMN 20
	       VALUE "TEST3: VERT REPEAT PIC X(79) OCCURS 4 COL 2".
	   05  FILLER  PIC X(40) ROW 09 COLUMN 01
	       VALUE "----+----1----+----2----+----3----+----4".
	   05  FILLER OCCURS 4.
	       10  SC-F3   PIC X(79) 
			   ROW 10 COLUMN 2 
            		   SOURCE WS-F3
			   OBJECT WS-F3.
      	   05  FILLER PIC X(40) ROW 24 COLUMN 20
      	       VALUE "(1) - Repeat  (16) - Next".		     

       01  FILLER.
           05  WS-F3-ELEMENTS.
      	       10 FILLER PIC X(79) VALUE "ONE".
      	       10 FILLER PIC X(79) VALUE "TWO".
      	       10 FILLER PIC X(79) VALUE "THREE".
      	       10 FILLER PIC X(79) VALUE "FOUR".
           05  WS-F3 REDEFINES WS-F3-ELEMENTS
      	       OCCURS 4 PIC X(79).


      *==============================================================
       01  TEST4-SCREEN display-ws.
           05  FILLER  PIC X(60) ROW 01 COLUMN 20
	       VALUE "TEST4: HORZ REPEAT PIC X(60) OCCURS 4 COL 10".
	   05  FILLER  PIC X(40) ROW 09 COLUMN 01
	       VALUE "----+----1----+----2----+----3----+----4".
           05  SC-F4   PIC X(60) 
      		       ROW 10 COLUMN 10 
      		       OCCURS 4
      		       SOURCE WS-F4
      		       OBJECT WS-F4.
      	   05  FILLER PIC X(40) ROW 24 COLUMN 20
      	       VALUE "(1) - Repeat  (16) - Next".		     

       01  FILLER.
           05  WS-F4-ELEMENTS.
      	       10 FILLER PIC X(60) VALUE "ONE".
      	       10 FILLER PIC X(60) VALUE "TWO".
      	       10 FILLER PIC X(60) VALUE "THREE".
      	       10 FILLER PIC X(60) VALUE "FOUR".
           05  WS-F4 REDEFINES WS-F4-ELEMENTS
      	       OCCURS 4 PIC X(60).

      *==============================================================
       PROCEDURE DIVISION.
       0000-MAIN SECTION.
      	   PERFORM WITH TEST AFTER 
      	       UNTIL CRT-PFKEY = "16" 	   
      	       display and read TEST1-SCREEN on crt
      		   ONLY PFKEYS 1, 16
      	   END-PERFORM.
      	   PERFORM WITH TEST AFTER 
      	       UNTIL CRT-PFKEY = "16"   
      	       display and read TEST2-SCREEN on crt
      		   ONLY PFKEYS 1, 16
      	   END-PERFORM.
      	   PERFORM WITH TEST AFTER 
      	       UNTIL CRT-PFKEY = "16"   
      	       display and read TEST3-SCREEN on crt
      		   ONLY PFKEYS 1, 16
      	   END-PERFORM.
      	   PERFORM WITH TEST AFTER 
      	       UNTIL CRT-PFKEY = "16"   
      	       display and read TEST4-SCREEN on crt
      		   ONLY PFKEYS 1, 16
      	   END-PERFORM.

       9999-END SECTION.
       9999-EXIT.
           EXIT PROGRAM.
       9999-STOP.
           STOP RUN.
      **
      **   End of WC0001.wcb
      **
