000100**   Copyright (c) Shell Stream Software LLC, All Rights Reserved.
000200**
000300**
000400**   File:       wl0023.wcb
000500**
000600**   Project:    WISP/TEST
000700**
000800**   Purpose:    Test BIT_OFF/LBIT_OFF,
      **                    BIT_ON/LBIT_ON,
      **                    BIT_TEST routine.
000900**
001000**   Example:
001100**
006500**
001100 Identification Division.
001200 Program-Id.     wl0023.
001300 Data Division.
001400 Working-Storage Section.

       01 MASK-BYTE                 PIC X.
       01 TARGET-BYTE               PIC X.
       01 LMASK-BYTE                PIC X(04).                
       01 LTARGET-BYTE              PIC X(04).         
       01 TEST-RESULT               PIC X.
       01  COMPLETION-STATUS        PIC 9(02) VALUE 0.

001600 Procedure Division.
      *BIT_OFF.
           MOVE "@"     TO MASK-BYTE.
           MOVE "a"     TO TARGET-BYTE.
           CALL "BIT_OFF" USING MASK-BYTE, TARGET-BYTE.

           IF TARGET-BYTE NOT = "!" THEN
              ADD 1     TO COMPLETION-STATUS.

      *LBIT_OFF.
           MOVE "   @"     TO LMASK-BYTE.
           MOVE "abca"     TO LTARGET-BYTE.

           CALL "LBIT_OFF" USING LMASK-BYTE, LTARGET-BYTE.

           IF LTARGET-BYTE NOT = "ABC!" THEN
              ADD 1     TO COMPLETION-STATUS.

      *BIT_ON.
           MOVE "@"     TO MASK-BYTE.
           MOVE "!"     TO TARGET-BYTE.
           CALL "BIT_ON" USING MASK-BYTE, TARGET-BYTE.

           IF TARGET-BYTE NOT = "a" THEN
              ADD 1     TO COMPLETION-STATUS.

      *LBIT_ON.
           MOVE "   @"     TO LMASK-BYTE.
           MOVE "ABC!"     TO LTARGET-BYTE.

           CALL "LBIT_ON" USING LMASK-BYTE, LTARGET-BYTE.

           IF LTARGET-BYTE NOT = "abca" THEN
              ADD 1     TO COMPLETION-STATUS.

      *BIT_TEST.
           MOVE " "     TO MASK-BYTE.
           MOVE "@"     TO TARGET-BYTE.
           CALL "BIT_TEST" USING MASK-BYTE, TARGET-BYTE, TEST-RESULT.

           IF TEST-RESULT NOT = "N" THEN
              ADD 1     TO COMPLETION-STATUS.

           MOVE "b"     TO MASK-BYTE.
           MOVE "c"     TO TARGET-BYTE.
           CALL "BIT_TEST" USING MASK-BYTE, TARGET-BYTE, TEST-RESULT.

           IF TEST-RESULT NOT = "Y" THEN
              ADD 1     TO COMPLETION-STATUS.

      *WSETFACBLINK.
           MOVE "J"     TO TARGET-BYTE.
           CALL "WSETFACBLINK" USING TARGET-BYTE.

           IF TARGET-BYTE NOT = "R" THEN
	      DISPLAY "WSETFACBLINK J->R failed"
              ADD 1     TO COMPLETION-STATUS.

           MOVE "o"     TO TARGET-BYTE.
           CALL "WSETFACBLINK" USING TARGET-BYTE.

           IF TARGET-BYTE NOT = "w" THEN
	      DISPLAY "WSETFACBLINK o->w failed"
              ADD 1     TO COMPLETION-STATUS.

           PERFORM CHECK-STATUS.


       CHECK-STATUS.
           IF  COMPLETION-STATUS = 0 THEN
                DISPLAY "BIT_OFF, BIT_ON, BIT_TEST, WSETFACBLINK
      -             " completion successful."
           ELSE
                DISPLAY "BIT_OFF, BIT_ON, BIT_TEST, WSETFACBLINK
      -             " failed."
           END-IF.
           EXIT PROGRAM.
           STOP RUN.



006600**   End of wl0023.wcb

