000100
000200/*****************************************************************
000300*                                                                *
000400*                       IDENTIFICATION DIVISION                  *
000500*                                                                *
000600******************************************************************
000700*
000800 IDENTIFICATION DIVISION.
000900 PROGRAM-ID.
001000     WL0000.
001100 AUTHOR.
001200     Yelena Kuzmina.
001300 DATE-WRITTEN.
001400     11/14/96.
001500/*****************************************************************
001600*                                                                *
001700*                         ENVIRONMENT DIVISION                   *
001800*                                                                *
001900******************************************************************
002000*
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.
002400     WANG-VS.
002500 OBJECT-COMPUTER.
002600     WANG-VS.
002700 FIGURATIVE-CONSTANTS.
002800     BLINK-BIT IS "10"
002900     PROTECT-BIT IS "04"
003000     DIM-BIT IS "08"
003100     TAB-STOP IS "86"
003200     BLINKING-DISPLAY IS "94"
003300     LOWER-FAC IS "80"
003400     BRITE IS "84"
003500     NO-ECHO IS "98"
003600     PFK-NOT-SET IS "00"
003700     PFK-SET IS "01"
003800     HEX-00 IS "00", HEX-01 IS "01",
003900     HEX-40 IS "40", HEX-80 IS "80", HEX-A0 IS "A0".
004000
004100/*****************************************************************
004200*                                                                *
004300*                         INPUT-OUTPUT SECTION                   *
004400*                                                                *
004500******************************************************************
004600*
004700 INPUT-OUTPUT SECTION.
004800 FILE-CONTROL.
004900*
005000     SELECT CRT
005100         ASSIGN TO "CRT",      "DISPLAY",
005200         ORGANIZATION    IS SEQUENTIAL
005300         ACCESS MODE     IS RANDOM
005400         RELATIVE KEY    IS LINENUM
005500         PFKEY           IS PF-KEY
005600         CURSOR POSITION IS CURSOR-POS
005700         FILE STATUS     IS FILSTAT.
005800
006800
006900/*****************************************************************
007000*                                                                *
007100*                      DATA DIVISION - FILE SECTION              *
007200*                                                                *
007300******************************************************************
007400*
007500 DATA DIVISION.
007600 FILE SECTION.
007700*
007800 FD  CRT
007900     LABEL RECORDS ARE OMITTED.
008000 01  CRTREC                         PIC X(1924).
008100
008800/*****************************************************************
008900*                                                                *
009000*                         WORKING STORAGE                        *
009100*                                                                *
009200******************************************************************
009300*
009400 WORKING-STORAGE SECTION.
009500
009600 01  INDEX-COUNTER                  PIC 9(5).
009700 01  FILSTAT.
009800     03  ERR-FLAG                   PIC X(01).
009900     03  PFK-BYTE                   PIC X(01).
010000
010100 77  LINENUM                        PIC 9(02) VALUE 1.
010200 77  PF-KEY                         PIC X(02) VALUE ZERO.
010300
010400 01  CURSOR-POS.
010500     03  MOD-COL                    BINARY.
010600     03  MOD-ROW                    BINARY.
010700
010800 01  REDEF-CURS-POS                 REDEFINES CURSOR-POS.
010900     03  FILLER                     PIC X(01).
011000     03  CURS-COL                   PIC X(01).
011100     03  FILLER                     PIC X(01).
011200     03  CURS-ROW                   PIC X(01).
011300
010300
238300 01  SUBROUTINE-SCREEN USAGE IS DISPLAY-WS.
238400     03  FILLER  PIC X(15) ROW 1 COLUMN 20 VALUE
238500         "SELECT TO TEST:".
238600     03  FILLER  PIC X(35) ROW 1 COLUMN 60 VALUE
238700         "AUTOTEST-SCREEN".  
238800     03  FILLER  PIC X(35) ROW 3 COLUMN 2 VALUE 
238900         "(1)  WL0010 (WISPPLAT)".
239000     03  FILLER  PIC X(38) ROW 4 COLUMN 2 VALUE
239100         "(2)  WL0011(USERSOFTLINK/USERHARDLINK)".
239200     03  FILLER  PIC X(35) ROW 5 COLUMN 2 VALUE
239300         "(3)  WL0012 (BITPACK)".
239400     03  FILLER  PIC X(35) ROW 6 COLUMN 2 VALUE
239500         "(4)  WL0013 (BITUNPK)".
239600     03  FILLER  PIC X(35) ROW 7 COLUMN 2 VALUE
239700         "(5)  WL0014 (HEXPACK)".
239800     03  FILLER  PIC X(35) ROW 8 COLUMN 2 VALUE
239900         "(6)  WL0015 (HEXUNPK)".
240000     03  FILLER  PIC X(36) ROW 9 COLUMN 2 VALUE
240100         "(7)  WL0016 (DATE/DATE2/DATE4/DATE6)".
240200     03  FILLER  PIC X(35) ROW 10 COLUMN 2 VALUE
240300         "(8)  WL0017 (DAY)".
240400     03  FILLER  PIC X(35) ROW 11 COLUMN 2 VALUE
240500         "(9)  WL0018/A/B (MESSAGE)".
240600     03  FILLER  PIC X(35) ROW 12 COLUMN 2 VALUE
240700         "(10) WL0019 (SEARCH)".
240800     03  FILLER  PIC X(35) ROW 13 COLUMN 2 VALUE
240900         "(11) WL0020 (SORT)".
241000     03  FILLER  PIC X(35) ROW 14 COLUMN 2 VALUE
241100         "(12) WL0021 (STRING)".
241200     03  FILLER  PIC X(35) ROW 15 COLUMN 2 VALUE
241300         "(13) WL0022 (SET/EXTRACT)".
241400     03  FILLER  PIC X(35) ROW 16 COLUMN 2 VALUE
241500         "(14) WL0023 (BIT_ON/OFF/TEST)".
241600     03  FILLER  PIC X(35) ROW 17 COLUMN 2 VALUE
241700         "(15) WL0024 (UPPER)".
241800     03  FILLER  PIC X(35) ROW 19 COLUMN 2 VALUE
241900         "(16) EXIT".
242000     03  FILLER  PIC X(35) ROW 3 COLUMN 40 VALUE
242100         "(17) WL0025 (WGETCURPOS)".
242200     03  FILLER  PIC X(35) ROW 4 COLUMN 40 VALUE
242300         "(18) WL0026 (W99TOX)".
242400     03  FILLER  PIC X(35) ROW 5 COLUMN 40 VALUE
242500         "(19) WL0027 (PUTPARM)".
242600     03  FILLER  PIC X(35) ROW 6 COLUMN 40 VALUE
242700         "(20) WL0028 (FILECOPY)".
242800     03  FILLER  PIC X(35) ROW 7 COLUMN 40 VALUE
242900         "(21) WL0029 (SCRATCH)".
243000     03  FILLER  PIC X(35) ROW 8 COLUMN 40 VALUE
243100         "(22) WL0030 (SUBMIT)".
243200     03  FILLER  PIC X(35) ROW 9 COLUMN 40 VALUE
243300         "(23) WL0031 (SETFILE)".
243400     03  FILLER  PIC X(35) ROW 10 COLUMN 40 VALUE
243500         "(24) WL0032 (RENAME)".
243600     03  FILLER  PIC X(35) ROW 11 COLUMN 40 VALUE
243700         "(25) WL0033 (FIND)".
243800     03  FILLER  PIC X(35) ROW 12 COLUMN 40 VALUE
243900         "(26) WL0034 (LINK)".
244000     03  FILLER  PIC X(35) ROW 13 COLUMN 40 VALUE
244100         "(27) WL0035 (READVTOC)".
244200     03  FILLER  PIC X(35) ROW 14 COLUMN 40 VALUE
244300         "(28) ".
244400     03  FILLER  PIC X(35) ROW 15 COLUMN 40 VALUE
244500         "(29) ".
244600     03  FILLER  PIC X(35) ROW 16 COLUMN 40 VALUE
244700         "(30) ".
244800     03  FILLER  PIC X(35) ROW 17 COLUMN 40 VALUE
244900         "(31) ".
245000     03  FILLER  PIC X(35) ROW 19 COLUMN 40 VALUE
245100         "(32) ".
245200     03  FILLER  PIC X(23) ROW 24 COLUMN 10 VALUE
245300         "PRESS (16) TO EXIT".
245400
	01  MESSAGE-SCREEN USAGE IS DISPLAY-WS.
	   03  FILLER  PIC X(15) ROW 1 COLUMN 20 VALUE
	         "SELECT TO TEST:".
	   03  FILLER  PIC X(35) ROW 1 COLUMN 60 VALUE
	         "MESSAGETESTS-SCREEN".  
	   03  FILLER  PIC X(35) ROW 5 COLUMN 2 VALUE 
	         "(1)  WL0018 (SINGLE USER)".
	   03  FILLER  PIC X(35) ROW 7 COLUMN 2 VALUE 
	         "(2)  WL0018A (TWO USER - A)".
	   03  FILLER  PIC X(35) ROW 9 COLUMN 2 VALUE 
	         "(3)  WL0018B (TWO USER - B)".
	   03  FILLER  PIC X(23) ROW 24 COLUMN 10 VALUE
	         "PRESS (16) TO EXIT".

274600
274700/*****************************************************************
274800*                                                                *
274900*                         PROCEDURE DIVISION                     *
275000*                                                                *
275100******************************************************************
275200*
275300 PROCEDURE DIVISION.
275400
275500 SUBROUTINE-TESTS.
275600
275700     DISPLAY AND READ SUBROUTINE-SCREEN ON CRT
275800     PFKEYS  1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
275900            11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
276000            21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
276100            31, 32.
276200
276300     IF PF-KEY = "01" THEN
276400        CALL "WL0010"
276500        GO TO SUBROUTINE-TESTS
276600     ELSE IF PF-KEY = "02" THEN
276700        CALL "WL0011"
276800        GO TO SUBROUTINE-TESTS
276900     ELSE IF PF-KEY = "03" THEN
277000        CALL "WL0012" 
277100        GO TO SUBROUTINE-TESTS
277200     ELSE IF PF-KEY = "04" THEN
277300        CALL "WL0013"
277400        GO TO SUBROUTINE-TESTS
277500     ELSE IF PF-KEY = "05" THEN
277600        CALL "WL0014"
277700        GO TO SUBROUTINE-TESTS
277800     ELSE IF PF-KEY = "06" THEN
277900        CALL "WL0015" 
278000        GO TO SUBROUTINE-TESTS
278100     ELSE IF PF-KEY = "07" THEN
278200        CALL "WL0016"
278300        GO TO SUBROUTINE-TESTS
278400     ELSE IF PF-KEY = "08" THEN
              CALL "WL0017"
278600        GO TO SUBROUTINE-TESTS
278700     ELSE IF PF-KEY = "09" THEN
	      PERFORM MESSAGE-SCREEN-PARA
	      UNTIL PF-KEY = "16"
278900        GO TO SUBROUTINE-TESTS
279000     ELSE IF PF-KEY = "10" THEN
              CALL "WL0019"
279200        GO TO SUBROUTINE-TESTS
279300     ELSE IF PF-KEY = "11" THEN
              CALL "WL0020"
279500        GO TO SUBROUTINE-TESTS
279600     ELSE IF PF-KEY = "12" THEN
              CALL "WL0021"
279800        GO TO SUBROUTINE-TESTS
279900     ELSE IF PF-KEY = "13" THEN
              CALL "WL0022"
280100        GO TO SUBROUTINE-TESTS
280200     ELSE IF PF-KEY = "14" THEN
              CALL "WL0023"
280400        GO TO SUBROUTINE-TESTS
280500     ELSE IF PF-KEY = "15" THEN
              CALL "WL0024"
280700        GO TO SUBROUTINE-TESTS
280800     ELSE IF PF-KEY = "17" THEN
              CALL "WL0025"
281000        GO TO SUBROUTINE-TESTS
281100     ELSE IF PF-KEY = "18" THEN
              CALL "WL0026"
281300        GO TO SUBROUTINE-TESTS
281400     ELSE IF PF-KEY = "19" THEN
              CALL "WL0027"
281600        GO TO SUBROUTINE-TESTS
281700     ELSE IF PF-KEY = "20" THEN
              CALL "WL0028"
281900        GO TO SUBROUTINE-TESTS
282000     ELSE IF PF-KEY = "21" THEN
              CALL "WL0029"
282200        GO TO SUBROUTINE-TESTS
282300     ELSE IF PF-KEY = "22" THEN
              CALL "WL0030"
282500        GO TO SUBROUTINE-TESTS
282600     ELSE IF PF-KEY = "23" THEN
              CALL "WL0031"
282800        GO TO SUBROUTINE-TESTS
282900     ELSE IF PF-KEY = "24" THEN
              CALL "WL0032"
283100        GO TO SUBROUTINE-TESTS
283200     ELSE IF PF-KEY = "25" THEN
283210        CALL "WL0033"
283400        GO TO SUBROUTINE-TESTS
283500     ELSE IF PF-KEY = "26" THEN
283510        CALL "WL0034"
284000        GO TO SUBROUTINE-TESTS
283800     ELSE IF PF-KEY = "27" THEN
283810        CALL "WL0035"
284000        GO TO SUBROUTINE-TESTS
284100     ELSE IF PF-KEY = "28" THEN
284300        GO TO SUBROUTINE-TESTS
284400     ELSE IF PF-KEY = "29" THEN
284600        GO TO SUBROUTINE-TESTS
284700     ELSE IF PF-KEY = "30" THEN
284900        GO TO SUBROUTINE-TESTS
285000     ELSE IF PF-KEY = "31" THEN
285100        GO TO SUBROUTINE-TESTS
285200     ELSE IF PF-KEY = "32" THEN
285300        GO TO SUBROUTINE-TESTS
285400     ELSE IF PF-KEY = "16" THEN
285500        GO TO EXIT-PROGRAM.
285600
285700     GO TO SUBROUTINE-TESTS.
285800

       MESSAGE-SCREEN-PARA.

           DISPLAY AND READ MESSAGE-SCREEN ON CRT
		PFKEYS  1,  2,  3,  16.
	   IF PF-KEY = "01" THEN
              CALL "WL0018"
	   ELSE IF PF-KEY = "02" THEN
              CALL "WL0018A"
	   ELSE IF PF-KEY = "03" THEN
              CALL "WL0018B"
	   END-IF.

399500******************************************************************
399600* ALL DONE.
399700******************************************************************
399800
399900 EXIT-PROGRAM.
400000     EXIT PROGRAM.
400100
400200 STOP-RUN.
400300     STOP RUN.

