000100**   Copyright (c) Shell Stream Software LLC, All Rights Reserved.
000200**
000300**
000400**   File:       wl0026.wcb
000500**
000600**   Project:    WISP/TEST
000700**
000800**   Purpose:    Test W99TOX routine.
000900**
001000**   Example:
001100**
006500**
001100 Identification Division.
001200 Program-Id.     wl0026.
       Environment Division.
       Configuration Section.
       FIGURATIVE-CONSTANTS.
           DEC-24 IS "18",
           DEC-14 IS "E".
001300 Data Division.
001400 Working-Storage Section.

       01 SOURCE-ITEM              PIC 9(02) VALUE 0.

       01 DESTIN-ITEM              PIC X(01) VALUE SPACES.

       01  COMPLETION-STATUS        PIC 9(02) VALUE 0.

001600 Procedure Division.


       	   MOVE 24         TO SOURCE-ITEM.
           CALL "W99TOX" USING SOURCE-ITEM, DESTIN-ITEM.
       	   IF DESTIN-ITEM NOT = DEC-24  THEN
               ADD 1     TO COMPLETION-STATUS.

       	   MOVE 14         TO SOURCE-ITEM.
       	   CALL "W99TOX" USING SOURCE-ITEM, DESTIN-ITEM.
       	   IF DESTIN-ITEM NOT = DEC-14  THEN
               ADD 1     TO COMPLETION-STATUS.


       CHECK-STATUS.
           IF  COMPLETION-STATUS = 0 THEN
               DISPLAY "W99TOX completion successful."
           ELSE
               DISPLAY "W99TOX failed.".

            EXIT PROGRAM.
            STOP RUN.

006600**   End of wl0026.wcb


