000100**   Copyright (c) Shell Stream Software LLC, All Rights Reserved.
000200**
000300**
000400**   File:       wl0025.wcb
000500**
000600**   Project:    WISP/TEST
000700**
000800**   Purpose:    Test WGETCURPOS routine.
000900**
001000**   Example:
001100**
006500**
001100 Identification Division.
001200 Program-Id.     wl0025.
       Environment Division.
       Configuration Section.
       FIGURATIVE-CONSTANTS.
           DEC-24 IS "18",
           DEC-38 IS "26",
           DEC-5  IS "5",
           DEC-14 IS "E".
001300 Data Division.
001400 Working-Storage Section.

       01 SOURCE-ITEM              PIC X(02).
       01 SRC-ITEM REDEFINES SOURCE-ITEM.
          03 COL-BYTE              PIC X .
          03 ROW-BYTE              PIC X .

       01 DESTIN-ITEM              PIC X(04).
       01 DST-ITEM REDEFINES DESTIN-ITEM.
          03 COL-BINARY            BINARY .
          03 ROW-BINARY            BINARY .

       01  COMPLETION-STATUS        PIC 9(02) VALUE 0.

001600 Procedure Division.

           MOVE DEC-24         TO COL-BYTE.
           MOVE DEC-38         TO ROW-BYTE.
           CALL "WGETCURPOS" USING SRC-ITEM, DST-ITEM.
           IF COL-BINARY NOT = 24 AND ROW-BINARY NOT = 38 THEN
              ADD 1     TO COMPLETION-STATUS.

           MOVE DEC-5          TO COL-BYTE.
           MOVE DEC-14         TO ROW-BYTE.
           CALL "WGETCURPOS" USING SRC-ITEM, DST-ITEM.
           IF COL-BINARY NOT = 5 AND ROW-BINARY NOT = 14 THEN
              ADD 1     TO COMPLETION-STATUS.

       CHECK-STATUS.
           IF  COMPLETION-STATUS = 0 THEN
           DISPLAY "WGETCURPOS completion successful."
           ELSE
                DISPLAY "WGETCURPOS failed.".

            EXIT PROGRAM.
            STOP RUN.






006600**   End of wl0025.wcb

