000100**   Copyright (c) Shell Stream Software LLC, All Rights Reserved.
000200**
000300**
000400**   File:       wl0012.wcb
000500**
000600**   Project:    WISP/TEST
000700**
000800**   Purpose:    Test BITPACK routine 
000900**
001000**   Example:
001100**
006500**
001100 Identification Division.
001200 Program-Id.     wl0012.
001300 Data Division.
001400 Working-Storage Section.
001500 01  INPUT-STRING       PIC X(16).
       01  OUTPUT-STRING      PIC X(2).
       01  INPUT-LENGTH.
           03 FILLER          BINARY   VALUE 0.
           03 INPUT-LEN       BINARY.
  
001600 Procedure Division.  
           MOVE LOW-VALUES TO INPUT-LENGTH.
           MOVE 16 TO INPUT-LEN.
           MOVE "0100000101000001"   TO INPUT-STRING.
           CALL "BITPACK" USING INPUT-STRING,
                               OUTPUT-STRING,
                               INPUT-LENGTH.  
 
           IF OUTPUT-STRING = "AA"   THEN
                DISPLAY "BITPACK completion successful."
           ELSE 
                DISPLAY "BITPACK failed.".

            EXIT PROGRAM.
            STOP RUN.
  
006600**   End of wl0012.wcb 
