000100**   Copyright (c) 1994-2003, NeoMedia Technologies, Inc. All Rights Reserved.
000200**
000300**
000400**   File:       wl0022.wcb
000500**
000600**   Project:    WISP/TEST
000700**
000800**   Purpose:    Test SET/EXTRACT routines
000900**
001000**   Example:
001100**
006500**
001100 Identification Division.
001200 Program-Id.     wl0022.
001300 Data Division.
001400 Working-Storage Section.

217000 01  THE-KW			PIC X(02)  VALUE SPACES.
217100 01  SET-VALUE-ALPHA		PIC X(80)  VALUE SPACES.
217200 01  SET-VALUE-INT.
217300     03  SET-VALUE-INT-1          BINARY  VALUE 0.
217400     03  SET-VALUE-INT-2          BINARY  VALUE 0.
217100 01  ORIG-VALUE-ALPHA		PIC X(80)  VALUE SPACES.
217200 01  ORIG-VALUE-INT.
217300     03  ORIG-VALUE-INT-1         BINARY  VALUE 0.
217400     03  ORIG-VALUE-INT-2         BINARY  VALUE 0.
180900 01  EXT-RECVR-ALPHA		PIC X(80) VALUE SPACES.
181900 01  EXT-RECVR-INT.
182000     03  EXT-RECVR-INT-1		BINARY VALUE 0.
182100     03  EXT-RECVR-INT-2		BINARY VALUE 0.
       01  EXPECT-ALPHA			PIC X(80) VALUE SPACES.
       01  EXPECT-INT.
           03  EXPECT-INT-1		BINARY VALUE 0.
           03  EXPECT-INT-2		BINARY VALUE 0.

       01  COMPLETION-STATUS          PIC 9(02)  VALUE 0.
001600 Procedure Division.

      *---------------------------------------------------------------
       0000-MAIN SECTION.
      *---------------------------------------------------------------
       TEST-SET-SIMPLE.
      *Keyword - "FN" 
           MOVE "FN"       TO THE-KW.
           MOVE LOW-VALUES TO SET-VALUE-INT.
           MOVE 25         TO SET-VALUE-INT-2.
           PERFORM DO-SET-TEST-INTEGER-SIMPLE.

      *Keyword - "IL" 
           MOVE "IL"       TO THE-KW.
           MOVE "INPUTLIB" TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "IV" 
           MOVE "IV"       TO THE-KW.
           MOVE "VOL100"   TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "JC" 
           MOVE "JC"       TO THE-KW.
           MOVE "B"        TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "JS" 
           MOVE "JS"       TO THE-KW.
           MOVE "H"        TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "JL" 
           MOVE "JL"       TO THE-KW.
           MOVE LOW-VALUES TO SET-VALUE-INT.
           MOVE 1000       TO SET-VALUE-INT-2.
           PERFORM DO-SET-TEST-INTEGER-SIMPLE.

      *Keyword - "LI" 
           MOVE "LI"       TO THE-KW.
           MOVE LOW-VALUES TO SET-VALUE-INT.
           MOVE 20         TO SET-VALUE-INT-2.
           PERFORM DO-SET-TEST-INTEGER-SIMPLE.

      *Keyword - "OL" 
           MOVE "OL"       TO THE-KW.
           MOVE "OUTPUTLB" TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "OV" 
           MOVE "OV"       TO THE-KW.
           MOVE "OUTVOL"   TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "P#/PR"" 
           MOVE "P#"       TO THE-KW.
           MOVE LOW-VALUES TO SET-VALUE-INT.
           MOVE 15         TO SET-VALUE-INT-2.
           PERFORM DO-SET-TEST-INTEGER-SIMPLE.

      *Keyword - "PC" 
           MOVE "PC"       TO THE-KW.
           MOVE "A"        TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "PL" 
           MOVE "PL"       TO THE-KW.
           MOVE "PROGLIBR" TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "PM" 
           MOVE "PM"       TO THE-KW.
           MOVE "A"        TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "PV" 
           MOVE "PV"       TO THE-KW.
           MOVE "PRGVOL"   TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "RL" 
           MOVE "RL"       TO THE-KW.
           MOVE "RUNLIBRY" TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "RV" 
           MOVE "RV"       TO THE-KW.
           MOVE "RUNVOL"   TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "SL" 
           MOVE "SL"       TO THE-KW.
           MOVE "SPOOLLIB" TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "SV" 
           MOVE "SV"       TO THE-KW.
           MOVE "SPOVOL"   TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *Keyword - "WV" 
           MOVE "WV"       TO THE-KW.
           MOVE "WORVOL"   TO SET-VALUE-ALPHA.
           PERFORM DO-SET-TEST-ALPHA-SIMPLE.

      *---------------------------------------------------------------
       TEST-EXTRACT-SIMPLE.

      *Keyword - "TT" 
           MOVE "TT"       TO THE-KW.
           MOVE "F"        TO EXPECT-ALPHA
           PERFORM DO-EXTRACT-TEST-ALPHA-SIMPLE.

      *Keyword - "XV" 
           MOVE "XV"       TO THE-KW.
           MOVE "IPLVOL"   TO EXPECT-ALPHA
           PERFORM DO-EXTRACT-TEST-ALPHA-SIMPLE.

      *---------------------------------------------------------------
       TEST-EXTRACT-X1.
      *Keyword - "CL" equal to RL
           MOVE "RL"       TO THE-KW.
       	   CALL "EXTRACT" USING THE-KW, ORIG-VALUE-ALPHA.
           MOVE "CL"       TO THE-KW.
       	   CALL "EXTRACT" USING THE-KW, EXT-RECVR-ALPHA.
       	   If ORIG-VALUE-ALPHA NOT = EXT-RECVR-ALPHA THEN
	       PERFORM REPORT-ERROR.

      *Keyword - "CV" equal to RV
           MOVE "RV"       TO THE-KW.
       	   CALL "EXTRACT" USING THE-KW, ORIG-VALUE-ALPHA.
           MOVE "CV"       TO THE-KW.
       	   CALL "EXTRACT" USING THE-KW, EXT-RECVR-ALPHA.
       	   If ORIG-VALUE-ALPHA NOT = EXT-RECVR-ALPHA THEN
	       PERFORM REPORT-ERROR.

      *---------------------------------------------------------------
       CHECK-STATUS.
           IF  COMPLETION-STATUS = 0 THEN
                DISPLAY "SET/EXTRACT completion successful."
           ELSE
                DISPLAY "SET/EXTRACT failed. Status = " 
       	       	   COMPLETION-STATUS.

      *---------------------------------------------------------------
       9999-MAIN-END SECTION.
      *---------------------------------------------------------------
           EXIT PROGRAM.
           STOP RUN.

      *---------------------------------------------------------------
       DO-SET-TEST-ALPHA-SIMPLE.
      *	   Save the original value
       	   CALL "EXTRACT" USING THE-KW, ORIG-VALUE-ALPHA.

           CALL "SET"     USING THE-KW, SET-VALUE-ALPHA.

	   MOVE SPACES TO EXT-RECVR-ALPHA.
           CALL "EXTRACT" USING THE-KW, EXT-RECVR-ALPHA.

           IF EXT-RECVR-ALPHA NOT = SET-VALUE-ALPHA 
	   THEN
               PERFORM REPORT-ERROR
	   END-IF.

      *    Restore the original value
	   CALL "SET" USING THE-KW, ORIG-VALUE-ALPHA.

      *---------------------------------------------------------------
       DO-SET-TEST-INTEGER-SIMPLE.
      *	   Save the original value
       	   CALL "EXTRACT" USING THE-KW, ORIG-VALUE-INT.

           CALL "SET"     USING THE-KW, SET-VALUE-INT.

	   MOVE LOW-VALUES TO EXT-RECVR-INT.
           CALL "EXTRACT" USING THE-KW, EXT-RECVR-INT.

           IF (EXT-RECVR-INT-1 NOT = SET-VALUE-INT-1) OR
	      (EXT-RECVR-INT-2 NOT = SET-VALUE-INT-2)
	   THEN
               PERFORM REPORT-ERROR
	   END-IF.

      *    Restore the original value
	   CALL "SET" USING THE-KW, ORIG-VALUE-INT.

      *---------------------------------------------------------------
       DO-EXTRACT-TEST-ALPHA-SIMPLE.
	   MOVE SPACES TO EXT-RECVR-ALPHA.
           CALL "EXTRACT" USING THE-KW, EXT-RECVR-ALPHA.
           IF EXT-RECVR-ALPHA NOT = EXPECT-ALPHA 
	   THEN
               PERFORM REPORT-ERROR
	   END-IF.

      *---------------------------------------------------------------
       DO-EXTRACT-TEST-INTEGER-SIMPLE.
	   MOVE LOW-VALUES TO EXT-RECVR-INT.
           CALL "EXTRACT" USING THE-KW, EXT-RECVR-INT.
           IF (EXT-RECVR-INT-1 NOT = EXPECT-INT-1) OR
	      (EXT-RECVR-INT-2 NOT = EXPECT-INT-2)
	   THEN
               PERFORM REPORT-ERROR
	   END-IF.


      *---------------------------------------------------------------
       REPORT-ERROR.
       	   ADD 1 TO COMPLETION-STATUS.
       	   DISPLAY "SET/EXTRACT TEST FAILED KW=" THE-KW.	    
367100


006600**   End of wl0022.wcb

