000100**   Copyright (c) 1994-2003, NeoMedia Technologies, Inc. All Rights Reserved.
000200**   $Id:$
000300**
000400**   File:       wl0019.wcb
000500**
000600**   Project:    WISP/TEST
000700**
000800**   Purpose:    Test SEARCH routine
000900**
001000**   Example:
001100**
006500**
001100 Identification Division.
001200 Program-Id.     wl0019.
001300 Data Division.
001400 Working-Storage Section.

258100 01  SEARCH-ITEM PIC X(14) VALUE SPACES.
258500 01  SEARCH-LIST.
258600     03 FILLER  PIC X(14) VALUE "Australia     ".
258700     03 FILLER  PIC X(14) VALUE "Austria       ".
258800     03 FILLER  PIC X(14) VALUE "Belgium       ".
258900     03 FILLER  PIC X(14) VALUE "Canada        ".
259000     03 FILLER  PIC X(14) VALUE "Finland       ".
259100     03 FILLER  PIC X(14) VALUE "France        ".
259200     03 FILLER  PIC X(14) VALUE "Germany       ".
259300     03 FILLER  PIC X(14) VALUE "Hong Kong     ".
259400     03 FILLER  PIC X(14) VALUE "Ireland       ".
259500     03 FILLER  PIC X(14) VALUE "Italy         ".
259600     03 FILLER  PIC X(14) VALUE "Japan         ".
259700     03 FILLER  PIC X(14) VALUE "Mexico        ".
259800     03 FILLER  PIC X(14) VALUE "Netherlands   ".
259900     03 FILLER  PIC X(14) VALUE "Scotland      ".
260100     03 FILLER  PIC X(14) VALUE "United Kingdom".
260000     03 FILLER  PIC X(14) VALUE "United States ".
260200
260300 01  SEARCH-TABLE REDEFINES SEARCH-LIST.
260400     03 COUNTRY-ITEM PIC X(14) OCCURS 16 TIMES.
260500
260600 01  SEARCH-LIST-REVERSE.
260800     03 FILLER  PIC X(14) VALUE "United States ".
260700     03 FILLER  PIC X(14) VALUE "United Kingdom".
260900     03 FILLER  PIC X(14) VALUE "Scotland      ".
261000     03 FILLER  PIC X(14) VALUE "Netherlands   ".
261100     03 FILLER  PIC X(14) VALUE "Mexico        ".
261200     03 FILLER  PIC X(14) VALUE "Japan         ".
261300     03 FILLER  PIC X(14) VALUE "Italy         ".
261400     03 FILLER  PIC X(14) VALUE "Ireland       ".
261500     03 FILLER  PIC X(14) VALUE "Hong Kong     ".
261600     03 FILLER  PIC X(14) VALUE "Germany       ".
261700     03 FILLER  PIC X(14) VALUE "France        ".
261800     03 FILLER  PIC X(14) VALUE "Finland       ".
261900     03 FILLER  PIC X(14) VALUE "Canada        ".
262000     03 FILLER  PIC X(14) VALUE "Belgium       ".
262100     03 FILLER  PIC X(14) VALUE "Austria       ".
262200     03 FILLER  PIC X(14) VALUE "Australia     ".
262300
262400 01  SEARCH-TABLE-REVERSE REDEFINES SEARCH-LIST-REVERSE.
262500     03 COUNTRY-ITEM-REVERSE PIC X(14) OCCURS 16 TIMES.
262600
262800
262900 01  SEARCH-LEN-P.
263000     03 FILLER BINARY VALUE 0.
263100     03 SEARCH-LEN-X BINARY VALUE 14.
263200
263300 01  SEARCH-ITEM-LEN-P.
263400     03 FILLER BINARY VALUE 0.
263500     03 FILLER BINARY VALUE 14.
263600
263700 01  SEARCH-TABLE-SIZE-P.
263800   03 FILLER BINARY VALUE 0.
263900     03 FILLER BINARY VALUE 16.
264000
264100 01  SEARCH-RETURN-P.
264200     03 FILLER BINARY VALUE 0.
264300     03 SEARCH-RETURN-X BINARY VALUE 16.
264400
       01  COMPLETION-STATUS          PIC 9(02)  VALUE 0.

001600 Procedure Division.

359200
           MOVE  3                 TO SEARCH-LEN-X.
           MOVE  "Can"             TO SEARCH-ITEM. 

359600     PERFORM DO-SEARCH-TEST-0.
           IF  SEARCH-RETURN-X NOT = 4 OR
               COUNTRY-ITEM (SEARCH-RETURN-X) NOT = "Canada"  THEN
               ADD 1        TO COMPLETION-STATUS.

359600     PERFORM DO-SEARCH-TEST-2.
           IF  SEARCH-RETURN-X NOT = 13 OR
           COUNTRY-ITEM-REVERSE (SEARCH-RETURN-X) NOT = "Canada"  THEN
               ADD 1        TO COMPLETION-STATUS.

359600     PERFORM DO-SEARCH-TEST-1.
359800
           IF  SEARCH-RETURN-X NOT = 0 THEN
               ADD 1        TO COMPLETION-STATUS.

359600     PERFORM DO-SEARCH-TEST-3.
           IF  SEARCH-RETURN-X NOT = 0 THEN
               ADD 1        TO COMPLETION-STATUS.

           MOVE "Scotland"         TO SEARCH-ITEM.

           PERFORM DO-SEARCH-TEST-1.
           IF  SEARCH-RETURN-X NOT = 14 OR
               COUNTRY-ITEM (SEARCH-RETURN-X) NOT = "Scotland"  THEN
               ADD 1        TO COMPLETION-STATUS.

359600     PERFORM DO-SEARCH-TEST-3.
           IF  SEARCH-RETURN-X NOT = 3 OR
           COUNTRY-ITEM-REVERSE (SEARCH-RETURN-X) NOT = "Scotland"  THEN
               ADD 1        TO COMPLETION-STATUS.
           
           PERFORM CHECK-STATUS.

359100 DO-SEARCH-TEST-0.
359300     CALL "SEARCH" USING SEARCH-TABLE, SEARCH-TABLE-SIZE-P,
359400                         SEARCH-ITEM-LEN-P, SEARCH-ITEM,
359500                         SEARCH-LEN-P, SEARCH-RETURN-P.
360200
359100 DO-SEARCH-TEST-1.
359900     CALL "SEARCH" USING SEARCH-TABLE, SEARCH-TABLE-SIZE-P,
360000                         SEARCH-ITEM-LEN-P, SEARCH-ITEM,
360100                         SEARCH-RETURN-P.
360300 DO-SEARCH-TEST-2.
360400
360500     CALL "SEARCH" USING SEARCH-TABLE-REVERSE,
360600                         SEARCH-TABLE-SIZE-P,
360700                         SEARCH-ITEM-LEN-P, SEARCH-ITEM,
360800                         SEARCH-LEN-P, SEARCH-RETURN-P.
360900
361000 DO-SEARCH-TEST-3.
361100
361200     CALL "SEARCH" USING SEARCH-TABLE-REVERSE,
361300                         SEARCH-TABLE-SIZE-P,
361400                         SEARCH-ITEM-LEN-P, SEARCH-ITEM,
361500                         SEARCH-RETURN-P.
361600
361700
       CHECK-STATUS.

           IF  COMPLETION-STATUS = 0 THEN
                DISPLAY "SEARCH completion successful."
           ELSE
                DISPLAY "SEARCH failed.".

            EXIT PROGRAM.
            STOP RUN.

006600**   End of wl0019.wcb



