000100**   Copyright (c) 1994-2003, NeoMedia Technologies, Inc. All Rights Reserved.
000200**
000300**
000400**   File:       wl0010.wcb
000500**
000600**   Project:    WISP/TEST
000700**
000800**   Purpose:    Test WISPPLAT routine
000900**
001000**
001100 Identification Division.
001200 Program-Id.     wl0010.
001300 Data Division.
001400 Working-Storage Section.
001500 COPY WISPPLAT.
001600 Procedure Division.
001700 0000-START.
001800     Call "WISPPLAT" USING WISPPLAT-NAME, WISPPLAT-CODE.
001900
002000     IF WISPPLAT-AIX THEN
002100         DISPLAY "Running on AIX".
002110     IF WISPPLAT-AIX-64 THEN
002120         DISPLAY "Running on AIX (64-bit)".
002200     IF WISPPLAT-HPUX THEN
002300         DISPLAY "Running on HP-UX".
002301     IF WISPPLAT-HPUX-64 THEN
002302         DISPLAY "Running on HP-UX (64-bit)".
002310     IF WISPPLAT-LINUX THEN
002320         DISPLAY "Running on LINUX".
002400     IF WISPPLAT-SOLARIS THEN
002500         DISPLAY "Running on Solaris 2".
002510     IF WISPPLAT-SOLARIS-64 THEN
002520         DISPLAY "Running on Solaris 2 (64-bit)".
002600     IF WISPPLAT-SCO THEN
002700         DISPLAY "Running on SCO".
002800     IF WISPPLAT-MSDOS THEN
002900         DISPLAY "Running on MSDOS".
003000     IF WISPPLAT-WINDOWS-NT THEN
003100         DISPLAY "Running on WINDOWS/NT".
003200
003300     DISPLAY "CODE=[" WISPPLAT-CODE "] "
003400             "NAME=[" WISPPLAT-NAME "] ".
003500
003600 9999-EXIT.
003700     Exit program.
003800     Stop Run.
003900
004000**
004100**   End of wl0010.wcb
004200**
