000100**   Copyright (c) Shell Stream Software LLC, All Rights Reserved.
000200**
000300**
000400**   File:       wl0027.wcb
000500**
000600**   Project:    WISP/TEST
000700**
000800**   Purpose:    Test PUTPARM routines.
000900**
001000**   Example:
001100**
006500**
001100 Identification Division.
001200 Program-Id.     wl0027.
       Environment Division.
       Configuration Section.
001300 Data Division.
001400 Working-Storage Section.


042900
043000 01  PUTP-FUNCTION      PIC X          VALUE "E".
043100 01  PUTP-USAGECNT.
043200     03  PUTP-UC1       BINARY         VALUE 0.
043300     03  PUTP-UC2       BINARY         VALUE 1.
043400 01  PUTP-USAGE-CNT     PIC 9999       VALUE 1.
043500 01  PUTP-PRNAME        PIC X(8)       VALUE "INPUT   ".
043600 01  PUTP-KWCOUNT.
043700     03  PUTP-KW1       BINARY         VALUE 0.
043800     03  PUTP-KW2       BINARY         VALUE 3.
043900*  KEYWORD INFORMATION:
044000 01  PUTP-FILE-KW       PIC X(8)       VALUE "FILE    ".
044100 01  PUTP-FILE          PIC X(8)       VALUE SPACES.
044200 01  PUTP-LIB-KW        PIC X(8)       VALUE "LIBRARY ".
044300 01  PUTP-LIB           PIC X(8)       VALUE SPACES.
044400 01  PUTP-VOL-KW        PIC X(8)       VALUE "VOLUME  ".
044500 01  PUTP-VOL           PIC X(6)       VALUE SPACES.
044600 01  PUTP-LEN-6.
044700     03 PUTP-L6-KW1     BINARY         VALUE 0.
044800     03 PUTP-L6-KW2     BINARY         VALUE 6.
044900 01  PUTP-LEN-8.
045000     03 PUTP-L8-KW1     BINARY         VALUE 0.
045100     03 PUTP-L8-KW2     BINARY         VALUE 8.
045200
045300 01  PUTP-PFKEY-VALUE   PIC X          VALUE "@".
045400 01  PUTP-LABEL         PIC X(8)       VALUE SPACES.
045500 01  PUTP-REFLABEL      PIC X(8)       VALUE SPACES.
045600 01  PUTP-CLEANUP       PIC X          VALUE SPACES.
045700 01  PUTP-RCODE.
045800     03  PUTP-RCODE-1   BINARY         VALUE 0.
045900     03  PUTP-RCODE-2   BINARY         VALUE 0.
046000
046100 01  PUTP-RECEIVER.
046200     03 PP-R1-KW        PIC X(8)      VALUE SPACES.
046300     03 PP-R1-KWFL.
046400        05 PPR1-L1      BINARY        VALUE 0.
046500        05 PPR1-L2      BINARY        VALUE 8.
046600     03 PP-R1-KWVAL     PIC X(8)      VALUE SPACES.
046700     03 PP-R2-KW        PIC X(8)      VALUE SPACES.
046800     03 PP-R2-KWFL.
046900        05 PPR2-L1      BINARY        VALUE 0.
047000        05 PPR2-L2      BINARY        VALUE 8.
047100     03 PP-R2-KWVAL     PIC X(8)      VALUE SPACES.
047200     03 PP-R3-KW        PIC X(8)      VALUE SPACES.
047300     03 PP-R3-KWFL.
047400        05 PPR3-L1      BINARY        VALUE 0.
047500        05 PPR3-L2      BINARY        VALUE 6.
047600     03 PP-R3-KWVAL     PIC X(6)      VALUE SPACES.
047700 01  PUTP-RECVR-LEN.
047800     03 PUTP-RL1        BINARY         VALUE 0.
047900     03 PUTP-RL2        BINARY         VALUE 58.
048000 01  PUTP-TOTAL-LEN.
048100     03 PUTP-TL1        BINARY         VALUE 0.
048200     03 PUTP-TL2        BINARY         VALUE 58.
048300 01  PUTP-RECVR-FILE          PIC X(8) VALUE SPACES.
048400 01  PUTP-RECVR-LENF.
048500     03 PUTP-RECVR-LEN-FILE1  BINARY   VALUE 0.
048600     03 PUTP-RECVR-LEN-FILE2  BINARY   VALUE 8.
048700 01  PUTP-RECVR-LIB           PIC X(8) VALUE SPACES.
048800 01  PUTP-RECVR-LENL.
048900     03 PUTP-RECVR-LEN-LIB1   BINARY   VALUE 0.
049000     03 PUTP-RECVR-LEN-LIB2   BINARY   VALUE 8.
049100 01  PUTP-RECVR-VOL           PIC X(6) VALUE SPACES.
049200 01  PUTP-RECVR-LENV.
049300     03 PUTP-RECVR-LEN-VOL1   BINARY   VALUE 0.
049400     03 PUTP-RECVR-LEN-VOL2   BINARY   VALUE 6.
049500
037500 01  PP-DISPLAY   PIC X(8) VALUE "DISPLAY ".
       01  TEST-NUM PIC 9999.
       01  PASSED-TESTS PIC 9999.
       
001600 Procedure Division.
       0000-MAIN.

       	   MOVE 0 TO TEST-NUM.
       	   MOVE 0 TO PASSED-TESTS.

      *
      *    TEST 1 - CLEAR ALL
      *	   
	   MOVE 1 TO TEST-NUM.
	   MOVE "C" TO PUTP-FUNCTION.
	   MOVE SPACES TO PUTP-LABEL.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 2 - LABEL AAA
      *	   
	   MOVE 2 TO TEST-NUM.
	   MOVE "D" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "INPUT" TO PUTP-PRNAME.
       	   MOVE 3 TO PUTP-KW2.
	   MOVE "AAA" TO PUTP-FILE.
	   MOVE "AAA" TO PUTP-LIB.
	   MOVE "AAA" TO PUTP-VOL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE "AAA" TO PUTP-LABEL.
	   MOVE SPACES TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 3 - NOLABEL BBB
      *	   
	   MOVE 3 TO TEST-NUM.
	   MOVE "D" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "INPUT" TO PUTP-PRNAME.
       	   MOVE 3 TO PUTP-KW2.
	   MOVE "BBB" TO PUTP-FILE.
	   MOVE "BBB" TO PUTP-LIB.
	   MOVE "BBB" TO PUTP-VOL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-LABEL.
	   MOVE SPACES TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 4 - NOLABEL CCC
      *	   
	   MOVE 4 TO TEST-NUM.
	   MOVE "D" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "INPUT" TO PUTP-PRNAME.
       	   MOVE 3 TO PUTP-KW2.
	   MOVE "CCC" TO PUTP-FILE.
	   MOVE "CCC" TO PUTP-LIB.
	   MOVE "CCC" TO PUTP-VOL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-LABEL.
	   MOVE SPACES TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 5 - CLEAR AAA
      *	   
	   MOVE 5 TO TEST-NUM.
	   MOVE "C" TO PUTP-FUNCTION.
	   MOVE "AAA" TO PUTP-LABEL.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 6 - DISPLAY GETPARM GET BBB
      *	   
	   MOVE 6 TO TEST-NUM.
       	   DISPLAY "TEST 6 DISPLAY - SHOULD GET BBB".
           CALL "COBLINK" USING PP-DISPLAY.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 7 - DISPLAY GETPARM GET SPACE
      *	   
	   MOVE 7 TO TEST-NUM.
       	   DISPLAY "TEST 7 DISPLAY - SHOULD GET FILE=(spaces)".
           CALL "COBLINK" USING PP-DISPLAY.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 8 - LABEL AAA
      *	   
	   MOVE 8 TO TEST-NUM.
	   MOVE "D" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "INPUT" TO PUTP-PRNAME.
       	   MOVE 3 TO PUTP-KW2.
	   MOVE "AAA" TO PUTP-FILE.
	   MOVE "AAA" TO PUTP-LIB.
	   MOVE "AAA" TO PUTP-VOL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE "AAA" TO PUTP-LABEL.
	   MOVE SPACES TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 9 - NOLABEL BBB
      *	   
	   MOVE 9 TO TEST-NUM.
	   MOVE "D" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "INPUT" TO PUTP-PRNAME.
       	   MOVE 3 TO PUTP-KW2.
	   MOVE "BBB" TO PUTP-FILE.
	   MOVE "BBB" TO PUTP-LIB.
	   MOVE "BBB" TO PUTP-VOL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-LABEL.
	   MOVE SPACES TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.
	   
      *
      *    TEST 10 - CLEAR ALL
      *	   
	   MOVE 10 TO TEST-NUM.
	   MOVE "C" TO PUTP-FUNCTION.
	   MOVE SPACES TO PUTP-LABEL.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 11 - DISPLAY GETPARM GET SPACE
      *	   
	   MOVE 11 TO TEST-NUM.
       	   DISPLAY "TEST 11 DISPLAY - SHOULD GET FILE=(spaces)".
           CALL "COBLINK" USING PP-DISPLAY.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 12 - XXX LABEL CCC
      *	   
	   MOVE 12 TO TEST-NUM.
	   MOVE "D" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "XXX" TO PUTP-PRNAME.
       	   MOVE 3 TO PUTP-KW2.
	   MOVE "CCC" TO PUTP-FILE.
	   MOVE "CCC" TO PUTP-LIB.
	   MOVE "CCC" TO PUTP-VOL.
       	   MOVE "A" TO PUTP-PFKEY-VALUE.
	   MOVE "CCC" TO PUTP-LABEL.
	   MOVE SPACES TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 13 - XXX LABEL DDD
      *	   
	   MOVE 13 TO TEST-NUM.
	   MOVE "D" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "XXX" TO PUTP-PRNAME.
       	   MOVE 3 TO PUTP-KW2.
	   MOVE "DDD" TO PUTP-FILE.
	   MOVE "DDD" TO PUTP-LIB.
	   MOVE "DDD" TO PUTP-VOL.
       	   MOVE "B" TO PUTP-PFKEY-VALUE.
	   MOVE "DDD" TO PUTP-LABEL.
	   MOVE SPACES TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.
	   
      *
      *    TEST 14 - R LABEL DDD
      *	   
	   MOVE 14 TO TEST-NUM.
	   MOVE "R" TO PUTP-FUNCTION.
	   MOVE "DDD" TO PUTP-LABEL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST A" TEST-NUM
	       perform 9999-exit.
	   IF PUTP-PFKEY-VALUE NOT = "B" THEN
	       DISPLAY "PUTPARM FAILED TEST B" TEST-NUM
	       perform 9999-exit.
	   IF PP-R1-KWVAL NOT = "DDD" THEN
	       DISPLAY "PUTPARM FAILED TEST C" TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.
	   
      *
      *    TEST 15 - R LABEL CCC
      *	   
	   MOVE 15 TO TEST-NUM.
	   MOVE "R" TO PUTP-FUNCTION.
	   MOVE "CCC" TO PUTP-LABEL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST A" TEST-NUM
	       perform 9999-exit.
	   IF PUTP-PFKEY-VALUE NOT = "A" THEN
	       DISPLAY "PUTPARM FAILED TEST B" TEST-NUM
	       perform 9999-exit.
	   IF PP-R1-KWVAL NOT = "CCC" THEN
	       DISPLAY "PUTPARM FAILED TEST C" TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.
	   
      *
      *    TEST 16 - M LABEL DDD
      *	   
	   MOVE 16 TO TEST-NUM.
	   MOVE "M" TO PUTP-FUNCTION.
	   MOVE "DDD" TO PUTP-LABEL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST A" TEST-NUM
	       perform 9999-exit.
	   IF PUTP-RECVR-FILE NOT = "DDD" THEN
	       DISPLAY "PUTPARM FAILED TEST B" TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.
	   
      *
      *    TEST 17 - M LABEL CCC
      *	   
	   MOVE 17 TO TEST-NUM.
	   MOVE "M" TO PUTP-FUNCTION.
	   MOVE "CCC" TO PUTP-LABEL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST A" TEST-NUM
	       perform 9999-exit.
	   IF PUTP-RECVR-FILE NOT = "CCC" THEN
	       DISPLAY "PUTPARM FAILED TEST B" TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 18 - REFLABEL DDD
      *	   
	   MOVE 18 TO TEST-NUM.
	   MOVE "E" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "INPUT" TO PUTP-PRNAME.
       	   MOVE 0 TO PUTP-KW2.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE "FFF" TO PUTP-LABEL.
	   MOVE "DDD" TO PUTP-REFLABEL.
	   MOVE "C" TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 19 - DISPLAY GETPARM GET DDD
      *	   
	   MOVE 19 TO TEST-NUM.
       	   DISPLAY "TEST 19 DISPLAY - SHOULD GET DDD".
           CALL "COBLINK" USING PP-DISPLAY.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 20 - R LABEL FFF
      *	   
	   MOVE 20 TO TEST-NUM.
	   MOVE "R" TO PUTP-FUNCTION.
	   MOVE "FFF" TO PUTP-LABEL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST A" TEST-NUM
	       perform 9999-exit.
	   IF PP-R1-KWVAL NOT = "DDD" THEN
	       DISPLAY "PUTPARM FAILED TEST B" TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 21 - R LABEL DDD (fail test)
      *	   
	   MOVE 21 TO TEST-NUM.
	   MOVE "R" TO PUTP-FUNCTION.
	   MOVE "DDD" TO PUTP-LABEL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 4 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 22 -  LABEL GGG FILE=ZZZ (one keyword)
      *	   
	   MOVE 22 TO TEST-NUM.
	   MOVE "E" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "INPUT" TO PUTP-PRNAME.
       	   MOVE 1 TO PUTP-KW2.
	   MOVE "ZZZ" TO PUTP-FILE.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE "GGG" TO PUTP-LABEL.
	   MOVE SPACES TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 23 - Backref with override
      *	   
	   MOVE 23 TO TEST-NUM.
	   MOVE "E" TO PUTP-FUNCTION.
       	   MOVE 1 TO PUTP-UC2.	   
	   MOVE "INPUT" TO PUTP-PRNAME.
       	   MOVE 3 TO PUTP-KW2.
	   MOVE "AAA" TO PUTP-FILE.
	   MOVE "AAA" TO PUTP-LIB.
	   MOVE "AAA" TO PUTP-VOL.
       	   MOVE "A" TO PUTP-PFKEY-VALUE.
	   MOVE "HHH" TO PUTP-LABEL.
	   MOVE "GGG" TO PUTP-REFLABEL.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST " TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

      *
      *    TEST 24 - R override ZZZ, AAA, AAA
      *	   
	   MOVE 24 TO TEST-NUM.
	   MOVE "R" TO PUTP-FUNCTION.
	   MOVE "HHH" TO PUTP-LABEL.
       	   MOVE "@" TO PUTP-PFKEY-VALUE.
	   MOVE SPACES TO PUTP-CLEANUP.
	   PERFORM CALL-PUTPARM.
	   IF PUTP-RCODE-2 NOT = 0 THEN
	       DISPLAY "PUTPARM FAILED TEST A" TEST-NUM
	       perform 9999-exit.
	   IF PP-R1-KWVAL NOT = "ZZZ" THEN
	       DISPLAY "PUTPARM FAILED TEST B" TEST-NUM
	       perform 9999-exit.
	   IF PP-R2-KWVAL NOT = "AAA" THEN
	       DISPLAY "PUTPARM FAILED TEST C" TEST-NUM
	       perform 9999-exit.
	   IF PP-R3-KWVAL NOT = "AAA" THEN
	       DISPLAY "PUTPARM FAILED TEST D" TEST-NUM
	       perform 9999-exit.
	   ADD 1 TO PASSED-TESTS.

	   
	   
       9999-END.
       	   DISPLAY "PUTPARM PASSED " PASSED-TESTS " TESTS".
	   
       9999-EXIT.
      *
      *    CLEAR ALL
      *	   
	   MOVE "C" TO PUTP-FUNCTION.
	   MOVE SPACES TO PUTP-LABEL.
	   PERFORM CALL-PUTPARM.

           EXIT PROGRAM.
           STOP RUN.

301900
302000 CALL-PUTPARM.
302100
302500     MOVE 0 TO PUTP-UC1.
302500     MOVE 0 TO PUTP-KW1.
045800     MOVE 99 TO PUTP-RCODE-1.
045800     MOVE 99 TO PUTP-RCODE-2.
       	       
303200     IF PUTP-FUNCTION = "D" OR PUTP-FUNCTION = "E" THEN
303300         IF PUTP-KW2 = 0 THEN
303400             CALL "PUTPARM" USING 
       	       	       	        PUTP-FUNCTION, PUTP-USAGECNT,
303500                          PUTP-PRNAME, PUTP-KWCOUNT,
303600                          PUTP-PFKEY-VALUE, PUTP-LABEL,
303700                          PUTP-REFLABEL, PUTP-CLEANUP,
303800                          PUTP-RCODE
304000         ELSE IF PUTP-KW2 = 1 THEN
304100             CALL "PUTPARM" USING 
       	       	       	        PUTP-FUNCTION, PUTP-USAGECNT,
304200                          PUTP-PRNAME, PUTP-KWCOUNT,
304300                          PUTP-FILE-KW, PUTP-FILE, PUTP-LEN-8,
304600                          PUTP-PFKEY-VALUE, PUTP-LABEL,
304700                          PUTP-REFLABEL, PUTP-CLEANUP,
304800                          PUTP-RCODE
304000         ELSE
304100             CALL "PUTPARM" USING 
       	       	       	        PUTP-FUNCTION, PUTP-USAGECNT,
304200                          PUTP-PRNAME, PUTP-KWCOUNT,
304300                          PUTP-FILE-KW, PUTP-FILE, PUTP-LEN-8,
304400                          PUTP-LIB-KW, PUTP-LIB, PUTP-LEN-8,
304500                          PUTP-VOL-KW, PUTP-VOL, PUTP-LEN-6,
304600                          PUTP-PFKEY-VALUE, PUTP-LABEL,
304700                          PUTP-REFLABEL, PUTP-CLEANUP,
304800                          PUTP-RCODE
       	       END-IF
	       END-IF
305000     ELSE IF PUTP-FUNCTION = "R" THEN
047800           MOVE 0  TO PUTP-RL1
047900           MOVE 58 TO PUTP-RL2
305100           CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-LABEL,
305200                          PUTP-RECEIVER, PUTP-RECVR-LEN,
305300                          PUTP-TOTAL-LEN,
305400                          PUTP-PFKEY-VALUE, PUTP-CLEANUP,
305500                          PUTP-RCODE
305700     ELSE IF PUTP-FUNCTION = "M" THEN
       	       	 MOVE 3 TO PUTP-KW2
305800           CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-LABEL,
305900                          PUTP-KWCOUNT,
306000                          PUTP-FILE-KW, PUTP-RECVR-FILE,
306100                          PUTP-RECVR-LENF,
306200                          PUTP-LIB-KW, PUTP-RECVR-LIB,
306300                          PUTP-RECVR-LENL,
306400                          PUTP-VOL-KW, PUTP-RECVR-VOL,
306500                          PUTP-RECVR-LENV,
306600                          PUTP-PFKEY-VALUE, PUTP-CLEANUP,
306700                          PUTP-RCODE
306900     ELSE IF PUTP-FUNCTION = "C" THEN
307000           CALL "PUTPARM" USING PUTP-FUNCTION, PUTP-LABEL,
307100                          PUTP-RCODE.
307300



006600**   End of wl0027.wcb


