000100**   Copyright (c) 1997-2003 NeoMedia Technologies, All rights reserved.
000200**
000300**
000400**   File:       WT0012.wcb
000500**
000600**   Project:    WISP/SAMPLE
000700**
000800**   Purpose:    Test maximum number of fields on a screen 24x40
000900**
001000**   Example:
001100**
001200 IDENTIFICATION DIVISION.
001300 PROGRAM-ID. WT0012.
001400
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 INPUT-OUTPUT SECTION.
001800 FILE-CONTROL.
001900     SELECT CRT
002000         ASSIGN TO "CRT",      "DISPLAY",
002100         ORGANIZATION    IS SEQUENTIAL
002200         ACCESS MODE     IS RANDOM
002300         RELATIVE KEY    IS CRT-RELKEY
002400         PFKEY           IS CRT-PFKEY
002500         CURSOR POSITION IS CRT-CURSOR-POS
002600         FILE STATUS     IS CRT-FILE-STATUS.
002700
002800
002900 DATA DIVISION.
003000 FILE SECTION.
003100
003200 FD  CRT
003300     LABEL RECORDS ARE OMITTED.
003400 01  CRT-RECORD                         PIC X(1924).
003500
003600 WORKING-STORAGE SECTION.
003700*
003800*   CRT FILE VARIABLES
003900*
004000 77  CRT-RELKEY  PIC 9(02) VALUE 1.
004100 77  CRT-PFKEY   PIC X(02) VALUE ZERO.
004200 01  CRT-CURSOR-POS.
004300     03  CRT-CURSOR-POS-COL  BINARY.
004400     03  CRT-CURSOR-POS-ROW  BINARY.
004500 01  CRT-FILE-STATUS.
004600     03  CRT-FILE-STATUS-ERR        PIC X(01).
004700     03  CRT-FILE-STATUS-AID        PIC X(01).
004800
004900
005000 01  maxfields display-ws.
005100     05  filler occurs 24 row 1.
005200         10  filler occurs 40 row 1 column 2 pic x
005300             source is o24x40 object is o24x40.
005400
005500 01  two-level-tale.
005600     05  level-1 occurs 24.
005700         10  o24x40 occurs 40 pic x.
005800
005900
006000 PROCEDURE DIVISION.
006100 0000-MAIN SECTION.
006200     display and read maxfields on crt.
006300
006400 9999-END SECTION.
006500 9999-EXIT.
006600     EXIT PROGRAM.
006700 9999-STOP.
006800     STOP RUN.
006900**
007000**   End of wt0012.wcb
007100**
