000100**   Copyright (c) 2003 NeoMedia Technologies, All rights reserved.
000200**
000300**
000400**   File:       WT0010.wcb
000500**
000600**   Project:    WISP/SAMPLE
000700**
000800**   Purpose:    WISP Translator Tests: 
000900**
001000**   Example:
001100**
001200 IDENTIFICATION DIVISION.
001300 PROGRAM-ID. WT0010.
001400
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 INPUT-OUTPUT SECTION.
002000
002100 DATA DIVISION.
002200 FILE SECTION.
002500
002600 WORKING-STORAGE SECTION.
002610 01  QAPROG	   PIC X(8) VALUE "WT0010".
003500
003600 PROCEDURE DIVISION.
003700 0000-MAIN SECTION.
003800     DISPLAY "THIS DOES NOTHING AT NOW".
006400
006500 9999-END SECTION.
006600 9999-EXIT.
006700     EXIT PROGRAM.
006800 9999-STOP.
006900     STOP RUN.
007000**
007100**   End of WT0010.wcb
007200**
