000100******************************************************************
000200*  THIS FILE IS USED IN THE CAD SYSTEM TO SET
000300*  JURISDICTION CONFIGURATION VARIABLES
000400*
000500*  KEYS:  PRIMARY:    JUCN-PRIME-KEY  (POS. 1 FOR 2)
000600******************************************************************
000700*
000800 FD  JUCN-FILE
000900     LABEL RECORDS ARE STANDARD
001000     RECORD CONTAINS 100 COMPRESSED CHARACTERS
001100     VALUE OF FILENAME IS    JUCN-FILE-NAME
001200              LIBRARY IS     JUCN-LIB-NAME
001300              VOLUME IS      JUCN-VOL-NAME
001400              SPACE IS       JUCN-REC-COUNT
001500              INDEX AREA IS  JUCN-INDEX-AREA
001600              DATA AREA IS   JUCN-DATA-AREA
001700              DATA RECORD IS JUCN-JURIS-RECORD.
001800 01  JUCN-JURIS-RECORD.
001900     05  JUCN-PRIME-KEY.
002000         10  JUCN-JURIS-CODE     PIC X(2).
002100     05  JUCN-JURISDICTION-VALUES.
002200         10  JUCN-DISPOSITION-CODE     PIC X.
002300         10  JUCN-PRINT-CLASS          PIC X.
002400         10  JUCN-DUP-TIME-TOLERANCE   PIC 9(4).
002500         10  JUCN-VALIDATE-CALL        PIC X.
002600/
