000001/*****************************************************************
000001*                                                                *
000001*                       IDENTIFICATION DIVISION                  *
000001*                                                                *
000001******************************************************************
000001*                                                  
000001/*****************************************************************
000001*     Application Management Utility (AMU)                       *
000001*                                                                *
000001*     This is the Menu Definition Maintenance subroutine (AMUMDM)*
000001******************************************************************
000001
000001 IDENTIFICATION DIVISION.
000001 PROGRAM-ID.
000001     AMUMDM.
000001 AUTHOR.
000001     Suzette Cass.
000001 DATE-WRITTEN.
000001     05/27/93.
000001/*****************************************************************
000001*                                                                *
000001*                         ENVIRONMENT DIVISION                   *
000001*                                                                *
000001******************************************************************
000001*
000001 ENVIRONMENT DIVISION.
000001 CONFIGURATION SECTION.
000001 SOURCE-COMPUTER.
000001     WANG-VS.
000001 OBJECT-COMPUTER.
000001     WANG-VS.
000001 FIGURATIVE-CONSTANTS.
           A-0-BYTE  IS "00", A-1-BYTE  IS "01", A-2-BYTE  IS "02",
           A-3-BYTE  IS "03", A-4-BYTE  IS "04", A-5-BYTE  IS "05",
           A-6-BYTE  IS "06", A-7-BYTE  IS "07", A-8-BYTE  IS "08",
           A-9-BYTE  IS "09", A-10-BYTE IS "0A", A-11-BYTE IS "0B",
           A-12-BYTE IS "0C", A-13-BYTE IS "0D", A-14-BYTE IS "0E",
           A-15-BYTE IS "0F", A-16-BYTE IS "10", A-17-BYTE IS "11",
           A-18-BYTE IS "12", A-19-BYTE IS "13", A-20-BYTE IS "14",
           A-21-BYTE IS "15", A-22-BYTE IS "16", A-23-BYTE IS "17",
           A-24-BYTE IS "18", A-26-BYTE IS "1A", A-28-BYTE IS "1C",
           A-32-BYTE IS "20", A-36-BYTE IS "24", A-42-BYTE IS "2A",
           A-54-BYTE IS "36", A-160-BYTE IS "A0"
000001     PROTECT-BIT IS "04"
           SUB-5       IS "05"                     
000001     DIM-BIT     IS "08"
000001     LF          IS "0A"
000001     BLINK-BIT   IS "10"
           POSITION-CURSOR IS "20"
           UNLOCK-KEYBOARD IS "80"
           WSXIO-READ  IS "40"
           WSXIO-WRITE IS "80"
000001     BRITE       IS "84"
000001     TAB-STOP    IS "86"
           PLAIN-TEXT  IS "8C"
           MENU-PICK   IS "8E"
           BLANK-PRO   IS "9C"
000001     BLINKING-DISPLAY IS "94"
000001     NO-ECHO     IS "98"
           BR-MOD-ALL  IS "A0"
           BR-MOD-UCL  IS "A1"
           UNDER-TEXT  IS "AC"
           BLINK-MOD-UCL IS "B1"
           BLANK-MOD   IS "B8".
000001                                                      
000001/*****************************************************************
000001*                                                                *
000001*                         INPUT-OUTPUT SECTION                   *
000001*                                                                *
000001******************************************************************
000001*
000001 INPUT-OUTPUT SECTION.
000001 FILE-CONTROL.
000001*
000001     SELECT CRT
000001         ASSIGN TO "CRT",      "DISPLAY",
000001         ORGANIZATION    IS SEQUENTIAL
000001         ACCESS MODE     IS RANDOM
000001         RELATIVE KEY    IS LINENUM
000001         PFKEY           IS PF-KEY
000001         CURSOR POSITION IS CURSOR-POS
000001         FILE STATUS     IS FILSTAT.
000001
           COPY AMUSEL.
000001
000001/*****************************************************************
000001*                                                                *
000001*                      DATA DIVISION - FILE SECTION              *
000001*                                                                *
000001******************************************************************
000001*
000001 DATA DIVISION.
000001 FILE SECTION.
000001*
123456*89012345678901234567890123456789012345678901234567890123456789012
000001 FD  CRT
000001     LABEL RECORDS ARE OMITTED.
000001 01  CRTREC.
           03  CRTREC-OA                  PIC X(4).
            03  CRTREC-MAPPING-AREA       PIC X(1920).
000001
           COPY AMUFD.
000001*
000001/*****************************************************************
000001*                                                                *
000001*                         WORKING STORAGE                        *
000001*                                                                *
000001******************************************************************
000001*
000001 WORKING-STORAGE SECTION.
000001
000001 01  FILSTAT.
000001     03  ERR-FLAG                   PIC X(01).
000001     03  PFK-BYTE                   PIC X(01).

       77  LINENUM                        PIC 9(02) VALUE 1.
       77  PF-KEY                         PIC X(02) VALUE ZERO.

       01  CURSOR-POS.
           03  MOD-COL                    BINARY.
           03  MOD-ROW                    BINARY.

       01  REDEF-CURS-POS                 REDEFINES CURSOR-POS.
           03  FILLER                     PIC X(01).
           03  CURS-COL                   PIC X(01).
           03  FILLER                     PIC X(01).
           03  CURS-ROW                   PIC X(01).

       01  BELL-TIME.
           03  FILLER                     BINARY VALUE 0.
           03  BELL-TIME-2                BINARY VALUE 1.

       01  TEMP-OA.
           03  TEMP-OA-START              PIC X(01) VALUE A-1-BYTE.
           03  TEMP-OA-WCC                PIC X(01) VALUE A-160-BYTE.
           03  TEMP-OA-COL                PIC X(01) VALUE A-0-BYTE.
           03  TEMP-OA-ROW                PIC X(01) VALUE A-0-BYTE.

028400*01  WSA-DATE-AREA.
028500*    03  WSA-NDATE                  PIC 9(06).
028600*    03  WSA-ADATE REDEFINES WSA-NDATE.
       01  DATE-CCYYMMDD.
               05  DATE-CC                PIC X(02).
               05  DATE-YY                PIC X(02).
               05  DATE-MM                PIC X(02).
               05  DATE-DD                PIC X(02).
       01  HG PIC XX VALUE "HG".
       01  FORMAT-DATE.
           03  FORMAT-DATE-1              PIC X(02).
           03  DATE-SEPARATOR-1           PIC X(01) VALUE "/".
           03  FORMAT-DATE-2              PIC X(02).
           03  DATE-SEPARATOR-2           PIC X(01) VALUE "/".
           03  FORMAT-DATE-3              PIC X(02).
       01  WSA-TIME-AREA.
           03  WSA-NTIME                 PIC 9(8).
           03  WSA-ATIME REDEFINES WSA-NTIME.
               05  TIME-HOUR             PIC X(02).
               05  TIME-MIN              PIC X(02).
               05  TIME-SEC              PIC X(02).
               05  TIME-HUND-SEC         PIC X(02).
       01  FORMAT-TIME.
           05  FORMAT-TIME-1             PIC X(02).
           05  TIME-SEPARATOR-1          PIC X(01) VALUE ":".
           05  FORMAT-TIME-2             PIC X(02).
           05  TIME-SEPARATOR-2          PIC X(01) VALUE " ".
           05  FORMAT-TIME-3             PIC X(02).

           COPY AMUWS.

       01  LOCKED-STATUS                  PIC X(01) VALUE "N".
           88  MENU-LOCKED                VALUE "Y".
           88  MENU-NOTLOCKED             VALUE "N".

       01  TEST-RECORD                    PIC X(01) VALUE "N".
           88  RECORD-EXISTS              VALUE "Y".
           88  RECORD-NOTEXISTS           VALUE "N".

       01  WS-TEST-RECORD                 PIC X(01) VALUE "Y".
           88  WS-MATCH                   VALUE "Y".
           88  WS-NO-MATCH                VALUE "N".

       01  MATCH-RECORD                   PIC X(01) VALUE " ".
           88  NO-MATCH                   VALUE " ".
           88  1ST-CHAR-MATCH             VALUE "1".
           88  2ND-CHAR-MATCH             VALUE "2".

       01  WRITE-RECORD                   PIC X(01) VALUE "N".
           88  DO-WRITE                   VALUE "Y".
           88  NO-WRITE                   VALUE "N".

       01  CHANGED-FLAG                   PIC X(01) VALUE "N".
           88  MADE-CHANGES               VALUE "Y".                    
           88  NO-CHANGES                 VALUE "N".

       01  SELECTION-FLAG                 PIC X(01) VALUE "N".
           88  TYPE-CHANGE                VALUE "Y".                    
           88  NOTYPE-CHANGE              VALUE "N".

       01  CREATE-FLAG                   PIC X(01) VALUE "Y".
           88  IS-NEW                    VALUE "Y".                    
           88  NOT-NEW                   VALUE "N".

       01  DELETE-FLAG                   PIC X(01) VALUE "N".
           88  IS-DELETED                 VALUE "Y".                    
           88  NOT-DELETED                VALUE "N".

       01  DEFAULT-STAT                   PIC X(01) VALUE "N".
           88  DIFF-DEFAULTS              VALUE "Y".
           88  SAME-DEFAULTS              VALUE "N".

       01  RECORD-STAT                   PIC X(01) VALUE "N".
           88  REC-CHANGED               VALUE "Y".
           88  REC-NOTCHANGED            VALUE "N".

       01  CNT1                           BINARY  VALUE 0.
       01  CNT2                           BINARY  VALUE 0.
       01  DELIM-CHAR                     PIC X(01) VALUE "*".

       01  REC-STAT-TEXT    PIC X(11)  VALUE SPACES.
       01  SCREEN-TITLE     PIC X(32)  VALUE
           "AMU Menu Environment Maintenance".
       01  MENU-DEF-TITLE     PIC X(31)  VALUE
           "AMU Menu Definition Maintenance".
       01  MENU-OPTIONS-SCREEN  PIC X(20) VALUE SPACES.

       01  SCN-MODE         PIC X(12) VALUE SPACES.
           88  MODE-DISPLAY            VALUE "Display Mode".
           88  MODE-MODIFY             VALUE " Modify Mode".
           88  MODE-DEFAULT            VALUE "Default Mode".
           88  MODE-RESTORE            VALUE "Restore Mode".
           88  MODE-SAVE               VALUE "   Save Mode".

       01  CUR-ACCESS    PIC X(07)  VALUE SPACES.
           88  ACCESS-UPDATE        VALUE "UPDATE".
           88  ACCESS-BROWSE        VALUE "BROWSE".
           88  ACCESS-DEFAULT       VALUE "DEFAULT".
           88  ACCESS-RESTORE       VALUE "RESTORE".
           88  ACCESS-SAVE          VALUE "SAVE".
           88  ACCESS-WARNING       VALUE "WARNING".
           88  ACCESS-INSERT        VALUE "INSERT".

       01  SUB1                     PIC 9(02) VALUE 0.

       01 PF-KEY-TEXT.
          03  PF2                  PIC X(11) VALUE " 2-Default ".
          03  PF3                  PIC X(11) VALUE " 3-Restore ".
          03  PF2-F                PIC X(11) VALUE " 2-First   ".
          03  PF3-L                PIC X(11) VALUE " 3-Last    ".
          03  PF4                  PIC X(08) VALUE "4-Prev  ".
          03  PF5                  PIC X(08) VALUE "5-Next  ".
          03  PF6                  PIC X(10) VALUE "6-Down    ".
          03  PF7                  PIC X(10) VALUE "7-Up      ".
          03  PF8                  PIC X(11) VALUE "8-Position ".
          03  PF9                  PIC X(11) VALUE "9-Modify   ".
          03  PF10-RV              PIC X(12) VALUE "10-Renumber ".
          03  PF10-WS              PIC X(12) VALUE "10-Reorder  ".
          03  PF11                 PIC X(12) VALUE "11-Insert   ".
          03  PF12                 PIC X(10) VALUE "12-Delete ".
          03  PF13                 PIC X(10) VALUE "13-Help   ".
          03  PF14                 PIC X(09) VALUE "14-Move  ".
          03  PF15                 PIC X(09) VALUE "15-Save  ".
          03  PF16                 PIC X(07) VALUE "16-Exit".

       01  START-ROW                PIC 9(02)  VALUE 0.
       01  RV-REC.
           03  RV-REC-DEF           PIC X(02)  VALUE "R0".
           03  RV-REC-NUMBER  REDEFINES RV-REC-DEF.
               05  FILLER           PIC X(01).
               05  RV-REC-NUM       PIC 9(01).

       01  NEW-SEQ                  PIC 9(03).
       01  1-SEQ                    PIC 9(03).
       01  2-SEQ                    PIC 9(03).

       01  HOLD-FAC                 PIC X(01).
       01  HOLD-FAC2                PIC X(01).
       01  HOLD-FAC3                PIC X(01).
       01  HOLD1-CNT                BINARY VALUE 0.
       01  HOLD2-CNT                BINARY VALUE 0.
       01  HOLD-TEXT                PIC X(80) VALUE SPACES.
       01  HOLD-TEXT2               PIC X(80) VALUE SPACES.
       01  HOLD-TEXT3               PIC X(80) VALUE SPACES.
       01  SCN-TEXT                 PIC X(21) VALUE SPACES.

      ******************************************************************
      *                DATA FOR READFDR                                *
      ******************************************************************

       01  FDR-MODE.
           03  FDR-MODE-1        BINARY  VALUE 0.
           03  FDR-MODE-2        BINARY  VALUE 0.
       01  FDR-FUNCTION          PIC X(02) VALUE SPACES.
       01  FDR-RECEIVER.
           03  FILLER            BINARY.
           03  FDR-RECORD-COUNT  BINARY.
       01  FDR-RETURN-CODE.
           03  FILLER            BINARY.
           03  FDR-RETURN-2      BINARY.

      ******************************************************************
      *                DATA FOR GETPARM                                *
      ******************************************************************

       01  GP-TYPE               PIC X(2)  VALUE "I ".
       01  GP-FORM               PIC X(1)  VALUE "R".
       01  GP-PRNAME             PIC X(8)  VALUE "MFILE   ".
       01  GP-PFKEY              PIC X(1)  VALUE " ".
       01  GP-MESSAGE-ID         PIC X(4)  VALUE "0001".
       01  GP-MESSAGE-ISSUER     PIC X(6)  VALUE "AMUMDM".
       01  GP-MESSAGE-COUNT.
           03  FILLER            BINARY    VALUE 0.
           03  FILLER            BINARY    VALUE 2.
       01  GP-MESSAGE-TEXT-1     PIC X(28)
           VALUE "The first message text line.".
       01  GP-MESSAGE-TEXT-2     PIC X(16)
           VALUE "The second line.".
       01  GP-MESSAGE-LEN-1.
           03  FILLER            BINARY    VALUE 0.
           03  FILLER            BINARY    VALUE 28.
       01  GP-MESSAGE-LEN-2.
           03  FILLER            BINARY    VALUE 0.
           03  FILLER            BINARY    VALUE 16.

      /*****************************************************************
      *                                                                *
      *                   DISPLAY DEFINITIONS                          *
      *                                                                *
      ******************************************************************
      *
123456*89012345678901234567890123456789012345678901234567890123456789012
       01  AMUEM100-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(32) ROW 1 COL 25
               SOURCE SCREEN-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUEM100".
           03  AMUEM100-1  PIC X(27) ROW 2 COL 28 VALUE
               "Menu Definition Maintenance".
           03  FILLER  PIC X(08) ROW 4 COL 02 VALUE
               "To Exit:".
           03  AMUEM100-2 PIC X(54) ROW 4 COL 13 VALUE
               "Position Cursor to Desired Function and Press <RETURN>".
           03  FILLER  PIC X(08) ROW 4 COL 72 VALUE
               "To Quit:".
           03  FILLER  PIC X(08) ROW 5 COL 02 VALUE
               "PFKEY 16".
           03  FILLER  PIC X(08) ROW 5 COL 72 VALUE
               "PFKEY 32".
           03  AMUEM100-MENU-1 PIC X(30) ROW  6 COL 25
               SOURCE AMUEM100-ITEM-1.
           03  AMUEM100-MENU-2 PIC X(30) ROW  7 COL 25
               SOURCE AMUEM100-ITEM-2.
           03  AMUEM100-MENU-3 PIC X(30) ROW  8 COL 25
               SOURCE AMUEM100-ITEM-3.
           03  AMUEM100-MENU-4 PIC X(30) ROW  9 COL 25
               SOURCE AMUEM100-ITEM-4.
           03  AMUEM100-MENU-5 PIC X(31) ROW 10 COL 25
               SOURCE AMUEM100-ITEM-5.

       01  AMUEM100-ITEM-1.
           03  100-SUB-COL1-I1 PIC X     VALUE MENU-PICK.
           03  100-SUB-COL2-I1 PIC X     VALUE SUB-5.
           03  FILLER          PIC X     VALUE SPACES.
           03  AMUEM100-I1     PIC X(15) VALUE
               "Create New Menu".

       01  AMUEM100-ITEM-2.
           03  100-SUB-COL1-I2 PIC X     VALUE MENU-PICK.
           03  100-SUB-COL2-I2 PIC X     VALUE SUB-5.
           03  FILLER          PIC X     VALUE SPACES.
           03  AMUEM100-I2     PIC X(22) VALUE
               "Maintain Specific Menu".

       01  AMUEM100-ITEM-3.
           03  100-SUB-COL1-I3 PIC X     VALUE MENU-PICK.
           03  100-SUB-COL2-I3 PIC X     VALUE SUB-5.
           03  FILLER          PIC X     VALUE SPACES.
           03  AMUEM100-I3     PIC X(22) VALUE
               "List all Menus on File".

       01  AMUEM100-ITEM-4.
           03  100-SUB-COL1-I4 PIC X     VALUE MENU-PICK.
           03  100-SUB-COL2-I4 PIC X     VALUE SUB-5.
           03  FILLER          PIC X     VALUE SPACES.
           03  AMUEM100-I4     PIC X(21) VALUE
               "File Options/Defaults".

       01  AMUEM100-ITEM-5.
           03  100-SUB-COL1-I5 PIC X     VALUE MENU-PICK.
           03  100-SUB-COL2-I5 PIC X     VALUE SUB-5.
           03  FILLER          PIC X     VALUE SPACES.
           03  AMUEM100-I5     PIC X(27) VALUE
               "Copy Menu From Another File".

       01  AMUEM110-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(32) ROW 1 COL 25
               SOURCE SCREEN-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUEM110".
           03  AMUEM110-1 PIC X(21) ROW 2 COL 29 VALUE
               "File Options/Defaults".
           03  FILLER  PIC X(08) ROW 4 COL 02 VALUE
               "To Exit:".
           03  AMUEM110-2 PIC X(54) ROW 4 COL 13 VALUE
               "Position Cursor to Desired Function and Press <RETURN>".
           03  FILLER  PIC X(08) ROW 4 COL 72 VALUE
               "To Quit:".
           03  FILLER  PIC X(08) ROW 5 COL 02 VALUE
               "PFKEY 16".
           03  FILLER  PIC X(08) ROW 5 COL 72 VALUE
               "PFKEY 32".
           03  AMUEM110-MENU-1 PIC X(30) ROW 6 COL 25
               SOURCE AMUEM110-ITEM-1.
           03  AMUEM110-MENU-2 PIC X(30) ROW 7 COL 25
               SOURCE AMUEM110-ITEM-2.
           03  AMUEM110-MENU-3 PIC X(30) ROW 8 COL 25
               SOURCE AMUEM110-ITEM-3.
           03  AMUEM110-MENU-4 PIC X(30) ROW 9 COL 25
               SOURCE AMUEM110-ITEM-4.

       01  AMUEM110-ITEM-1.
           03  SUB-COL1  PIC X     VALUE MENU-PICK.
           03  SUB-COL2  PIC X     VALUE SUB-5.
           03  FILLER    PIC X     VALUE SPACES.
           03  FILLER    PIC X(12) VALUE
               "File Options".

       01  AMUEM110-ITEM-2.
           03  SUB-COL1  PIC X     VALUE MENU-PICK.
           03  SUB-COL2  PIC X     VALUE SUB-5.
           03  FILLER    PIC X     VALUE SPACES.
           03  FILLER    PIC X(21) VALUE
               "Window Specifications".

       01  AMUEM110-ITEM-3.
           03  SUB-COL1  PIC X     VALUE MENU-PICK.
           03  SUB-COL2  PIC X     VALUE SUB-5.
           03  FILLER    PIC X     VALUE SPACES.
           03  FILLER    PIC X(20) VALUE
               "Default Menu Options".

       01  AMUEM110-ITEM-4.
           03  SUB-COL1  PIC X     VALUE MENU-PICK.
           03  SUB-COL2  PIC X     VALUE SUB-5.
           03  FILLER    PIC X     VALUE SPACES.
           03  FILLER    PIC X(17) VALUE
               "Runtime Variables".

       01  AMUEM120-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 1
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUEM120".
           03  AMUEM120-1  PIC X(62) ROW 2 COL 12
               SOURCE MENU-ID-TITLE.
           03  FILLER  PIC X(08) ROW 4 COL 02 VALUE
               "To Exit:".
           03  AMUEM120-2 PIC X(54) ROW 4 COL 13 VALUE
               "Position Cursor to Desired Function and Press <RETURN>".
           03  FILLER  PIC X(08) ROW 4 COL 72 VALUE
               "To Quit:".
           03  FILLER  PIC X(08) ROW 5 COL 02 VALUE
               "PFKEY 16".
           03  FILLER  PIC X(08) ROW 5 COL 72 VALUE
               "PFKEY 32".
           03  AMUEM120-MENU-1 PIC X(30) ROW  6 COL 25
               SOURCE AMUEM120-ITEM-1.
           03  AMUEM120-MENU-2 PIC X(30) ROW  7 COL 25
               SOURCE AMUEM120-ITEM-2.
           03  AMUEM120-MENU-3 PIC X(30) ROW  8 COL 25
               SOURCE AMUEM120-ITEM-3.
           03  AMUEM120-MENU-4 PIC X(30) ROW  9 COL 25
               SOURCE AMUEM120-ITEM-4.
           03  AMUEM120-MENU-5 PIC X(34) ROW 10 COL 25
               SOURCE AMUEM120-ITEM-5.
           03  AMUEM120-MENU-6 PIC X(34) ROW 11 COL 25
               SOURCE AMUEM120-ITEM-6.

       01  MENU-ID-TITLE PIC X(79) VALUE SPACES. 
       01  MENU-RECORD           PIC 9(01) VALUE 0.
       01  SEL-CNT               BINARY    VALUE 0.
       01  SEL-MAX               BINARY    VALUE 0.
       01  MOD-SEL               BINARY    VALUE 0.

       01  AMUEM120-ITEM-1.
           03  120-SUB-COL1-I1  PIC X     VALUE MENU-PICK.
           03  120-SUB-COL2-I1  PIC X     VALUE SUB-5.
           03  FILLER           PIC X     VALUE SPACES.
           03  AMUEM120-I1      PIC X(16) VALUE
               "Options for Menu".

       01  AMUEM120-ITEM-2.
           03  120-SUB-COL1-I2  PIC X     VALUE MENU-PICK.
           03  120-SUB-COL2-I2  PIC X     VALUE SUB-5.
           03  FILLER           PIC X     VALUE SPACES.
           03  AMUEM120-I2      PIC X(19) VALUE
               "Selections for Menu".

       01  AMUEM120-ITEM-3.
           03  120-SUB-COL1-I3  PIC X     VALUE MENU-PICK.
           03  120-SUB-COL2-I3  PIC X     VALUE SUB-5.
           03  FILLER           PIC X     VALUE SPACES.
           03  AMUEM120-I3      PIC X(22) VALUE SPACES.

       01  AMUEM120-ITEM-4.
           03  120-SUB-COL1-I4  PIC X     VALUE MENU-PICK.
           03  120-SUB-COL2-I4  PIC X     VALUE SUB-5.
           03  FILLER           PIC X     VALUE SPACES.
           03  AMUEM120-I4      PIC X(26) VALUE SPACES.

       01  AMUEM120-ITEM-5.
           03  120-SUB-COL1-I5  PIC X     VALUE MENU-PICK.
           03  120-SUB-COL2-I5  PIC X     VALUE SUB-5.
           03  FILLER           PIC X     VALUE SPACES.
           03  AMUEM120-I5      PIC X(31) VALUE SPACES.

       01  AMUEM120-ITEM-6.
           03  120-SUB-COL1-I6  PIC X     VALUE MENU-PICK.
           03  120-SUB-COL2-I6  PIC X     VALUE SUB-5.
           03  FILLER           PIC X     VALUE SPACES.
           03  AMUEM120-I6      PIC X(21) VALUE SPACES.

       01  AMUES111-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 1
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES111".
           03  AMUES111-2-1 PIC X(12) ROW 2 COL 34 VALUE
               "File Options".
           03  AMUES111-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  AMUES111-4-1 PIC X(08) ROW 4 COL 27 VALUE
               "  FILE  ".
           03  AMUES111-4-2 PIC X(08) ROW 4 COL 36 VALUE
               "LIBRARY ".
           03  AMUES111-4-3 PIC X(06) ROW 4 COL 45 VALUE
               "VOLUME".
           03  AMUES111-4-4 PIC X(16) ROW 4 COL 52 VALUE
               "PARAMETER/OPTION".
           03  AMUES111-4-5 PIC X(03) ROW 4 COL 69 VALUE
               "DHK".
           03  AMUES111-4-6 PIC X(03) ROW 4 COL 73 VALUE
               "WIP".
           03  FILLER  PIC X(25) ROW 5 COL 01 VALUE
               "     File Entry Procedure".
           03  AMUES111-5-1  PIC X(08) ROW 5 COL 27
               SOURCE ENTRY-PROC-FILE  OBJECT ENTRY-PROC-FILE.
           03  AMUES111-5-2 PIC X(08) ROW 5 COL 36
               SOURCE ENTRY-PROC-LIB   OBJECT ENTRY-PROC-LIB.
           03  AMUES111-5-3 PIC X(06) ROW 5 COL 45
               SOURCE ENTRY-PROC-VOL   OBJECT ENTRY-PROC-VOL.
           03  AMUES111-5-4 PIC X(16) ROW 5 COL 52
               SOURCE ENTRY-PROC-PAR-OPT OBJECT ENTRY-PROC-PAR-OPT.
           03  AMUES111-5-5 PIC X(01) ROW 5 COL 71
               SOURCE ENTRY-PROC-DHK   OBJECT ENTRY-PROC-DHK.
           03  AMUES111-5-6 PIC X(01) ROW 5 COL 75
               SOURCE ENTRY-PROC-WIP   OBJECT ENTRY-PROC-WIP.
           03  FILLER  PIC X(25) ROW 6 COL 01 VALUE
               "      File Exit Procedure".
           03  AMUES111-6-1 PIC X(08) ROW 6 COL 27
               SOURCE EXIT-PROC-FILE  OBJECT EXIT-PROC-FILE.
           03  AMUES111-6-2 PIC X(08) ROW 6 COL 36
               SOURCE EXIT-PROC-LIB   OBJECT EXIT-PROC-LIB.
           03  AMUES111-6-3 PIC X(06) ROW 6 COL 45
               SOURCE EXIT-PROC-VOL   OBJECT EXIT-PROC-VOL.
           03  AMUES111-6-4 PIC X(16) ROW 6 COL 52
               SOURCE EXIT-PROC-PAR-OPT OBJECT EXIT-PROC-PAR-OPT.
           03  AMUES111-6-5 PIC X(01) ROW 6 COL 71
               SOURCE EXIT-PROC-DHK   OBJECT EXIT-PROC-DHK.
           03  AMUES111-6-6 PIC X(01) ROW 6 COL 75
               SOURCE EXIT-PROC-WIP   OBJECT EXIT-PROC-WIP.
           03  FILLER  PIC X(25) ROW 7 COL 01 VALUE
               " Function Key Definitions".
           03  AMUES111-7-1 PIC X(08) ROW 7 COL 27
               SOURCE FUNC-KEY-FILE  OBJECT FUNC-KEY-FILE.
           03  AMUES111-7-2 PIC X(08) ROW 7 COL 36
               SOURCE FUNC-KEY-LIB   OBJECT FUNC-KEY-LIB.
           03  AMUES111-7-3 PIC X(06) ROW 7 COL 45
               SOURCE FUNC-KEY-VOL   OBJECT FUNC-KEY-VOL.
           03  FILLER  PIC X(25) ROW 8 COL 01 VALUE
               "         User Definitions".
           03  AMUES111-8-1 PIC X(08) ROW 8 COL 27
               SOURCE USER-DEF-FILE  OBJECT USER-DEF-FILE.
           03  AMUES111-8-2 PIC X(08) ROW 8 COL 36
               SOURCE USER-DEF-LIB   OBJECT USER-DEF-LIB.
           03  AMUES111-8-3 PIC X(06) ROW 8 COL 45
               SOURCE USER-DEF-VOL   OBJECT USER-DEF-VOL.
           03  FILLER  PIC X(25) ROW 9 COL 01 VALUE
               "         Activity Logging".
           03  AMUES111-9-1 PIC X(08) ROW 9 COL 27
               SOURCE ACTIVITY-LOG-FILE  OBJECT ACTIVITY-LOG-FILE.
           03  AMUES111-9-2 PIC X(08) ROW 9 COL 36
               SOURCE ACTIVITY-LOG-LIB   OBJECT ACTIVITY-LOG-LIB.
           03  AMUES111-9-3 PIC X(06) ROW 9 COL 45
               SOURCE ACTIVITY-LOG-VOL   OBJECT ACTIVITY-LOG-VOL.
           03  FILLER  PIC X(09) ROW 9 COL 52 VALUE
               "Records =".
           03  AMUES111-9-4 PIC X(06) ROW 9 COL 62
               SOURCE ACTIVITY-LOG-RECS  OBJECT ACTIVITY-LOG-RECS.
           03  FILLER  PIC X(25) ROW 10 COL 01 VALUE
               "       Logging Error Port".
           03  AMUES111-10-1 PIC X(04) ROW 10 COL 27
               SOURCE LOGGING-ERR-PORT  OBJECT LOGGING-ERR-PORT.
           03  FILLER  PIC X(25) ROW 11 COL 01 VALUE
               "        User Message Port".
           03  AMUES111-11-1 PIC X(04) ROW 11 COL 27
               SOURCE USER-MESSAGE-PORT  OBJECT USER-MESSAGE-PORT.
           03  FILLER  PIC X(25) ROW 12 COL 01 VALUE
               "Password to Maintain File".
           03  AMUES111-12-1 PIC X(08) ROW 12 COL 27
               SOURCE PW-MAINTAIN-FILE  OBJECT PW-MAINTAIN-FILE.
           03  FILLER  PIC X(08) ROW 12 COL 36 VALUE
               "ACCESS =".
           03  AMUES111-12-2 PIC X(06) ROW 12 COL 45
               SOURCE FILE-OPTION-ACCESS  OBJECT FILE-OPTION-ACCESS.
           03  FILLER  PIC X(25) ROW 13 COL 01 VALUE
               "    Password to Run Menus".
           03  AMUES111-13-1 PIC X(08) ROW 13 COL 27
               SOURCE PW-RUN-ALL-MENUS  OBJECT PW-RUN-ALL-MENUS.
           03  FILLER  PIC X(45) ROW 15 COL 06 VALUE
               "Restrict Updates By: ........................".
           03  AMUES111-15-1 PIC X(08) ROW 15 COL 52 VALUE
               "Password".
           03  AMUES111-15-2 PIC X(15) ROW 15 COL 61 VALUE
               "VS Write Access".
           03  FILLER  PIC X(28) ROW 16 COL 23 VALUE
               "To: File Options............".
           03  AMUES111-16-1 PIC X(08) ROW 16 COL 52
               SOURCE PW-FILE-OPTIONS  OBJECT PW-FILE-OPTIONS.
           03  AMUES111-16-2 PIC X(01) ROW 16 COL 68
               SOURCE WA-FILE-OPTIONS  OBJECT WA-FILE-OPTIONS.
           03  FILLER  PIC X(28) ROW 17 COL 23 VALUE
               "    Window Specifications...".
           03  AMUES111-17-1 PIC X(08) ROW 17 COL 52
               SOURCE PW-WINDOW-SPECS  OBJECT PW-WINDOW-SPECS.
           03  AMUES111-17-2 PIC X(01) ROW 17 COL 68
               SOURCE WA-WINDOW-SPECS  OBJECT WA-WINDOW-SPECS.
           03  FILLER  PIC X(28) ROW 18 COL 23 VALUE
               "    Default Menu Options....".
           03  AMUES111-18-1 PIC X(08) ROW 18 COL 52
               SOURCE PW-DEF-MENU-OPTS  OBJECT PW-DEF-MENU-OPTS.
           03  AMUES111-18-2 PIC X(01) ROW 18 COL 68
               SOURCE WA-DEF-MENU-OPTS  OBJECT WA-DEF-MENU-OPTS.
           03  FILLER  PIC X(28) ROW 19 COL 23 VALUE
               "    Runtime Variables.......".
           03  AMUES111-19-1 PIC X(08) ROW 19 COL 52
               SOURCE PW-RUNTIME-VARS  OBJECT PW-RUNTIME-VARS.
           03  AMUES111-19-2 PIC X(01) ROW 19 COL 68
               SOURCE WA-RUNTIME-VARS  OBJECT WA-RUNTIME-VARS.
           03  AMUES111-21   OCCURS 4 TIMES  ROW 21.
               05  AMUES111-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES111-HELP  OBJECT AMUES111-HELP.

       01  AMUES111-HELP-DEF.
           03  AMUES111-HELP    OCCURS 4 TIMES.
               05  AMUES111-HELP-ROW-VAL PIC X(80) VALUE SPACES.

       01  AMUES113-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 1
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72
               SOURCE SCREEN-NAME.
           03  AMUES113-2-1 PIC X(20) ROW 2 COL 30
               SOURCE MENU-OPTIONS-SCREEN.
           03  AMUES113-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  FILLER  PIC X(06)      ROW 4 COL 04 VALUE
               "Format".
           03  AMUES113-4-1  PIC X(02)      ROW 4 COL 11
               SOURCE DEF-MO-FORMAT  OBJECT DEF-MO-FORMAT.
           03  FILLER  PIC X(05)      ROW 4 COL 14 VALUE
               "Title".
           03  AMUES113-4-2  PIC X(40)  ROW 4 COL 20
               SOURCE DEF-MO-TITLE  OBJECT DEF-MO-TITLE.
           03  FILLER  PIC X(07)      ROW 4 COL 63 VALUE
               "Version".
           03  AMUES113-4-3  PIC X(08)  ROW 4 COL 71
               SOURCE DEF-MO-VERSION  OBJECT  DEF-MO-VERSION.
           03  AMUES113-6-1  PIC X(08) ROW 6 COL 28 VALUE
               "  FILE  ".
           03  AMUES113-6-2 PIC X(08) ROW 6 COL 37 VALUE
               "LIBRARY ".
           03  AMUES113-6-3 PIC X(06) ROW 6 COL 46 VALUE
               "VOLUME".
           03  AMUES113-6-4 PIC X(16) ROW 6 COL 53 VALUE
               "PARAMETER/OPTION".
           03  AMUES113-6-5 PIC X(03) ROW 6 COL 70 VALUE
               "DHK".
           03  AMUES113-6-6 PIC X(03) ROW 6 COL 74 VALUE
               "WIP".
           03  FILLER  PIC X(25) ROW 7 COL 01 VALUE
               "     Menu Entry Procedure".
           03  AMUES113-7-1  PIC X(08) ROW 7 COL 28
               SOURCE ENTRY-PROC-MENU-FILE  OBJECT ENTRY-PROC-MENU-FILE.
           03  AMUES113-7-2 PIC X(08) ROW 7 COL 37
               SOURCE ENTRY-PROC-MENU-LIB   OBJECT ENTRY-PROC-MENU-LIB.
           03  AMUES113-7-3 PIC X(06) ROW 7 COL 46
               SOURCE ENTRY-PROC-MENU-VOL   OBJECT ENTRY-PROC-MENU-VOL.
           03  AMUES113-7-4 PIC X(16) ROW 7 COL 53
               SOURCE ENTRY-PROC-MENU-PAR-OPT 
               OBJECT ENTRY-PROC-MENU-PAR-OPT.
           03  AMUES113-7-5 PIC X(01) ROW 7 COL 71
               SOURCE ENTRY-PROC-MENU-DHK   OBJECT ENTRY-PROC-MENU-DHK.
           03  AMUES113-7-6 PIC X(01) ROW 7 COL 75
               SOURCE ENTRY-PROC-MENU-WIP   OBJECT ENTRY-PROC-MENU-WIP.
           03  FILLER  PIC X(25) ROW 8 COL 01 VALUE
               "      Menu Exit Procedure".
           03  AMUES113-8-1 PIC X(08) ROW 8 COL 28
               SOURCE EXIT-PROC-MENU-FILE  OBJECT EXIT-PROC-MENU-FILE.
           03  AMUES113-8-2 PIC X(08) ROW 8 COL 37
               SOURCE EXIT-PROC-MENU-LIB   OBJECT EXIT-PROC-MENU-LIB.
           03  AMUES113-8-3 PIC X(06) ROW 8 COL 46
               SOURCE EXIT-PROC-MENU-VOL   OBJECT EXIT-PROC-MENU-VOL.
           03  AMUES113-8-4 PIC X(16) ROW 8 COL 53
               SOURCE EXIT-PROC-MENU-PAR-OPT
               OBJECT EXIT-PROC-MENU-PAR-OPT.
           03  AMUES113-8-5 PIC X(01) ROW 8 COL 71
               SOURCE EXIT-PROC-MENU-DHK   OBJECT EXIT-PROC-MENU-DHK.
           03  AMUES113-8-6 PIC X(01) ROW 8 COL 75
               SOURCE EXIT-PROC-MENU-WIP   OBJECT EXIT-PROC-MENU-WIP.
           03  FILLER  PIC X(25) ROW 9 COL 01 VALUE
               "         User Definitions".
           03  AMUES113-9-1 PIC X(08) ROW 9 COL 28
               SOURCE USER-DEF-MENU-FILE  OBJECT USER-DEF-MENU-FILE.
           03  AMUES113-9-2 PIC X(08) ROW 9 COL 36
               SOURCE USER-DEF-MENU-LIB   OBJECT USER-DEF-MENU-LIB.
           03  AMUES113-9-3 PIC X(06) ROW 9 COL 45
               SOURCE USER-DEF-MENU-VOL   OBJECT USER-DEF-MENU-VOL.
           03  FILLER  PIC X(26) ROW 11 COL 01 VALUE
               "      User Record Required".
           03  AMUES113-11 PIC X(01) ROW 11 COL 28
               SOURCE USER-REC-REQUIRED  OBJECT USER-REC-REQUIRED.
           03  FILLER  PIC X(26) ROW 12 COL 01 VALUE
               "      Password to Run Menu".
           03  AMUES113-12 PIC X(08) ROW 12 COL 28
               SOURCE PW-RUN-MENU  OBJECT PW-RUN-MENU.
           03  FILLER  PIC X(26) ROW 13 COL 01 VALUE
               " Password to Maintain Menu".
           03  AMUES113-13-1 PIC X(08) ROW 13 COL 28
               SOURCE PW-MAINTAIN-MENU  OBJECT PW-MAINTAIN-MENU.
           03  FILLER  PIC X(13) ROW 13 COL 48 VALUE
               "Access Method".
           03  AMUES113-13-2 PIC X(06) ROW 13 COL 63
               SOURCE ACCESS-METHOD  OBJECT ACCESS-METHOD.
           03  FILLER  PIC X(26) ROW 14 COL 01 VALUE
               "Primary Instruction Window".
           03  AMUES113-14-1 PIC X(01) ROW 14 COL 28
               SOURCE PRIMARY-INSTRUCT-WIN  OBJECT PRIMARY-INSTRUCT-WIN.
           03  FILLER  PIC X(14) ROW 14 COL 47 VALUE
               "Security Class".
           03  AMUES113-14-2 PIC X(01) ROW 14 COL 63
               SOURCE SECURITY-CLASS  OBJECT SECURITY-CLASS.
           03  FILLER  PIC X(26) ROW 15 COL 01 VALUE
               "     Function Name on Menu".
           03  AMUES113-15 PIC X(01) ROW 15 COL 28
               SOURCE FUNC-NAME-ON-MENU
               OBJECT FUNC-NAME-ON-MENU.
           03  FILLER  PIC X(26) ROW 16 COL 01 VALUE
               "               Date Format".
           03  AMUES113-16 PIC X(03) ROW 16 COL 28
               SOURCE DATE-FORMAT  OBJECT DATE-FORMAT.
           03  FILLER  PIC X(26) ROW 17 COL 01 VALUE
               "               Time Format".
           03  AMUES113-17-1 PIC X(01) ROW 17 COL 28
               SOURCE TIME-FORMAT  OBJECT TIME-FORMAT.
           03  FILLER  PIC X(11) ROW 17 COL 50 VALUE
               "Time Update".
           03  AMUES113-17-2 PIC X(02) ROW 17 COL 63
               SOURCE TIME-UPDATE  OBJECT TIME-UPDATE.
           03  FILLER  PIC X(26) ROW 18 COL 01 VALUE
               "             Timeout Limit".
           03  AMUES113-18-1 PIC X(02) ROW 18 COL 28
               SOURCE TIMEOUT-LIMIT  OBJECT TIMEOUT-LIMIT.
           03  FILLER  PIC X(14) ROW 18 COL 47 VALUE
               "Timeout Action".
           03  AMUES113-18-2 PIC X(01) ROW 18 COL 63
               SOURCE TIMEOUT-ACTION  OBJECT TIMEOUT-ACTION.
           03  FILLER         PIC X(26) ROW 19 COL 01
               SOURCE MOD-LOCK-ON-TEXT.
           03  FILLER         PIC X(08) ROW 19 COL 28
               SOURCE MODIFIED-ON-DATE.
           03  FILLER         PIC X(14) ROW 19 COL 47
               SOURCE MOD-LOCK-BY-TEXT.
           03  FILLER         PIC X(03) ROW 19 COL 63
               SOURCE MODIFIED-BY-USER.
           03  AMUES113-21   OCCURS 4 TIMES  ROW 21.
               05  AMUES113-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES113-HELP  OBJECT AMUES113-HELP.

       01  SCREEN-NAME     PIC X(08) VALUE SPACES.

       01  AMUES113-HELP-DEF.
           03  AMUES113-HELP    OCCURS 4 TIMES.
               05  AMUES113-HELP-ROW-VAL PIC X(80) VALUE SPACES.

       01  MOD-LOCK-ON-TEXT     PIC X(26) VALUE SPACES.
       01  MOD-LOCK-BY-TEXT     PIC X(14) VALUE SPACES.

       01  AMUES114-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 1
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES114".
           03  AMUES114-2-1 PIC X(17) ROW 2 COL 31 VALUE
               "Runtime Variables".
           03  AMUES114-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  AMUES114-5-1  PIC X(3) ROW 5 COL 01 VALUE
               "SEQ".
           03  AMUES114-5-2  PIC X(5) ROW 5 COL 05 VALUE
               "LABEL".
           03  AMUES114-5-3  PIC X(39) ROW 5 COL 11 VALUE
               "<-------------DESCRIPTION------------->".
           03  AMUES114-5-4  PIC X(8) ROW 5 COL 51 VALUE
               "  FILE  ".
           03  AMUES114-5-5  PIC X(8) ROW 5 COL 60 VALUE
               "LIBRARY ".
           03  AMUES114-5-6  PIC X(6) ROW 5 COL 69 VALUE
               "VOLUME".
           03  AMUES114-5-7  PIC X(3) ROW 5 COL 76 VALUE
               "MOD".
           03  AMUES114-6   OCCURS 15 TIMES ROW 6.
               05  S-RT-VAR-SEQ PIC X(03) ROW 6 COL 1
                   SOURCE RVSEL-SEQ.
               05  S-RT-VAR-LABEL PIC X(05) ROW 6 COL 5
                   SOURCE RVSEL-LABEL  OBJECT RVSEL-LABEL.
               05  S-RT-VAR-DESC PIC X(39) ROW 6 COL 11
                   SOURCE RVSEL-DESC  OBJECT RVSEL-DESC.
               05  S-RT-VAR-FILE PIC X(08) ROW 6 COL 51
                   SOURCE RVSEL-FILE  OBJECT RVSEL-FILE.
               05  S-RT-VAR-LIB PIC X(08) ROW 6 COL 60
                   SOURCE RVSEL-LIB  OBJECT RVSEL-LIB.
               05  S-RT-VAR-VOL PIC X(06) ROW 6 COL 69
                   SOURCE RVSEL-VOL  OBJECT RVSEL-VOL.
               05  S-RT-VAR-MOD PIC X(01) ROW 6 COL 77
                   SOURCE RVSEL-MOD  OBJECT RVSEL-MOD.
           03  AMUES114-21   OCCURS 4 TIMES  ROW 21.
               05  AMUES114-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES114-HELP  OBJECT AMUES114-HELP.

       01  AMUES114-HELP-DEF.
           03  AMUES114-HELP    OCCURS 4 TIMES.
               05  AMUES114-HELP-ROW-VAL PIC X(80) VALUE SPACES.

       01  AMUES114-RVSEL-TABLE.
           03  RVSEL-SCREEN       OCCURS 15 TIMES.
               05  RVSEL-SEQ             PIC X(03)  VALUE SPACES.
               05  RVSEL-LABEL           PIC X(05)  VALUE SPACES.
               05  RVSEL-DESC            PIC X(40)  VALUE SPACES.
               05  RVSEL-FILE            PIC X(08)  VALUE SPACES.
               05  RVSEL-LIB             PIC X(08)  VALUE SPACES.
               05  RVSEL-VOL             PIC X(06)  VALUE SPACES.
               05  RVSEL-MOD             PIC X(01)  VALUE SPACES.

       01  AMUEL120-SCREEN USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(32) ROW 1 COL 25
               SOURCE SCREEN-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUEL120".
           03  AMUEL120-3-ROW   PIC X(70)  ROW 3 COL 05
               SOURCE AMUEL120-FILE-INFO.
           03  AMUEL120-5    OCCURS 15 TIMES ROW 5.
               05  AMUEL120-5-ROW   PIC X(51)  ROW 5 COL 13
                   SOURCE AMUEL120-ITEM-ROW  OBJECT AMUEL120-ITEM-ROW. 
           03  AMUEL120-21   OCCURS 4 TIMES  ROW 21.
               05  AMUEL120-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUEL120-HELP  OBJECT AMUEL120-HELP.

       01  AMUEL120-FILE-INFO.
           03  FILLER             PIC X(05) VALUE "File ".
           03  LIST-MENU-FILE     PIC X(08) VALUE SPACES.
           03  FILLER             PIC X(12) VALUE " in Library ".
           03  LIST-MENU-LIB      PIC X(08) VALUE SPACES.
           03  FILLER             PIC X(11) VALUE " on Volume ".
           03  LIST-MENU-VOL      PIC X(06) VALUE SPACES.
           03  FILLER             PIC X(10) VALUE " Contains ".
           03  LIST-MENU-CNT      PIC Z(04) VALUE ZERO.
           03  FILLER             PIC X(06) VALUE " Menus". 

       01  MENU-COUNT             PIC 9(04) VALUE ZERO.
       01  CURR-MENU-COUNT        PIC 9(04) VALUE ZERO.

       01  AMUEL120-ITEM.
           03  AMUEL120-ITEM-ROW  OCCURS 15 TIMES.
               05  120-SUB-COL1    PIC X     VALUE SPACES.
               05  120-SUB-COL2    PIC X     VALUE SPACES.
               05  FILLER          PIC X     VALUE SPACES.
               05  LIST-MENU-ID    PIC X(06) VALUE SPACES.
               05  LIST-SEPARATOR  PIC X(03) VALUE SPACES.
               05  LIST-MENU-TITLE PIC X(40) VALUE SPACES.

       01  AMUEL120-HELP-DEF.
           03  AMUEL120-HELP    OCCURS 4 TIMES.
               05  AMUEL120-HELP-ROW-VAL PIC X(80) VALUE SPACES.

       01  SCN-NUM             BINARY VALUE 1.
       01  AMUES122-SCREEN1-C1 USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 02
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES122".
           03  C1-1AMUES122-2-1 PIC X(15) ROW 2 COL 32 VALUE
               "Menu Selections".
           03  C1-1AMUES122-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  C1-1AMUES122-4-1  PIC X(3) ROW 4 COL 02 VALUE
               "SEQ".
           03  C1-1AMUES122-4-2  PIC X(4) ROW 4 COL 06 VALUE
               "POSN".
           03  C1-1AMUES122-4-3  PIC X(8) ROW 4 COL 11 VALUE  
               "FUNCTION".
           03  C1-1AMUES122-4-5  PIC X(60) ROW 4 COL 20 VALUE 
               "<------------------------DESCRIPTION--------------------
      -        "--->".
           03  C1-1AMUES122-5   OCCURS 15 TIMES ROW 5.
               05  C1-1S-MS-SEQ PIC X(03) ROW 5 COL 02
                   SOURCE MSEL-SEQ.
               05  C1-1S-MS-POSN PIC X(02) ROW 5 COL 07
                   SOURCE MSEL-POSN  OBJECT MSEL-POSN.
               05  C1-1S-MS-FUNC PIC X(08) ROW 5 COL 11
                   SOURCE MSEL-FUNC  OBJECT MSEL-FUNC.
               05  C1-1S-MS-DESC PIC X(60) ROW 5 COL 20
                   SOURCE MSEL-DESC  OBJECT MSEL-DESC.
           03  C1-1AMUES122-21   OCCURS 4 TIMES  ROW 21.
               05  C1-1AMUES122-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES122-HELP  OBJECT AMUES114-HELP.

       01  AMUES122-SCREEN1-P1 USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 02
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES122".
           03  P1-1AMUES122-2-1 PIC X(15) ROW 2 COL 32 VALUE
               "Menu Selections".
           03  P1-1AMUES122-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  P1-1AMUES122-4-1  PIC X(3) ROW 4 COL 02 VALUE
               "SEQ".
           03  P1-1AMUES122-4-2  PIC X(4) ROW 4 COL 06 VALUE
               "POSN".
           03  P1-1AMUES122-4-3  PIC X(8) ROW 4 COL 11 VALUE  
               "FUNCTION".
           03  P1-1AMUES122-4-4  PIC X(2) ROW 4 COL 20 VALUE  
               "PF".
           03  P1-1AMUES122-4-5  PIC X(57) ROW 4 COL 23 VALUE 
               "<----------------------DESCRIPTION----------------------
      -        ">".
           03  P1-1AMUES122-5   OCCURS 15 TIMES ROW 5.
               05  P1-1S-MS-SEQ PIC X(03) ROW 5 COL 02
                   SOURCE MSEL-SEQ.
               05  P1-1S-MS-POSN PIC X(02) ROW 5 COL 07
                   SOURCE MSEL-POSN  OBJECT MSEL-POSN.
               05  P1-1S-MS-FUNC PIC X(08) ROW 5 COL 11
                   SOURCE MSEL-FUNC  OBJECT MSEL-FUNC.
               05  P1-1S-MS-PFKEY   PIC X(02) ROW 5 COL 20
                   SOURCE MSEL-PFKEY  OBJECT MSEL-PFKEY.
               05  P1-1S-MS-DESC PIC X(57) ROW 5 COL 23
                   SOURCE MSEL-DESC  OBJECT MSEL-DESC.
           03  P1-1AMUES122-21   OCCURS 4 TIMES  ROW 21.
               05  P1-1AMUES122-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES122-HELP  OBJECT AMUES114-HELP.

       01  AMUES122-SCREEN1-C2 USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 02
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES122".
           03  C2-1AMUES122-2-1 PIC X(15) ROW 2 COL 32 VALUE
               "Menu Selections".
           03  C2-1AMUES122-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  C2-1AMUES122-4-1  PIC X(3) ROW 4 COL 02 VALUE
               "SEQ".
           03  C2-1AMUES122-4-2  PIC X(4) ROW 4 COL 06 VALUE
               "POSN".
           03  C2-1AMUES122-4-3  PIC X(8) ROW 4 COL 11 VALUE  
               "FUNCTION".
           03  C2-1AMUES122-4-5  PIC X(37) ROW 4 COL 20 VALUE 
               "<------------DESCRIPTION------------>".
           03  C2-1AMUES122-5   OCCURS 15 TIMES ROW 5.
               05  C2-1S-MS-SEQ PIC X(03) ROW 5 COL 02
                   SOURCE MSEL-SEQ.
               05  C2-1S-MS-POSN PIC X(02) ROW 5 COL 07
                   SOURCE MSEL-POSN  OBJECT MSEL-POSN.
               05  C2-1S-MS-FUNC PIC X(08) ROW 5 COL 11
                   SOURCE MSEL-FUNC  OBJECT MSEL-FUNC.
               05  C2-1S-MS-DESC PIC X(37) ROW 5 COL 20
                   SOURCE MSEL-DESC  OBJECT MSEL-DESC.
           03  C2-1AMUES122-21   OCCURS 4 TIMES  ROW 21.
               05  C2-1AMUES122-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES122-HELP  OBJECT AMUES114-HELP.

       01  AMUES122-SCREEN1-P2 USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 02
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES122".
           03  P2-1AMUES122-2-1 PIC X(15) ROW 2 COL 32 VALUE
               "Menu Selections".
           03  P2-1AMUES122-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  P2-1AMUES122-4-1  PIC X(3) ROW 4 COL 02 VALUE
               "SEQ".
           03  P2-1AMUES122-4-2  PIC X(4) ROW 4 COL 06 VALUE
               "POSN".
           03  P2-1AMUES122-4-3  PIC X(8) ROW 4 COL 11 VALUE  
               "FUNCTION".
           03  P2-1AMUES122-4-4  PIC X(2) ROW 4 COL 20 VALUE  
               "PF".
           03  P2-1AMUES122-4-5  PIC X(32) ROW 4 COL 23 VALUE 
               "<---------DESCRIPTION---------->".
           03  P2-1AMUES122-5   OCCURS 15 TIMES ROW 5.
               05  P2-1S-MS-SEQ PIC X(03) ROW 5 COL 02
                   SOURCE MSEL-SEQ.
               05  P2-1S-MS-POSN PIC X(02) ROW 5 COL 07
                   SOURCE MSEL-POSN  OBJECT MSEL-POSN.
               05  P2-1S-MS-FUNC PIC X(08) ROW 5 COL 11
                   SOURCE MSEL-FUNC  OBJECT MSEL-FUNC.
               05  P2-1S-MS-PFKEY   PIC X(02) ROW 5 COL 20
                   SOURCE MSEL-PFKEY  OBJECT MSEL-PFKEY.
               05  P2-1S-MS-DESC PIC X(32) ROW 5 COL 23
                   SOURCE MSEL-DESC  OBJECT MSEL-DESC.
           03  P2-1AMUES122-21   OCCURS 4 TIMES  ROW 21.
               05  P2-1AMUES122-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES122-HELP  OBJECT AMUES114-HELP.

       01  AMUES122-SCREEN1-C3 USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 02
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES122".
           03  C3-1AMUES122-2-1 PIC X(15) ROW 2 COL 32 VALUE
               "Menu Selections".
           03  C3-1AMUES122-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  C3-1AMUES122-4-1  PIC X(3) ROW 4 COL 02 VALUE
               "SEQ".
           03  C3-1AMUES122-4-2  PIC X(4) ROW 4 COL 06 VALUE
               "POSN".
           03  C3-1AMUES122-4-3  PIC X(8) ROW 4 COL 11 VALUE  
               "FUNCTION".
           03  C3-1AMUES122-4-5  PIC X(23) ROW 4 COL 20 VALUE
               "<-----DESCRIPTION----->".
           03  C3-1AMUES122-5   OCCURS 15 TIMES ROW 5.
               05  C3-1S-MS-SEQ PIC X(03) ROW 5 COL 02
                   SOURCE MSEL-SEQ.
               05  C3-1S-MS-POSN PIC X(02) ROW 5 COL 07
                   SOURCE MSEL-POSN  OBJECT MSEL-POSN.
               05  C3-1S-MS-FUNC PIC X(08) ROW 5 COL 11
                   SOURCE MSEL-FUNC  OBJECT MSEL-FUNC.
               05  C3-1S-MS-DESC PIC X(23) ROW 5 COL 20
                   SOURCE MSEL-DESC  OBJECT MSEL-DESC.
           03  C3-1AMUES122-21   OCCURS 4 TIMES  ROW 21.
               05  C3-1AMUES122-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES122-HELP  OBJECT AMUES114-HELP.

       01  AMUES122-SCREEN1-P3 USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 02
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES122".
           03  P3-1AMUES122-2-1 PIC X(15) ROW 2 COL 32 VALUE
               "Menu Selections".
           03  P3-1AMUES122-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  P3-1AMUES122-4-1  PIC X(3) ROW 4 COL 02 VALUE
               "SEQ".
           03  P3-1AMUES122-4-2  PIC X(4) ROW 4 COL 06 VALUE
               "POSN".
           03  P3-1AMUES122-4-3  PIC X(8) ROW 4 COL 11 VALUE  
               "FUNCTION".
           03  P3-1AMUES122-4-4  PIC X(2) ROW 4 COL 20 VALUE  
               "PF".
           03  P3-1AMUES122-4-5  PIC X(18) ROW 4 COL 23 VALUE
               "<--DESCRIPTION--->".
           03  P3-1AMUES122-5   OCCURS 15 TIMES ROW 5.
               05  P3-1S-MS-SEQ PIC X(03) ROW 5 COL 02
                   SOURCE MSEL-SEQ.
               05  P3-1S-MS-POSN PIC X(02) ROW 5 COL 07
                   SOURCE MSEL-POSN  OBJECT MSEL-POSN.
               05  P3-1S-MS-FUNC PIC X(08) ROW 5 COL 11
                   SOURCE MSEL-FUNC  OBJECT MSEL-FUNC.
               05  P3-1S-MS-PFKEY   PIC X(02) ROW 5 COL 20
                   SOURCE MSEL-PFKEY  OBJECT MSEL-PFKEY.
               05  P3-1S-MS-DESC PIC X(18) ROW 5 COL 23
                   SOURCE MSEL-DESC  OBJECT MSEL-DESC.
           03  P3-1AMUES122-21   OCCURS 4 TIMES  ROW 21.
               05  P3-1AMUES122-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES122-HELP  OBJECT AMUES114-HELP.

       01  AMUES122-SCREEN2 USAGE IS DISPLAY-WS.
           03  FILLER  PIC X(11) ROW 1 COL 02
               SOURCE REC-STAT-TEXT.
           03  FILLER  PIC X(31) ROW 1 COL 25
               SOURCE MENU-DEF-TITLE.
           03  FILLER  PIC X(08) ROW 1 COL 72 VALUE
               "AMUES122".
           03  2AMUES122-2-1 PIC X(15) ROW 2 COL 32 VALUE
               "Menu Selections".
           03  2AMUES122-2-2 PIC X(12) ROW 2 COL 68
               SOURCE  SCN-MODE.
           03  2AMUES122-4-1  PIC X(3) ROW 4 COL 02 VALUE
               "SEQ".
           03  2AMUES122-4-2  PIC X(4) ROW 4 COL 06 VALUE
               "POSN".
           03  2AMUES122-4-3  PIC X(8) ROW 4 COL 11 VALUE  
               "FUNCTION".
           03  2AMUES122-4-4  PIC X(8) ROW 4 COL 20 VALUE  
               "LIBRARY ".
           03  2AMUES122-4-5  PIC X(6) ROW 4 COL 29 VALUE
               "VOLUME".
           03  2AMUES122-4-6  PIC X(8) ROW 4 COL 36 VALUE
               "PASSWORD".
           03  2AMUES122-4-7  PIC X(3) ROW 4 COL 45 VALUE
               "S/C".
           03  2AMUES122-4-8  PIC X(3) ROW 4 COL 49 VALUE
               "DHK".
           03  2AMUES122-4-9  PIC X(3) ROW 4 COL 53 VALUE
               "QRC".
           03  2AMUES122-4-10  PIC X(3) ROW 4 COL 57 VALUE
               "SLP".
           03  2AMUES122-4-11  PIC X(16) ROW 4 COL 61 VALUE
               "PARAMETER/OPTION".
           03  2AMUES122-5   OCCURS 15 TIMES ROW 5.
               05  2S-MS-SEQ PIC X(03) ROW 5 COL 02
                   SOURCE MSEL-SEQ.
               05  2S-MS-POSN PIC X(02) ROW 5 COL 07
                   SOURCE MSEL-POSN  OBJECT MSEL-POSN.
               05  2S-MS-FUNC PIC X(08) ROW 5 COL 11
                   SOURCE MSEL-FUNC  OBJECT MSEL-FUNC.
               05  2S-MS-AA PIC X(59) ROW 5 COL 20
                   SOURCE MSEL-AA  OBJECT MSEL-AA.

           03  2AMUES122-21   OCCURS 4 TIMES  ROW 21.
               05  2AMUES122-21-ROW  PIC X(80)  ROW 21 COL 01              
                   SOURCE AMUES122-HELP  OBJECT AMUES114-HELP.

       01  AMUES122-HELP-DEF.
           03  AMUES122-HELP    OCCURS 4 TIMES.
               05  AMUES122-HELP-ROW-VAL PIC X(80) VALUE SPACES.

       01  MS-TABLE.
           03  MENU-SELECTION    OCCURS 72 TIMES.
               05  TSEQ              PIC X(03)  VALUE SPACES.
               05  TPOSN             PIC X(02)  VALUE SPACES.
               05  TFUNCTION         PIC X(08).
               05  TFUNC-STR  REDEFINES TFUNCTION.
                   07  TFUNC-MENU-ID-CHAR  OCCURS 8 TIMES.
                       10  TFUNC-CHAR    PIC X(01).
               05  TPF               PIC X(02)  VALUE SPACES.
               05  TDESCRIPTION      PIC X(60)  VALUe SPACES.
               05  OPTIONAL-DEF      PIC X(44).
               05  PGM-PROC-FIELDS REDEFINES
                         OPTIONAL-DEF.
                   07  TLIBRARY           PIC X(08).
                   07  TVOLUME            PIC X(06).
                   07  TPASSWORD          PIC X(08).
                   07  TDHK               PIC X(01).
                   07  TQRC               PIC X(03).
                   07  TSECURITY-CLASS    PIC X(01).
                   07  TSLP               PIC X(01).
                   07  TPAR-OPTION        PIC X(16).
               05  MENU-SETPOS-FIELDS REDEFINES
                       OPTIONAL-DEF.
                   07  TSEC-CLASSES.
                       09  TS-CLASSES    OCCURS 16 TIMES.
                           10  TSC-CHAR       PIC X(01).
                   07  FILLER             PIC X(28).
               05  EXIT-AND-APP-FIELDS REDEFINES
                       OPTIONAL-DEF.
                   07  TEA-PASSWORD       PIC X(08).
                   07  TEA-SC             PIC X(01).
                   07  TEA-PAR-OPT        PIC X(16).
                   07  FILLER             PIC X(19).
               05  DFTEXT-FIELDS REDEFINES
                       OPTIONAL-DEF.
                   07  TDFTEXT-DESC.
                       10  TWIDTH         PIC X(01).
                       10  TJUSTIFY       PIC X(01).
                       10  TLINE          PIC X(01).
                       10  TVIDEO         PIC X(01).
                   07  TDF-PAR-OPT        PIC X(16).
                   07  FILLER             PIC X(24).

       01  AMUES122-MSEL-TABLE.
           03  MSEL-SCREEN       OCCURS 15 TIMES.
               05  MSEL-SEQ             PIC X(03)  VALUE SPACES.
               05  MSEL-POSN            PIC X(02)  VALUE SPACES.
               05  MSEL-FUNC            PIC X(08)  VALUE SPACES.
               05  MSEL-FUNC-STR  REDEFINES MSEL-FUNC.
                   07  MSEL-FUNC-MENU-ID-CHAR  OCCURS 8 TIMES.
                       10  MSEL-FUNC-CHAR    PIC X(01).
               05  MSEL-PFKEY           PIC X(02)  VALUE SPACES.
               05  MSEL-DESC            PIC X(60)  VALUE SPACES.
               05  MSEL-AA              PIC X(59)  VALUE SPACES.

       01  AA-DFTEXT.
           03  FILLER           PIC X(07) VALUE "Width =".
           03  2S-WIDTH-FAC     PIC X(01) VALUE PLAIN-TEXT.
           03  2S-WIDTH         PIC X(01) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER           PIC X(09) VALUE "Justify =".
           03  2S-JUSTIFY-FAC   PIC X(01) VALUE PLAIN-TEXT.
           03  2S-JUSTIFY       PIC X(01) VALUE SPACES.                                            
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER           PIC X(06) VALUE "Line =".
           03  2S-LINE-FAC      PIC X(01) VALUE PLAIN-TEXT.
           03  2S-LINE          PIC X(01) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER           PIC X(07) VALUE "Video =".
           03  2S-VIDEO-FAC     PIC X(01) VALUE PLAIN-TEXT.
           03  2S-VIDEO         PIC X(01) VALUE SPACES.
           03  2S-PAROPT-FAC    PIC X(01) VALUE PLAIN-TEXT.
           03  2S-PAR-OPT       PIC X(16) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.

       01  AA-EXIT-ACTION.
           03  FILLER           PIC X(16) VALUE SPACES.
           03  2S-EA-PW-FAC     PIC X(01) VALUE BLANK-PRO.
           03  2S-EA-PW         PIC X(08) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  2S-EA-SC-FAC     PIC X(01) VALUE PLAIN-TEXT.
           03  2S-EA-SC         PIC X(01) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER           PIC X(12) VALUE SPACES.
           03  2S-EA-PAROPT-FAC PIC X(01) VALUE PLAIN-TEXT.
           03  2S-EA-PAR-OPT    PIC X(16) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.

       01  AA-PROG-PROC.
           03  2S-LIB           PIC X(08) VALUE SPACES.
           03  2S-VOL-FAC       PIC X(01) VALUE PLAIN-TEXT.
           03  2S-VOL           PIC X(06) VALUE SPACES.
           03  2S-PP-PW-FAC     PIC X(01) VALUE BLANK-PRO.
           03  2S-PP-PW         PIC X(08) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  2S-PP-SC-FAC     PIC X(01) VALUE PLAIN-TEXT.
           03  2S-PP-SC         PIC X(01) VALUE SPACES.
           03  FILLER           PIC X(02) VALUE PLAIN-TEXT.
           03  2S-DHK-FAC       PIC X(01) VALUE PLAIN-TEXT.
           03  2S-DHK           PIC X(01) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  2S-QRC-FAC       PIC X(01) VALUE PLAIN-TEXT.
           03  2S-QRC           PIC X(03) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  2S-SLP-FAC       PIC X(01) VALUE PLAIN-TEXT.
           03  2S-SLP           PIC X(01) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
           03  2S-PP-PAROPT-FAC PIC X(01) VALUE PLAIN-TEXT.
           03  2S-PP-PAR-OPT    PIC X(16) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.
       01  AA-MENU.
           03  FILLER           PIC X(23) VALUE SPACES.
           03  FILLER           PIC X(18) VALUE "Security Classes =".
           03  2S-SC-FAC        PIC X(01) VALUE PLAIN-TEXT.
           03  2S-SCLASSES      PIC X(16) VALUE SPACES.
           03  FILLER           PIC X(01) VALUE PLAIN-TEXT.

       01  MDM-MENU-TABLE.
           03  MDM-ITEM     OCCURS 200 TIMES.
               05  MDM-MENU-ID           PIC X(06) VALUE SPACES.
               05  MDM-MENU-ID-STR REDEFINES MDM-MENU-ID.
                   07  MDM-ID-CHAR    OCCURS 6 TIMES.
                       10  FILLER       PIC X(01).
               05  MDM-MENU-TITLE        PIC X(40) VALUE SPACES.

       01  DISPLAY-SCN-TABLE.
           03  DISP-SCN-ITEM     OCCURS 9 TIMES.
               05  D-SCN-ROW    PIC X(01) VALUE A-0-BYTE.
               05  D-SCN-COL    PIC X(01) VALUE A-0-BYTE.

       01  SCN-INDEX            BINARY    VALUE ZEROES.

       01  RV-TABLE.
           03  RUNTIME-SELECTION    OCCURS 250 TIMES.
               05  RVSEQ             PIC X(03)  VALUE SPACES.
               05  RVLABEL           PIC X(05)  VALUE SPACES.
               05  RVDESCRIPTION     PIC X(40)  VALUE SPACES.
               05  RVFILE            PIC X(08)  VALUE SPACES.
               05  RVLIB             PIC X(08)  VALUE SPACES.
               05  RVVOL             PIC X(06)  VALUE SPACES.
               05  RVMOD             PIC X(01)  VALUE SPACES.

      *******************************************************************
      *              WSXIO PARAMETERS                                   *
      *******************************************************************
       01  WSXIO-FUNCTION PIC X     VALUE SPACES.
       01  WSXIO-UFB      PIC X(02) VALUE SPACES.
       01  WSXIO-CMD      PIC X.
       01  WSXIO-ORDER-AREA.
           03  WSXIO-O-A-1 PIC X VALUE A-1-BYTE.
           03  WSXIO-O-A-2 PIC X VALUE A-0-BYTE.
           03  WSXIO-O-A-3 PIC X VALUE A-0-BYTE.
           03  WSXIO-O-A-4 PIC X VALUE A-0-BYTE.
       01  WSXIO-OA-SAVE PIC X(4).
       01  WSXIO-O-A-LENGTH.
           05  O-A-L1 BINARY VALUE 0.
           05  O-A-L2 BINARY VALUE 4.
       01  WSXIO-SCREEN-LENGTH.
           05  S1-LEN BINARY VALUE 0.
           05  S2-LEN BINARY VALUE 1920.
       01  WSXIO-TIMEOUT-SEC.
           05  WSXIO-TO1  BINARY VALUE 0.
           05  WSXIO-TO2  BINARY VALUE 0.
       01  WSXIO-TIMEOUT-HSEC.
           05  WSXIO-TOH1  BINARY VALUE 0.
           05  WSXIO-TOH2  BINARY VALUE 0.
       01  WSXIO-IOSW    PIC X(08) VALUE SPACES.
       01  WSXIO-AID     PIC X(01) VALUE SPACES.
       01  WSXIO-ERROR-FLAG     PIC X(01) VALUE "N".
           88  WSXIO-ERROR                VALUE "Y".
           88  WSXIO-NOERROR              VALUE "N".
       01  WSXIO-PROMPT-SCREEN.
           03  FILLER        PIC X(10) VALUE "    MENU =".
           03  FILLER        PIC X(01) VALUE BR-MOD-UCL. 
           03  ENTER-MENU-ID PIC X(06) VALUE SPACES.
           03  MENU-ID-STRING REDEFINES ENTER-MENU-ID.
               05  ID-CHAR     OCCURS 6 TIMES.
                   07  FILLER           PIC X(01).
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(62) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(03) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE UNDER-TEXT. 
           03  PROMPT-HELP-1 PIC X(65) VALUE
               "Specify Menu ID and Press (RETURN) to Position Display o 
      -         "r Select:".
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(10) VALUE SPACES.

           03  FILLER        PIC X(04) VALUE SPACES.
           03  PROMPT-HELP-2 PIC X(65) VALUE
               "1-Return to Menu List                                 
      -        "  13-Help".
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(10) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

       01  WSXIO-CREATE-SCREEN.
           03  FILLER        PIC X(11) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE UNDER-TEXT. 
           03  CREATE-HELP-1 PIC X(49) VALUE
               "Specify the Menu to be Created and Press (RETURN)".
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(22) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(10) VALUE SPACES.
           03  FILLER        PIC X(06) VALUE
               "Menu =".
           03  FILLER        PIC X(01) VALUE BR-MOD-UCL. 
           03  CREATE-MENU-ID   PIC X(06) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(07) VALUE
               "TITLE =".
           03  FILLER        PIC X(01) VALUE BR-MOD-ALL. 
           03  CREATE-MENU-TITLE PIC X(40) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(07) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(10) VALUE SPACES.
           03  CREATE-HELP-2 PIC X(50) VALUE
               "or Select: 1-Cancel Request and Respecify Function".
           03  FILLER        PIC X(20) VALUE SPACES.

       01  WSXIO-DELETE-SCREEN.
           03  FILLER        PIC X(10) VALUE SPACES.
           03  FILLER        PIC X(07) VALUE
               "ALERT  ".
           03  FILLER        PIC X(01) VALUE UNDER-TEXT. 
           03  DELETE-HELP-1 PIC X(44) VALUE
               "Press (RETURN) to Delete this Menu From File".
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(07) VALUE
               "  ALERT".
           03  FILLER        PIC X(10) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(10) VALUE SPACES.
           03  DELETE-HELP-2 PIC X(50) VALUE
               "or Select: 1-Cancel Request and Respecify Function".
           03  FILLER        PIC X(20) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

       01  WSXIO-SAVE-NEW-SCREEN.
           03  FILLER        PIC X(15) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE UNDER-TEXT. 
           03  SAVEN-HELP-1  PIC X(33) VALUE
               "Press (RETURN) to Create New Menu".
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(30) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(24) VALUE SPACES.
           03  FILLER        PIC X(06) VALUE
               "MENU =".
           03  SAVE-ID-FAC   PIC X(01) VALUE PLAIN-TEXT. 
           03  SAVE-MENU-ID  PIC X(06) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(42) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(10) VALUE SPACES.
           03  SAVEN-HELP-2  PIC X(55) VALUE
             "or Select: 1-Respecify Function      9-Modify Menu Name".
           03  FILLER        PIC X(20) VALUE SPACES.

       01  WSXIO-SAVE-NEW-EXISTING-SCREEN.
           03  FILLER        PIC X(09) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE UNDER-TEXT. 
           03  EXISTING-HELP-1    PIC X(59) VALUE
               "Specify the Menu Name and press (RETURN) to Create New M
      -        "enu".
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(10) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(24) VALUE SPACES.
           03  FILLER        PIC X(06) VALUE
               "MENU =".
           03  SAVE-EID-FAC  PIC X(01) VALUE BR-MOD-UCL. 
           03  SAVE-EMENU-ID PIC X(06) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(42) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(10) VALUE SPACES.
           03  EXISTING-HELP-2 PIC X(31) VALUE
             "or Select: 1-Respecify Function".
           03  FILLER        PIC X(39) VALUE SPACES.

       01  WSXIO-MAINTAIN-SCREEN.
           03  WSXIO-MAINTAIN-MESSAGE   PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(05) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE UNDER-TEXT. 
           03  MAIN-HELP-1   PIC X(52) VALUE
               "Specify the Menu to be Maintained and Press (RETURN)".
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(21) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(28) VALUE SPACES.
           03  FILLER        PIC X(06) VALUE
               "MENU =".
           03  FILLER        PIC X(01) VALUE BR-MOD-UCL. 
           03  MAIN-MENU-ID  PIC X(06) VALUE SPACES.
           03  FILLER        PIC X(01) VALUE PLAIN-TEXT.
           03  FILLER        PIC X(38) VALUE SPACES.

           03  FILLER    PIC X(80) VALUE SPACES.

           03  FILLER        PIC X(06) VALUE SPACES.
           03  MAIN-HELP-2   PIC X(50) VALUE
               "or Select: 1-Cancel Request and Respecify Function".
           03  FILLER        PIC X(24) VALUE SPACES.

       01  WSXIO-AMUES112-SCREEN.
           03  WSXIO-AMUES112-HEADER.
               05  AMUES112-1-1  PIC X(08)  VALUE SPACES.
               05  FILLER        PIC X(16)  VALUE SPACES.
               05  AMUES112-1-2  PIC X(31)  VALUE SPACES.
               05  FILLER        PIC X(17)  VALUE SPACES.
               05  FILLER        PIC X(08)  VALUE "AMUES112".

               05  FILLER        PIC X(28)  VALUE SPACES.
               05  FILLER        PIC X(01)  VALUE UNDER-TEXT. 
               05  FILLER        PIC X(21)  VALUE
                   "Window Specifications".                           
               05  FILLER        PIC X(01) VALUE PLAIN-TEXT.
               05  FILLER        PIC X(17) VALUE SPACES.                  
               05  FILLER        PIC X(01) VALUE UNDER-TEXT.
               05  AMUES112-2    PIC X(12) VALUE SPACES.

               05  FILLER        PIC X(01) VALUE UNDER-TEXT.
               05  FILLER        PIC X(79) VALUE SPACES.
           03  AMUES112-SCROLL-AREA.
               05  AMUES112-4   OCCURS 17 TIMES.
                   07  AMUES112-4-FAC  PIC X(01) VALUE PLAIN-TEXT.
                   07  AMUES112-4-ROW  PIC X(79) VALUE SPACES.
           03  AMUES112-HELP-AREA.
               05  AMUES112-21   OCCURS 4 TIMES.
                   07  AMUES112-21-FAC   PIC X(01) VALUE PLAIN-TEXT.
                   07  AMUES112-21-VALUE PIC X(79) VALUE SPACES.

       01  SCREEN-TITLE-WINDOW.
           03  TITLE-WINDOW              PIC 9(02) VALUE 2.
           03  SCN-TITLE-ROW  OCCURS 8 TIMES.
               05  SCN-TITLE-FAC         PIC X(01) VALUE PLAIN-TEXT.
               05  SCN-TITLE-VALUE       PIC X(79) VALUE SPACES.
       01  CURSOR-INST-WINDOW1.
           03  CUR-INST-WIN1             PIC 9(02) VALUE 5.
           03  CUR-INST-ROW1  OCCURS 8 TIMES.
               05  CUR-INST-FAC1         PIC X(01) VALUE PLAIN-TEXT.
               05  CUR-INST-VALUE1       PIC X(79) VALUE SPACES.
       01  CURSOR-INST-WINDOW2.
           03  CUR-INST-WIN2             PIC 9(02) VALUE 5.
           03  CUR-INST-ROW2  OCCURS 8 TIMES.
               05  CUR-INST-FAC2         PIC X(01) VALUE PLAIN-TEXT.
               05  CUR-INST-VALUE2       PIC X(79) VALUE SPACES.
       01  PFKEY-INST-WINDOW1.
           03  PFKEY-INS-WIN1            PIC 9(02) VALUE 17.
           03  PFKEY-INST-ROW1  OCCURS 8 TIMES.
               05  PFKEY-INST-FAC1       PIC X(01) VALUE PLAIN-TEXT.
               05  PFKEY-INST-VALUE1     PIC X(79) VALUE SPACES.
       01  PFKEY-INST-WINDOW2.
           03  PFKEY-INS-WIN2            PIC 9(02) VALUE 17.
           03  PFKEY-INST-ROW2  OCCURS 8 TIMES.
               05  PFKEY-INST-FAC2       PIC X(01) VALUE PLAIN-TEXT.
               05  PFKEY-INST-VALUE2     PIC X(79) VALUE SPACES.
       01  MESSAGE-WINDOW.
           03  MESSAGE-WIN               PIC 9(02) VALUE 29.
           03  MESS-WIN-ROW     OCCURS 2 TIMES.
               05  MESS-WIN-FAC          PIC X(01) VALUE PLAIN-TEXT.
               05  MESS-WIN-VALUE        PIC X(79) VALUE SPACES.

       01  WS-SCREEN-TABLE.
           03  WS-SCN-ITEM    OCCURS 29 TIMES.
               05  WS-SCN-FAC             PIC X(01) VALUE SPACES.
               05  WS-SCN-VALUE           PIC X(78) VALUE SPACES.

       01  EXT-FUNC-TYPE         PIC X(02)   VALUE SPACES.
       01  EXT-USER-ID           PIC X(03)   VALUE SPACES.

      *******************************************************************

       LINKAGE SECTION.

       01  LINK-MENU-FILE         PIC X(08).
       01  LINK-MENU-LIB          PIC X(08).
       01  LINK-MENU-VOL          PIC X(06).
       01  LINK-MENU-ACCESS       PIC X(06).

000001/*****************************************************************
000001*                                                                *
000001*                         PROCEDURE DIVISION                     *
000001*                                                                *
000001******************************************************************
000001*                                        
000001 PROCEDURE DIVISION USING LINK-MENU-FILE, LINK-MENU-LIB,
                                LINK-MENU-VOL, LINK-MENU-ACCESS.
       START-PROGRAM.
           PERFORM INITIALIZATION.
           PERFORM LOAD-INSTALL-DEFAULTS.
           MOVE "CD" TO FDR-FUNCTION.
           CALL "READFDR" USING LINK-MENU-FILE, LINK-MENU-LIB,
                                LINK-MENU-VOL,
                                FDR-MODE, FDR-FUNCTION,
                                FDR-RECEIVER, FDR-RETURN-CODE.
           MOVE LINK-MENU-ACCESS TO CUR-ACCESS.
           MOVE LINK-MENU-FILE TO FIL-FOR-MFILE.
           MOVE LINK-MENU-LIB  TO LIB-FOR-MFILE.
           MOVE LINK-MENU-VOL  TO VOL-FOR-MFILE.
           IF FDR-RETURN-2 NOT = 0
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM FILE-OPTIONS-DEFAULTS-MENU THRU
                 EXIT-FILE-OPTS-DEFS-MENU.
           OPEN SHARED MENU-FILE.
           MOVE SPACES TO MFILE-KEY
           PERFORM MENU-DEF-MAINT-MENU THRU
                 EXIT-MENU-DEF-MAINT-MENU.
           CLOSE MENU-FILE.

000001 EXIT-PROGRAM.
000001     EXIT PROGRAM.
000001
000001 STOP-RUN.
000001     STOP RUN.

       INITIALIZATION.
           ACCEPT WSA-NTIME FROM TIME. 
      *    ACCEPT WSA-NDATE FROM DATE.
           CALL "DATE2" USING HG, DATE-CCYYMMDD.
           MOVE DATE-MM TO FORMAT-DATE-1.
           MOVE "-" TO DATE-SEPARATOR-1,
                       DATE-SEPARATOR-2.
           MOVE DATE-DD TO FORMAT-DATE-2.
           MOVe DATE-YY TO FORMAT-DATE-3.
           MOVE "ID" TO EXT-FUNC-TYPE.
           CALL "EXTRACT" USING EXT-FUNC-TYPE, EXT-USER-ID.

       MENU-DEF-MAINT-MENU.
           MOVE 1 TO SCN-INDEX.
           MOVE UNDER-TEXT TO FAC OF AMUEM100-1, FAC OF AMUEM100-2.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE TEMP-OA TO ORDER-AREA OF AMUEM100-SCREEN.

           DISPLAY AND READ AMUEM100-SCREEN ON CRT
           PFKEYS 16, 32.

           PERFORM SAVE-OA-ROW-COL.

           IF PF-KEY = "16" THEN
               MOVE 0 TO MOD-ROW,
                         MOD-COL
               PERFORM SAVE-OA-ROW-COL
               GO TO EXIT-MENU-DEF-MAINT-MENU
           ELSE
           IF PF-KEY = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 6 AND ACCESS-UPDATE THEN
               PERFORM PROMPT-CREATE-MENU-ID THRU
                       EXIT-PROMPT-CREATE-MENU-ID
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 7 THEN
               MOVE SPACES TO WSXIO-MAINTAIN-MESSAGE
               MOVE "N" TO WSXIO-ERROR-FLAG
               PERFORM PROMPT-MAINTAIN-MENU-ID THRU
                       EXIT-PROMPT-MAINTAIN-MENU-ID
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 8 THEN
               PERFORM LIST-ALL-MENUS
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 9 THEN
               PERFORM FILE-OPTIONS-DEFAULTS-MENU THRU
                 EXIT-FILE-OPTS-DEFS-MENU
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 10 AND ACCESS-UPDATE THEN
               DISPLAY "Copy Menu From Another File NOT SUPPORTED"
           ELSE
               CALL "BELL" USING BELL-TIME.

           GO TO MENU-DEF-MAINT-MENU.

       EXIT-MENU-DEF-MAINT-MENU.
           EXIT.

       FILE-OPTIONS-DEFAULTS-MENU.
           MOVE 2 TO SCN-INDEX.
           MOVE UNDER-TEXT TO FAC OF AMUEM110-1, FAC OF AMUEM110-2.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE TEMP-OA TO ORDER-AREA OF AMUEM110-SCREEN.

           DISPLAY AND READ AMUEM110-SCREEN ON CRT
           PFKEYS 16, 32.

           PERFORM SAVE-OA-ROW-COL.

           IF PF-KEY = "16" THEN
               MOVE 0 TO MOD-ROW,
                         MOD-COL
               PERFORM SAVE-OA-ROW-COL
               GO TO EXIT-FILE-OPTS-DEFS-MENU
           ELSE
           IF PF-KEY = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 6 THEN
               PERFORM FILE-OPTIONS-ROUTINE
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 7 THEN
               PERFORM WINDOW-SPECS-ROUTINE
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 8 THEN
               PERFORM DEF-MENU-OPTIONS-ROUTINE
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 9 THEN
               PERFORM RUNTIME-VARS-ROUTINE
           ELSE
               CALL "BELL" USING BELL-TIME.

           GO TO FILE-OPTIONS-DEFAULTS-MENU.

       EXIT-FILE-OPTS-DEFS-MENU.
           EXIT.

       FILE-OPTIONS-ROUTINE.
           PERFORM SET-FO-FACS.
           MOVE SPACES TO MFILE-KEY.
           MOVE "MD" TO RECORD-TYPE.
           MOVE LOW-VALUES TO MENU-ID.
           MOVE "FO" TO MRECORD-DEF.
           PERFORM READ-MENU-FILE-RECORD.
           MOVE MFILE-REST-OF-RECORD TO FILE-OPTIONS-RECORD.
           PERFORM DISPLAY-FO-SCREEN THRU EXIT-DISPLAY-FO-SCREEN.

       DISPLAY-FO-SCREEN.
           MOVE 3 TO SCN-INDEX.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE TEMP-OA TO ORDER-AREA OF AMUES111-SCREEN.
           MOVE "Y" TO CHANGED-FLAG.

           DISPLAY AND READ AMUES111-SCREEN ON CRT
           PFKEYS 1, 2, 3, 9, 15, 16, 32
           NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF MADE-CHANGES
               MOVE "Y" TO RECORD-STAT.
           PERFORM SAVE-OA-ROW-COL.

           IF PF-KEY = "16" AND ACCESS-BROWSE THEN
               IF MFILE-REST-OF-RECORD NOT = FILE-OPTIONS-RECORD
                   MOVE "WARNING" TO CUR-ACCESS
                   PERFORM PROMPT-PFKEY-FUNC
               ELSE
                   MOVE "BROWSE" TO CUR-ACCESS
                   MOVE "N" TO RECORD-STAT
                   MOVE "Y" TO DEFAULT-STAT 
                   MOVE 0 TO MOD-ROW,
                             MOD-COL
                   PERFORM SAVE-OA-ROW-COL
                   GO TO EXIT-DISPLAY-FO-SCREEN
               END-IF
           ELSE
           IF PF-KEY = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF PF-KEY = "00" AND ACCESS-WARNING THEN
               MOVE "BROWSE" TO CUR-ACCESS
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT 
               GO TO EXIT-DISPLAY-FO-SCREEN
           ELSE
           IF PF-KEY = "00" AND ACCESS-DEFAULT THEN
      *  Move FO-INSTALL-DEFAULTS to current
               MOVE "N" TO DEFAULT-STAT
               MOVE "Y" TO RECORD-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-FO-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-RESTORE THEN                        
               MOVE MFILE-REST-OF-RECORD TO FILE-OPTIONS-RECORD
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-FO-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-SAVE THEN
               PERFORM READ-MENU-FILE-RECORD-HOLD
               MOVE FILE-OPTIONS-RECORD TO MFILE-REST-OF-RECORD
               PERFORM REWRITE-MENU-FILE-RECORD
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-FO-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-UPDATE THEN
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-FO-FACS
           ELSE
           IF PF-KEY = "01" AND NOT ACCESS-BROWSE THEN
               IF ACCESS-UPDATE
                   MOVE MFILE-REST-OF-RECORD TO FILE-OPTIONS-RECORD
                   MOVE "N" TO RECORD-STAT
               END-IF
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-FO-FACS
           ELSE
           IF PF-KEY = "02" AND ACCESS-BROWSE THEN
               MOVE "DEFAULT" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
           IF PF-KEY = "03" AND ACCESS-BROWSE THEN
               MOVE "RESTORE" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
           IF PF-KEY = "09" AND ACCESS-BROWSE THEN
               MOVE "UPDATE" TO CUR-ACCESS
               PERFORM SET-FO-FACS
           ELSE
           IF PF-KEY = "15" AND ACCESS-BROWSE THEN
               MOVE "SAVE" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
               CALL "BELL" USING BELL-TIME.
  
           GO TO DISPLAY-FO-SCREEN.

       EXIT-DISPLAY-FO-SCREEN.
           EXIT.

       SET-FO-FACS.
           IF REC-CHANGED
               MOVE "Modified" TO REC-STAT-TEXT
           ELSE
               MOVE SPACES TO REC-STAT-TEXT.

           MOVE SPACES TO AMUES111-HELP-DEF.
           IF ACCESS-UPDATE THEN
               MOVE BR-MOD-UCL TO HOLD-FAC
               MOVE "Make Changes and Press <RETURN> to Modify File Opti
      -         "ons or" TO AMUES111-HELP(2)
               MOVE "Select:" TO AMUES111-HELP(3)
               MOVE "1-Return to Display Mode" TO AMUES111-HELP(4)
               MOVE UNDER-TEXT TO FAC OF AMUES111-21-ROW(2),
                                  FAC OF AMUES111-21-ROW(3)
               MOVE " Modify Mode" TO SCN-MODE
           ELSE
               MOVE PLAIN-TEXT TO HOLD-FAC
               IF DIFF-DEFAULTS
                   STRING PF2, "                                        
      -                   "                   ", PF16 DELIMITED BY SIZE
                  INTO AMUES111-HELP(3)
               ELSE
                   STRING "                                        
      -                   "                         ", PF16 DELIMITED
                      BY SIZE INTO AMUES111-HELP(3)
               END-IF
               IF REC-CHANGED
                   STRING PF3,"                  ", PF9, "            ",
                          PF13, PF15
                       DELIMITED BY SIZE INTO AMUES111-HELP(4)
               ELSE
                   STRING "                             ",
                          PF9, "            ", PF13
                       DELIMITED BY SIZE INTO AMUES111-HELP(4)
               END-IF
               MOVE "Display Mode" TO SCN-MODE.

           MOVE HOLD-FAC TO FAC OF AMUES111-5-1, FAC OF AMUES111-5-2,
                            FAC OF AMUES111-5-3, FAC OF AMUES111-5-4, 
                            FAC OF AMUES111-5-5, FAC OF AMUES111-5-6,
                            FAC OF AMUES111-6-1, FAC OF AMUES111-6-2,
                            FAC OF AMUES111-6-3, FAC OF AMUES111-6-4,
                            FAC OF AMUES111-6-5, FAC OF AMUES111-6-6,
                            FAC OF AMUES111-7-1, FAC OF AMUES111-7-2,
                            FAC OF AMUES111-7-3, FAC OF AMUES111-8-1,
                            FAC OF AMUES111-8-2, FAC OF AMUES111-8-3,
                            FAC OF AMUES111-9-1, FAC OF AMUES111-9-2,
                            FAC OF AMUES111-9-3, FAC OF AMUES111-9-4,
                            FAC OF AMUES111-10-1, FAC OF AMUES111-11-1,
                            FAC OF AMUES111-12-2, FAC OF AMUES111-16-2,
                            FAC OF AMUES111-17-2, FAC OF AMUES111-18-2,
                            FAC OF AMUES111-19-2.

           IF ACCESS-UPDATE THEN
               MOVE BLANK-MOD TO HOLD-FAC
           ELSE
               MOVE BLANK-PRO TO HOLD-FAC.

           MOVE HOLD-FAC TO FAC OF AMUES111-12-1, FAC OF AMUES111-13-1,
                            FAC OF AMUES111-16-1, FAC OF AMUES111-17-1,
                            FAC OF AMUES111-18-1, FAC OF AMUES111-19-1.

           MOVE UNDER-TEXT TO FAC OF AMUES111-2-1, FAC OF AMUES111-2-2,
                              FAC OF AMUES111-4-1, FAC OF AMUES111-4-2,
                              FAC OF AMUES111-4-3, FAC OF AMUES111-4-4,
                              FAC OF AMUES111-4-5, FAC OF AMUES111-15-1,
                              FAC OF AMUES111-15-2.

       WINDOW-SPECS-ROUTINE.
           MOVE SPACES TO MFILE-KEY.
           MOVE "MD" TO RECORD-TYPE.
           MOVE LOW-VALUES TO MENU-ID.
           MOVE "WS" TO MRECORD-DEF.
           PERFORM READ-MENU-FILE-RECORD.
           MOVE MFILE-REST-OF-RECORD TO WINDOW-SPECS-WS-RECORD.
           MOVE "WP" TO MRECORD-DEF.
           PERFORM READ-MENU-FILE-RECORD.
           MOVE MFILE-REST-OF-RECORD TO WINDOW-SPECS-WP-RECORD.
           MOVE SPACES TO AMUES112-SCROLL-AREA,
                          WS-SCREEN-TABLE. 
           PERFORM SETUP-WS-TABLE.
           MOVE 1 TO START-ROW,
                     SUB1.
           PERFORM MOVE-WS-TABLE-TO-SCREEN VARYING CNT1 FROM 1 BY 1
               UNTIL CNT1 > 17.
           PERFORM SET-WS-FACS.
           PERFORM DISPLAY-WS-SCREEN THRU EXIT-DISPLAY-WS-SCREEN.

       DISPLAY-WS-SCREEN.
           MOVE 4 TO SCN-INDEX.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.          
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE "Y" TO CHANGED-FLAG.

           MOVE REC-STAT-TEXT  TO AMUES112-1-1.
           MOVE MENU-DEF-TITLE TO AMUES112-1-2.
           MOVE SCN-MODE       TO AMUES112-2.

           MOVE WSXIO-WRITE TO WSXIO-CMD.
           MOVE A-1-BYTE    TO WSXIO-O-A-1.
           MOVE A-160-BYTE  TO WSXIO-O-A-2.
           MOVE A-0-BYTE   TO WSXIO-O-A-3.
           MOVE A-0-BYTE   TO WSXIO-O-A-4.
           MOVE 1920 TO S2-LEN.
           MOVE "X" To WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-AMUES112-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE WSXIO-READ TO WSXIO-CMD.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-AMUES112-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE "A" TO WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB, WSXIO-AID.
           PERFORM SAVE-OA-ROW-COL.

           IF WSXIO-AID = "P" AND ACCESS-BROWSE THEN
               PERFORM TEST-SCN-TABLE-VS-RECORDS THRU
                   EXIT-TEST-WS
               IF WS-NO-MATCH
                   MOVE "WARNING" TO CUR-ACCESS
                   PERFORM PROMPT-PFKEY-FUNC
               ELSE
                   MOVE "BROWSE" TO CUR-ACCESS
                   MOVE "N" TO RECORD-STAT
                   MOVE "Y" TO DEFAULT-STAT 
                   GO TO EXIT-DISPLAY-WS-SCREEN
               END-IF
           ELSE
           IF WSXIO-AID = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF WSXIO-AID = "@" AND ACCESS-WARNING THEN
               MOVE "BROWSE" TO CUR-ACCESS
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT 
               GO TO EXIT-DISPLAY-WS-SCREEN
           ELSE
           IF WSXIO-AID = "@" AND ACCESS-DEFAULT THEN
      *  Move WS-INSTALL-DEFAULTS to current
               MOVE "N" TO DEFAULT-STAT
               MOVE "Y" TO RECORD-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-WS-FACS
           ELSE
           IF WSXIO-AID = "@" AND ACCESS-RESTORE THEN                        
               MOVE SPACES TO AMUES112-SCROLL-AREA,
                              WS-SCREEN-TABLE
               PERFORM SETUP-WS-TABLE
               MOVE 1 TO START-ROW,
                         SUB1
               PERFORM MOVE-WS-TABLE-TO-SCREEN VARYING CNT1 FROM
                 1 BY 1 UNTIL CNT1 > 17
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-WS-FACS
           ELSE
           IF WSXIO-AID = "@" AND ACCESS-SAVE THEN
               PERFORM SETUP-WS-TO-SAVE
               MOVE "WS" TO MRECORD-DEF
               PERFORM READ-MENU-FILE-RECORD-HOLD
               MOVE WINDOW-SPECS-WS-RECORD TO MFILE-REST-OF-RECORD
               PERFORM REWRITE-MENU-FILE-RECORD
               MOVE "WP" TO MRECORD-DEF
               PERFORM READ-MENU-FILE-RECORD-HOLD
               MOVE WINDOW-SPECS-WP-RECORD TO MFILE-REST-OF-RECORD
               PERFORM REWRITE-MENU-FILE-RECORD
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-FO-FACS
           ELSE
           IF WSXIO-AID = "@" AND ACCESS-UPDATE THEN
               MOVE START-ROW TO SUB1
               PERFORM MOVE-SCREEN-TO-WS-TABLE VARYING CNT1 FROM 1
                 BY 1 UNTIL CNT1 > 17
               MOVE "Y" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-WS-FACS
           ELSE
           IF WSXIO-AID = "A" AND NOT ACCESS-BROWSE THEN
               IF ACCESS-UPDATE
                   MOVE "N" TO RECORD-STAT
                   MOVE SPACES TO AMUES112-SCROLL-AREA
                   MOVE START-ROW TO SUB1
                   PERFORM MOVE-WS-TABLE-TO-SCREEN VARYING CNT1 FROM 1
                     BY 1 UNTIL CNT1 > 17
               END-IF
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-WS-FACS
           ELSE
           IF WSXIO-AID = "B" AND ACCESS-BROWSE THEN
               MOVE "DEFAULT" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
           IF WSXIO-AID = "C" AND ACCESS-BROWSE THEN
               MOVE "RESTORE" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
           IF WSXIO-AID = "D" AND ACCESS-BROWSE THEN
               IF START-ROW < 18
                   CALL "BELL" USING BELL-TIME
               ELSE
                   COMPUTE START-ROW = START-ROW - 17
                   MOVE START-ROW TO SUB1
                   MOVE SPACES TO AMUES112-SCROLL-AREA
                   PERFORM MOVE-WS-TABLE-TO-SCREEN VARYING CNT1 FROM
                     1 BY 1 UNTIL CNT1 > 17
               END-IF
           ELSE
           IF WSXIO-AID = "E" AND ACCESS-BROWSE THEN
               IF START-ROW > 12
                   CALL "BELL" USING BELL-TIME
               ELSE
                   COMPUTE START-ROW = START-ROW + 17
                   MOVE START-ROW TO SUB1
                   MOVE SPACES TO AMUES112-SCROLL-AREA
                   PERFORM MOVE-WS-TABLE-TO-SCREEN VARYING CNT1 FROM
                     1 BY 1 UNTIL CNT1 > 17
               END-IF
           ELSE
           IF WSXIO-AID = "F" AND ACCESS-BROWSE THEN
               IF START-ROW < 18
                   CALL "BELL" USING BELL-TIME
               ELSE
                 SUBTRACT 1 FROM START-ROW
                 MOVE START-ROW TO SUB1
                 MOVE SPACES TO AMUES112-SCROLL-AREA
                 PERFORM MOVE-WS-TABLE-TO-SCREEN VARYING CNT1 FROM 1
                   BY 1 UNTIL CNT1 > 17
               END-IF
           ELSE
           IF WSXIO-AID = "G" AND ACCESS-BROWSE THEN
               IF START-ROW > 12
                   CALL "BELL" USING BELL-TIME
               ELSE
                 ADD 1 TO START-ROW
                 MOVE START-ROW TO SUB1
                 MOVE SPACES TO AMUES112-SCROLL-AREA
                 PERFORM MOVE-WS-TABLE-TO-SCREEN VARYING CNT1 FROM 1
                   BY 1 UNTIL CNT1 > 17
               END-IF
           ELSE
           IF WSXIO-AID = "I" AND ACCESS-BROWSE THEN
               MOVE "UPDATE" TO CUR-ACCESS
               PERFORM SET-WS-FACS
           ELSE
           IF WSXIO-AID = "J" AND ACCESS-UPDATE THEN
               PERFORM CHANGE-SEQUENCE-OF-WINDOWS
           ELSE
           IF WSXIO-AID = "K" AND ACCESS-UPDATE THEN
               PERFORM INSERT-WS-ROW
           ELSE
           IF WSXIO-AID = "L" AND ACCESS-UPDATE THEN
               PERFORM DELETE-WS-ROW
           ELSE
           IF WSXIO-AID = "O" AND ACCESS-BROWSE THEN
               MOVE "SAVE" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
               CALL "BELL" USING BELL-TIME.

           GO TO DISPLAY-WS-SCREEN.

       EXIT-DISPLAY-WS-SCREEN.
           EXIT.

       SETUP-WS-TABLE.
           IF ACCESS-UPDATE
               MOVE BR-MOD-ALL TO HOLD-FAC
           ELSE
               MOVE PLAIN-TEXT TO HOLD-FAC.

           MOVE "                      Screen Title Window: Rows 01 thru 
      -        " 02                      " TO WS-SCN-VALUE(1).
           MOVE UNDER-TEXT TO WS-SCN-FAC(1).
           MOVE SCN-TITLE(1) TO WS-SCN-VALUE(2).
           MOVE HOLD-FAC TO WS-SCN-FAC(2).
           MOVE SCN-TITLE(2) TO WS-SCN-VALUE(3).
           IF ACCESS-UPDATE
               MOVE HOLD-FAC TO WS-SCN-FAC(3)
           ELSE
               MOVE UNDER-TEXT TO WS-SCN-FAC(3).
           STRING "16=", PLAIN-TEXT, CURSOR-INSTRUCT-1-PF16,
                  "      Cursor Instruction Window 1: Rows 03 thru 07",      
                  "        32=", PLAIN-TEXT, CURSOR-INSTRUCT-1-PF32
               DELIMITED BY SIZE INTO WS-SCN-VALUE(4).
           MOVE UNDER-TEXT TO WS-SCN-FAC(4).
           MOVE CI-WINDOW-1(1) TO WS-SCN-VALUE(5).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(5).
           MOVE CI-WINDOW-1(2) TO WS-SCN-VALUE(6).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(6).
           MOVE CI-WINDOW-1(3) TO WS-SCN-VALUE(7).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(7).
           MOVE CI-WINDOW-1(4) TO WS-SCN-VALUE(8).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(8).
           MOVE CI-WINDOW-1(5) TO WS-SCN-VALUE(9).
           MOVE UNDER-TEXT TO WS-SCN-FAC(9).
           STRING "16=", CURSOR-INSTRUCT-2-PF16
                  "      Cursor Instruction Window 2: Rows 03 thru 07",
                  "        32=", PLAIN-TEXT, CURSOR-INSTRUCT-2-PF32
               DELIMITED BY SIZE INTO WS-SCN-VALUE(10).
           MOVE UNDER-TEXT TO WS-SCN-FAC(10).
           MOVE CI-WINDOW-2(1) TO WS-SCN-VALUE(11).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(11).
           MOVE CI-WINDOW-2(2) TO WS-SCN-VALUE(12).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(12).
           MOVE CI-WINDOW-2(3) TO WS-SCN-VALUE(13).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(13).
           MOVE CI-WINDOW-2(4) TO WS-SCN-VALUE(14).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(14).
           MOVE CI-WINDOW-2(5) TO WS-SCN-VALUE(15).
           MOVE UNDER-TEXT TO WS-SCN-FAC(15).
           MOVE "                 PFKEYS Instruction Window 1: Rows 03 t
      -        "hru 07                  " TO WS-SCN-VALUE(16).
           MOVE UNDER-TEXT TO WS-SCN-FAC(16).
           MOVE PFI-WINDOW-1(1) TO WS-SCN-VALUE(17).
           MOVE UNDER-TEXT TO WS-SCN-FAC(17).
           MOVE PFI-WINDOW-1(2) TO WS-SCN-VALUE(18).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(18).
           MOVE PFI-WINDOW-1(3) TO WS-SCN-VALUE(19).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(19).
           MOVE PFI-WINDOW-1(4) TO WS-SCN-VALUE(20).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(20).
           MOVE PFI-WINDOW-1(5) TO WS-SCN-VALUE(21).
           MOVE UNDER-TEXT TO WS-SCN-FAC(21).
           MOVE "                 PFKEYS Instruction Window 2: Rows 03 t
      -         "hru 07                  " TO WS-SCN-VALUE(22).         
           MOVE UNDER-TEXT TO WS-SCN-FAC(22).
           MOVE PFI-WINDOW-2(1) TO WS-SCN-VALUE(23).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(23).
           MOVE PFI-WINDOW-2(2) TO WS-SCN-VALUE(24).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(24).
           MOVE PFI-WINDOW-2(3) TO WS-SCN-VALUE(25).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(25).
           MOVE PFI-WINDOW-2(4) TO WS-SCN-VALUE(26).
           MOVE PLAIN-TEXT TO WS-SCN-FAC(26).
           MOVE PFI-WINDOW-2(5) TO WS-SCN-VALUE(27).
           MOVE UNDER-TEXT TO WS-SCN-FAC(27).
           MOVE "                          Selection Window: Rows 08 thr
      -         "u 23                     " TO WS-SCN-VALUE(28).
           MOVE UNDER-TEXT TO WS-SCN-FAC(28).
           MOVE "                           Message Window: Row 24      
      -         "                         " TO WS-SCN-VALUE(29).
           MOVE UNDER-TEXT TO WS-SCN-FAC(29).

       SETUP-WS-TO-SAVE.
           MOVE WS-SCN-VALUE(2) TO SCN-TITLE(1).
           MOVE WS-SCN-VALUE(3) TO SCN-TITLE(2).
      *     CURSOR-INSTRUCT-1-PF16,
      *     CURSOR-INSTRUCT-1-PF32
           MOVE WS-SCN-VALUE(5) TO CI-WINDOW-1(1).
           MOVE WS-SCN-VALUE(6) TO CI-WINDOW-1(2).
           MOVE WS-SCN-VALUE(7) TO CI-WINDOW-1(3).
           MOVE WS-SCN-VALUE(8) TO CI-WINDOW-1(4).
           MOVE WS-SCN-VALUE(9) TO CI-WINDOW-1(5).
      *     CURSOR-INSTRUCT-2-PF16
      *     CURSOR-INSTRUCT-2-PF32
           MOVE WS-SCN-VALUE(11) TO CI-WINDOW-2(1).
           MOVE WS-SCN-VALUE(12) TO CI-WINDOW-2(2).
           MOVE WS-SCN-VALUE(13) TO CI-WINDOW-2(3).
           MOVE WS-SCN-VALUE(14) TO CI-WINDOW-2(4).
           MOVE WS-SCN-VALUE(15) TO CI-WINDOW-2(5).
           MOVE WS-SCN-VALUE(17) TO PFI-WINDOW-1(1).
           MOVE WS-SCN-VALUE(18) TO PFI-WINDOW-1(2).
           MOVE WS-SCN-VALUE(19) TO PFI-WINDOW-1(3).
           MOVE WS-SCN-VALUE(20) TO PFI-WINDOW-1(4).
           MOVE WS-SCN-VALUE(21) TO PFI-WINDOW-1(5).
           MOVE WS-SCN-VALUE(23) TO PFI-WINDOW-2(1).
           MOVE WS-SCN-VALUE(24) TO PFI-WINDOW-2(2).
           MOVE WS-SCN-VALUE(25) TO PFI-WINDOW-2(3).
           MOVE WS-SCN-VALUE(26) TO PFI-WINDOW-2(4).
           MOVE WS-SCN-VALUE(27) TO PFI-WINDOW-2(5).

       TEST-SCN-TABLE-VS-RECORDS.
           MOVE "Y" TO WS-TEST-RECORD.
           IF WS-SCN-VALUE(2) NOT = SCN-TITLE(1)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(3) NOT = SCN-TITLE(2)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

      *     CURSOR-INSTRUCT-1-PF16,
      *     CURSOR-INSTRUCT-1-PF32

           IF WS-SCN-VALUE(5) NOT = CI-WINDOW-1(1)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(6) NOT = CI-WINDOW-1(2)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(7) NOT = CI-WINDOW-1(3)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(8) NOT = CI-WINDOW-1(4)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(9) NOT = CI-WINDOW-1(5)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

      *     CURSOR-INSTRUCT-2-PF16
      *     CURSOR-INSTRUCT-2-PF32

           IF WS-SCN-VALUE(11) NOT = CI-WINDOW-2(1)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(12) NOT = CI-WINDOW-2(2)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(13) NOT = CI-WINDOW-2(3)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(14) NOT = CI-WINDOW-2(4)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(15) NOT = CI-WINDOW-2(5)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(17) NOT = PFI-WINDOW-1(1)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(18) NOT = PFI-WINDOW-1(2)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(19) NOT = PFI-WINDOW-1(3)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(20) NOT = PFI-WINDOW-1(4)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(21) NOT = PFI-WINDOW-1(5)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(23) NOT = PFI-WINDOW-2(1)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(24) NOT = PFI-WINDOW-2(2)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(25) NOT = PFI-WINDOW-2(3)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(26) NOT = PFI-WINDOW-2(4)
               MOVE "N" TO WS-TEST-RECORD
               GO TO EXIT-TEST-WS.

           IF WS-SCN-VALUE(27) NOT = PFI-WINDOW-2(5)
               MOVE "N" TO WS-TEST-RECORD.

       EXIT-TEST-WS.
           EXIT.

       MOVE-WS-TABLE-TO-SCREEN.
           MOVE WS-SCN-VALUE(SUB1) TO AMUES112-4-ROW(CNT1).
           ADD 1 TO SUB1.

       MOVE-SCREEN-TO-WS-TABLE.
           MOVE AMUES112-4-ROW(CNT1) TO WS-SCN-VALUE(SUB1).
           ADD 1 TO SUB1.

       SET-WS-FACS.
           IF REC-CHANGED
               MOVE "Modified" TO REC-STAT-TEXT
           ELSE
               MOVE SPACES TO REC-STAT-TEXT.

           MOVE SPACES TO AMUES112-HELP-AREA.
           IF ACCESS-UPDATE THEN
               MOVE BR-MOD-ALL TO HOLD-FAC
               MOVE "Make Changes and Press <RETURN> to Modify Window or
      -         " Select:" TO AMUES112-21-VALUE(2)
               MOVE "1-Return to display Mode    9-Center    12-Upper 
      -               "     13-Help" TO AMUES112-21-VALUE(3)
               MOVE "15-Column" TO AMUES112-21-VALUE(4)
               MOVE " Modify Mode" TO SCN-MODE
           ELSE
               MOVE PLAIN-TEXT TO HOLD-FAC
               MOVE "Position Cursor to the Desired Row/Window and Selec
      -             "t:" TO AMUES112-21-VALUE(2)
               IF DIFF-DEFAULTS
                   IF START-ROW > 17
                     STRING PF2, PF4, PF6, "          ", PF10-WS,
                            PF12, "         ", PF16 DELIMITED BY SIZE 
                         INTO AMUES112-21-VALUE(3)
                   ELSE
                     STRING PF2, "           
      -                  "                  ", PF16 DELIMITED BY SIZE 
                         INTO AMUES112-21-VALUE(3)
                   END-IF
               ELSE
                   IF START-ROW > 17
                       STRING "           ", PF4, PF6, "          ",
                              PF10-WS, PF12, "         ", PF16
                              DELIMITED BY SIZE 
                           INTO AMUES112-21-VALUE(3)
                   ELSE
                       STRING "                                       ",
                          PF10-WS, PF12, "         ", PF16
                           DELIMITED BY SIZE INTO AMUES112-21-VALUE(3)
                   END-IF
               END-IF
               IF REC-CHANGED
                 IF START-ROW < 17
                   STRING PF3, PF5, PF7, PF9, PF11, PF13, PF15
                       DELIMITED BY SIZE INTO AMUES112-21-VALUE(4)
                 ELSE 
                   STRING PF3, "                   ", PF9, PF11, PF13,
                          PF15 DELIMITED BY SIZE 
                       INTO AMUES112-21-VALUE(4)
                 END-IF
               ELSE
                   STRING "           ", PF5, PF7, PF9, PF11, PF13,
                       "           " DELIMITED BY SIZE
                 INTO AMUES112-21-VALUE(4)
               END-IF
               MOVE "Display Mode" TO SCN-MODE.

           MOVE UNDER-TEXT TO AMUES112-4-FAC(1),
                              AMUES112-4-FAC(3),
                              AMUES112-4-FAC(4),
                              AMUES112-4-FAC(9),
                              AMUES112-4-FAC(10),
                              AMUES112-4-FAC(15),
                              AMUES112-4-FAC(16),
                              AMUES112-4-FAC(17),
                              AMUES112-21-FAC(2).

           MOVE HOLD-FAC TO AMUES112-4-FAC(2),
                            AMUES112-4-FAC(3),
                            AMUES112-4-FAC(5),
                            AMUES112-4-FAC(6),
                            AMUES112-4-FAC(7),
                            AMUES112-4-FAC(8),
                            AMUES112-4-FAC(9),
                            AMUES112-4-FAC(11),
                            AMUES112-4-FAC(12),
                            AMUES112-4-FAC(13),
                            AMUES112-4-FAC(14),
                            AMUES112-4-FAC(15).

       DEF-MENU-OPTIONS-ROUTINE.
           MOVE SPACES TO MFILE-KEY.
           MOVE "MD" TO RECORD-TYPE.
           MOVE LOW-VALUES TO MENU-ID.
           MOVE "MD" TO MRECORD-DEF.
           PERFORM READ-MENU-FILE-RECORD.
           MOVE MFILE-REST-OF-RECORD TO MENU-OPTS-RECORD.
           MOVE "Default Menu Options" TO MENU-OPTIONS-SCREEN.
           MOVE SPACES TO MOD-LOCK-ON-TEXT,
                          MOD-LOCK-BY-TEXT.
           MOVE "AMUES113" TO SCREEN-NAME.
           PERFORM SET-DMO-FACS.
           PERFORM DISPLAY-DMO-SCREEN THRU EXIT-DISPLAY-DMO-SCREEN.

       DISPLAY-DMO-SCREEN.
           MOVE 5 TO SCN-INDEX.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE TEMP-OA TO ORDER-AREA OF AMUES113-SCREEN.
           MOVE "Y" TO CHANGED-FLAG.

           DISPLAY AND READ AMUES113-SCREEN ON CRT
           PFKEYS 1, 2, 3, 9, 15, 16, 32
           NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF MADE-CHANGES
               MOVE "Y" TO RECORD-STAT.
           PERFORM SAVE-OA-ROW-COL.

           IF SCREEN-NAME = "AMUES113" AND PF-KEY = "16" AND
              ACCESS-BROWSE THEN
               IF MFILE-REST-OF-RECORD NOT = MENU-OPTS-RECORD
                   MOVE "WARNING" TO CUR-ACCESS
                   PERFORM PROMPT-PFKEY-FUNC
               ELSE
                   MOVE "BROWSE" TO CUR-ACCESS
                   MOVE "N" TO RECORD-STAT
                   MOVE "Y" TO DEFAULT-STAT 
                   MOVE 0 TO MOD-ROW,
                             MOD-COL
                   PERFORM SAVE-OA-ROW-COL
                   GO TO EXIT-DISPLAY-DMO-SCREEN
               END-IF
           ELSE
           IF SCREEN-NAME = "AMUES121" AND PF-KEY = "16" AND
              ACCESS-BROWSE THEN
               IF REC-CHANGED OR IS-NEW
                   MOVE "Modified" TO REC-STAT-TEXT
               ELSE
                   MOVE SPACES TO REC-STAT-TEXT
               END-IF
               MOVE 0 TO MOD-ROW,
                         MOD-COL
               PERFORM SAVE-OA-ROW-COL
               GO TO EXIT-DISPLAY-DMO-SCREEN
           ELSE
           IF PF-KEY = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF PF-KEY = "00" AND ACCESS-WARNING THEN
               MOVE "BROWSE" TO CUR-ACCESS
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT 
               GO TO EXIT-DISPLAY-DMO-SCREEN
           ELSE
           IF PF-KEY = "00" AND ACCESS-DEFAULT THEN
      *  Move DMO-INSTALL-DEFAULTS to current
               MOVE "N" TO DEFAULT-STAT
               MOVE "Y" TO RECORD-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-DMO-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-RESTORE THEN                        
               MOVE MFILE-REST-OF-RECORD TO MENU-OPTS-RECORD
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-DMO-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-SAVE THEN
               PERFORM READ-MENU-FILE-RECORD-HOLD
               MOVE MENU-OPTS-RECORD TO MFILE-REST-OF-RECORD
               PERFORM REWRITE-MENU-FILE-RECORD
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-DMO-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-UPDATE THEN
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-DMO-FACS
           ELSE
           IF PF-KEY = "01" AND NOT ACCESS-BROWSE THEN
               IF ACCESS-UPDATE
                   MOVE MFILE-REST-OF-RECORD TO MENU-OPTS-RECORD
                   MOVE "N" TO RECORD-STAT
               END-IF
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-DMO-FACS
           ELSE
           IF SCREEN-NAME = "AMUES113" AND PF-KEY = "02" AND
              ACCESS-BROWSE THEN
               MOVE "DEFAULT" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
           IF SCREEN-NAME = "AMUES113" AND PF-KEY = "03" AND
              ACCESS-BROWSE THEN
               MOVE "RESTORE" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
           IF PF-KEY = "09" AND ACCESS-BROWSE THEN
               MOVE "UPDATE" TO CUR-ACCESS
               PERFORM SET-DMO-FACS
           ELSE
           IF SCREEN-NAME = "AMUES113" AND PF-KEY = "15" AND
              ACCESS-BROWSE THEN
               MOVE "SAVE" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
               CALL "BELL" USING BELL-TIME.
  
           GO TO DISPLAY-DMO-SCREEN.

       EXIT-DISPLAY-DMO-SCREEN.
           EXIT.

       SET-DMO-FACS.
           IF SCREEN-NAME = "AMUES113"
               IF REC-CHANGED
                   MOVE "Modified" TO REC-STAT-TEXT
               ELSE
                   MOVE SPACES TO REC-STAT-TEXT.

           MOVE SPACES TO AMUES113-HELP-DEF.
           IF ACCESS-UPDATE
               MOVE "Modify Mode " TO SCN-MODE
               MOVE BR-MOD-UCL TO HOLD-FAC
               MOVE BR-MOD-ALL TO HOLD-FAC2
               MOVE BR-MOD-ALL TO FAC OF AMUES113-4-2
               STRING "Make Changes and Press (RETURN) to Modify ",
                      MENU-OPTIONS-SCREEN," or" DELIMITED BY SIZE
                 INTO AMUES113-HELP(2)
               MOVE "Select:" TO AMUES113-HELP(3) 
               MOVE UNDER-TEXT TO FAC OF AMUES113-21-ROW(2),
                                  FAC OF AMUES113-21-ROW(3)
               MOVE "1-Return to Display Mode" TO AMUES113-HELP(4)
           ELSE
               IF SCREEN-NAME = "AMUES113"
                 IF DIFF-DEFAULTS
                   STRING PF2, "                                        
      -                   "                   ", PF16 DELIMITED BY SIZE
                     INTO AMUES113-HELP(3)
                 ELSE
                   STRING "                                        
      -                   "                         ", PF16 DELIMITED
                      BY SIZE INTO AMUES113-HELP(3)
                 END-IF
                 IF REC-CHANGED
                   STRING PF3,"                  ", PF9, "            ",
                          PF13, PF15
                       DELIMITED BY SIZE INTO AMUES113-HELP(4)
                 ELSE
                   STRING "                             ",
                          PF9, "            ", PF13
                       DELIMITED BY SIZE INTO AMUES113-HELP(4)
                 END-IF
               ELSE
                 STRING "                                          ",
                      PF9, "    ",PF13,"    ", PF16 DELIMITED BY SIZE
                    INTO AMUES113-HELP(3)
               END-IF

               MOVE "Display Mode" TO SCN-MODE
               MOVE PLAIN-TEXT TO FAC OF AMUES113-4-2
               MOVE BLANK-PRO  TO HOLD-FAC2               
               MOVE PLAIN-TEXT TO HOLD-FAC.

           MOVE UNDER-TEXT TO FAC OF AMUES113-2-1, FAC OF AMUES113-2-2,
                              FAC OF AMUES113-6-1, FAC OF AMUES113-6-2,
                              FAC OF AMUES113-6-3, FAC OF AMUES113-6-4,
                              FAC OF AMUES113-6-5, FAC OF AMUES113-6-6.

           MOVE HOLD-FAC2 TO FAC OF AMUES113-12, FAC OF AMUES113-13-1.

           MOVE HOLD-FAC TO FAC OF AMUES113-4-1, FAC OF AMUES113-4-3,
                            FAC OF AMUES113-7-1, FAC OF AMUES113-7-2,
                            FAC OF AMUES113-7-3, FAC OF AMUES113-7-4,
                            FAC OF AMUES113-7-5, FAC OF AMUES113-7-6,
                            FAC OF AMUES113-8-1, FAC OF AMUES113-8-2,
                            FAC OF AMUES113-8-3, FAC OF AMUES113-8-4,
                            FAC OF AMUES113-8-5, FAC OF AMUES113-8-6,
                            FAC OF AMUES113-9-1, FAC OF AMUES113-9-2,
                            FAC OF AMUES113-9-3, FAC OF AMUES113-11,
                            FAC OF AMUES113-13-2, FAC OF AMUES113-14-1,
                            FAC OF AMUES113-14-2, FAC OF AMUES113-15,
                            FAC OF AMUES113-16,   FAC OF AMUES113-17-1,
                            FAC OF AMUES113-17-2, FAC OF AMUES113-18-1,
                            FAC OF AMUES113-18-2.

       DISPLAY-MS-SCREEN.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE "Y" TO CHANGED-FLAG.

           IF SCN-NUM = 1 AND DEF-MO-FORMAT = "C3"
               MOVE TEMP-OA TO ORDER-AREA OF AMUES122-SCREEN1-C3
               DISPLAY AND READ AMUES122-SCREEN1-C3 ON CRT
               PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
                     14, 16, 32
               NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF SCN-NUM = 1 AND DEF-MO-FORMAT = "P3"
               MOVE TEMP-OA TO ORDER-AREA OF AMUES122-SCREEN1-P3
               DISPLAY AND READ AMUES122-SCREEN1-P3 ON CRT
               PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
                     14, 16, 32
               NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF SCN-NUM = 1 AND DEF-MO-FORMAT = "C2"
               MOVE TEMP-OA TO ORDER-AREA OF AMUES122-SCREEN1-C2
               DISPLAY AND READ AMUES122-SCREEN1-C2 ON CRT
               PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
                     14, 16, 32
               NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF SCN-NUM = 1 AND DEF-MO-FORMAT = "P2"
               MOVE TEMP-OA TO ORDER-AREA OF AMUES122-SCREEN1-P2
               DISPLAY AND READ AMUES122-SCREEN1-P2 ON CRT
               PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
                     14, 16, 32
               NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF SCN-NUM = 1 AND DEF-MO-FORMAT = "C1"
               MOVE TEMP-OA TO ORDER-AREA OF AMUES122-SCREEN1-C1
               DISPLAY AND READ AMUES122-SCREEN1-C1 ON CRT
               PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
                     14, 16, 32
               NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF SCN-NUM = 1 AND DEF-MO-FORMAT = "P1"
               MOVE TEMP-OA TO ORDER-AREA OF AMUES122-SCREEN1-P1
               DISPLAY AND READ AMUES122-SCREEN1-P1 ON CRT
               PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
                     14, 16, 32
               NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF SCN-NUM = 2
               MOVE TEMP-OA TO ORDER-AREA OF AMUES122-SCREEN2
               DISPLAY AND READ AMUES122-SCREEN2 ON CRT
               PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
                     14, 16, 32
               NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF MADE-CHANGES
               MOVE "Y" TO RECORD-STAT.
           IF MOD-ROW < 5
               MOVE 5 TO MOD-ROW
               MOVE 7 TO MOD-COL
           ELSE
             IF MOD-ROW > 19
                 PERFORM SCROLL-UP
                 MOVE 19 TO MOD-ROW
                 MOVE 7 TO MOD-COL
             END-IF
           END-IF
           PERFORM SAVE-OA-ROW-COL.

           IF PF-KEY = "16" AND ACCESS-UPDATE THEN
               MOVE MOD-SEL TO SUB1
               PERFORM LOAD-MSEL-SCREEN
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-MS-FACS
           ELSE
           IF PF-KEY = "16" AND ACCESS-BROWSE THEN
               IF REC-CHANGED
                   MOVE "Modified" TO REC-STAT-TEXT 
               ELSE
                   MOVE SPACES TO REC-STAT-TEXT
               END-IF
               MOVE 0 TO MOD-ROW
                         MOD-COL
               PERFORM SAVE-OA-ROW-COL
               GO TO EXIT-DISPLAY-MS-SCREEN
           ELSE
           IF PF-KEY = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF PF-KEY = "00" AND ACCESS-BROWSE THEN
               IF SCN-NUM = 2 
                   MOVE 1 TO SCN-NUM
               ELSE
                   MOVE 2 TO SCN-NUM
               END-IF
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-MS-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-UPDATE THEN
               IF SCN-NUM = 1 AND CNT1 = (MOD-ROW - 4)
                   PERFORM SAVE-MODIFIED-MSSEL
                   MOVE PLAIN-TEXT TO HOLD-FAC
                   PERFORM SET-SELECTION-LINE-FAC
                   MOVE 2 TO SCN-NUM
               ELSE
                   PERFORM SAVE-MODIFIED-MSSEL
                   IF CNT1 = (MOD-ROW - 4)
                       MOVE PLAIN-TEXT TO HOLD-FAC
                       PERFORM SET-SELECTION-LINE-FAC
                       IF IS-NEW
                           PERFORM INSERT-MENU-SELECTION
                       ELSE
                           ADD 1 TO MOD-ROW
                           PERFORM SAVE-OA-ROW-COL
                       END-IF
                   ELSE
                       MOVE PLAIN-TEXT TO HOLD-FAC
                       PERFORM SET-SELECTION-LINE-FAC
                       MOVE "BROWSE" TO CUR-ACCESS
                   END-IF
                   MOVE 1 TO SCN-NUM
               END-IF
               PERFORM SET-MS-FACS
           ELSE
           IF PF-KEY = "01" AND NOT ACCESS-BROWSE THEN
               IF IS-NEW
                   MOVE SPACES TO MSEL-SCREEN(MOD-ROW - 4)
               END-IF
               IF SCN-NUM = 2
                   MOVE 1 TO SCN-NUM
               ELSE
                   MOVE "BROWSE" TO CUR-ACCESS
               END-IF
               MOVE 0 TO MOD-ROW
                         MOD-COL
               PERFORM SAVE-OA-ROW-COL
               PERFORM SET-MS-FACS
           ELSE
           IF PF-KEY = "02" AND ACCESS-BROWSE THEN
               IF SEL-CNT  = 1
                   CALL "BELL" USING BELL-TIME
               ELSE
                   MOVE SPACES TO AMUES122-MSEL-TABLE
                   MOVE 1 TO SEL-CNT,
                             SUB1
                   PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM 1 BY 1
                       UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-MS-FACS
               END-IF
           ELSE
           IF PF-KEY = "03" AND ACCESS-BROWSE THEN
               IF SEL-CNT  > SEL-MAX - 14
                   CALL "BELL" USING BELL-TIME
               ELSE
                   MOVE SPACES TO AMUES122-MSEL-TABLE
                   COMPUTE SEL-CNT = SEL-MAX - 14
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM 1 BY 1
                       UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-MS-FACS
               END-IF
           ELSE
           IF PF-KEY = "04" AND ACCESS-BROWSE THEN
               IF SEL-CNT = 1
                   CALL "BELL" USING BELL-TIME
               ELSE
                   IF SEL-CNT - 15 < 1
                       MOVE 1 TO SEL-CNT
                   ELSE
                       COMPUTE SEL-CNT = SEL-CNT - 15
                   END-IF
                   MOVE SPACES TO AMUES122-MSEL-TABLE
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM
                       1 BY 1 UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-MS-FACS
               END-IF
           ELSE
           IF PF-KEY = "05" AND ACCESS-BROWSE THEN
               IF SEL-CNT + 15 >= SEL-MAX
                   CALL "BELL" USING BELL-TIME
               ELSE
                   IF SEL-MAX - 15 > SEL-CNT
                       COMPUTE SEL-CNT = SEL-MAX - 15
                   ELSE
                       COMPUTE SEL-CNT = SEL-CNT + 15
                   END-IF
                   MOVE SPACES TO AMUES122-MSEL-TABLE
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM
                       1 BY 1 UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-MS-FACS
               END-IF
           ELSE
           IF PF-KEY = "06" AND ACCESS-BROWSE THEN
               IF SEL-CNT - 1 < 1
                   CALL "BELL" USING BELL-TIME
               ELSE
                   SUBTRACT 1 FROM SEL-CNT
                   MOVE SPACES TO AMUES122-MSEL-TABLE
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM
                       1 BY 1 UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-MS-FACS
               END-IF
           ELSE
           IF PF-KEY = "07" AND ACCESS-BROWSE THEN
               IF SEL-CNT + 15 > SEL-MAX
                   CALL "BELL" USING BELL-TIME
               ELSE
                   ADD 1 TO SEL-CNT
                   MOVE SPACES TO AMUES122-MSEL-TABLE
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM
                       1 BY 1 UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-MS-FACS
               END-IF
           ELSE
           IF PF-KEY = "08" AND ACCESS-BROWSE THEN
               DISPLAY "Position NOT SUPPORTED"
           ELSE
           IF PF-KEY = "09" AND ACCESS-BROWSE AND SEL-MAX > 0 THEN
               MOVE "UPDATE" TO CUR-ACCESS
               PERFORM SET-MS-FACS
           ELSE
           IF PF-KEY = "10" AND ACCESS-BROWSE THEN
               DISPLAY "Renumber NOT SUPPORTED"
           ELSE
           IF PF-KEY = "11" AND ACCESS-BROWSE THEN
               PERFORM INSERT-MENU-SELECTION
               MOVE "UPDATE" TO CUR-ACCESS
               PERFORM SET-MS-FACS
           ELSE
           IF PF-KEY = "12" AND ACCESS-BROWSE THEN
               PERFORM DELETE-MENU-SELECTION
               PERFORM SET-MS-FACS
           ELSE
           IF PF-KEY = "14" AND ACCESS-BROWSE THEN
               DISPLAY "Move NOT SUPPORTED"
           ELSE
               CALL "BELL" USING BELL-TIME.
  
           GO TO DISPLAY-MS-SCREEN.

       EXIT-DISPLAY-MS-SCREEN.
           EXIT.

       INSERT-MENU-SELECTION.
           IF SEL-MAX = 0
               MOVE 1 TO SEL-CNT,
                         CNT1,
                         MOD-SEL
               MOVE SPACES TO MENU-SELECTION(CNT1)
               MOVE "020" TO TSEQ(CNT1)
               MOVE "+1"  TO TPOSN(CNT1)
               MOVE 5 TO MOD-ROW
           ELSE
             IF SEL-CNT > (SEL-MAX - 15) AND MOD-ROW > 19
                 COMPUTE MOD-SEL = SEL-MAX + 1
                 ADD 1 TO SEL-CNT
                 MOVE 19 TO MOD-ROW
             ELSE
               IF SEL-CNT = 1 AND MOD-ROW < 5
                   MOVE 1 TO MOD-SEL
                   MOVE 5 TO MOD-ROW
               ELSE
                   COMPUTE CNT1 = MOD-ROW - 4
                   COMPUTE MOD-SEL = SEL-CNT + (CNT1 - 1)
                   ADD 1 TO MOD-SEL
                   ADD 1 TO MOD-ROW
               END-IF
               PERFORM VARYING CNT1 FROM SEL-MAX BY -1
                       UNTIL CNT1 = (MOD-SEL - 1)
                   COMPUTE CNT2 = CNT1 + 1
                   MOVE MENU-SELECTION(CNT1) TO
                        MENU-SELECTION(CNT2)
               END-PERFORM
             END-IF
             MOVE SPACES TO MENU-SELECTION(MOD-SEL)
                    
             IF MOD-SEL = 1
                 MOVE 0 TO 1-SEQ
             ELSE                
                 MOVE WITH CONVERSION TSEQ(MOD-SEL - 1) TO 1-SEQ
             END-IF
             IF MOD-SEL = SEL-MAX + 1
                 COMPUTE NEW-SEQ = 1-SEQ + 10
             ELSE
                 MOVE WITH CONVERSION TSEQ(MOD-SEL + 1) TO 2-SEQ
                 COMPUTE NEW-SEQ = 1-SEQ + ((2-SEQ - 1-SEQ)/2)
             END-IF
             MOVE NEW-SEQ TO TSEQ(MOD-SEL)
             MOVE "+1"    TO TPOSN(MOD-SEL)
           END-IF.
               
           ADD 1 TO SEL-MAX.
           MOVE 2 TO MOD-COL.
           PERFORM SAVE-OA-ROW-COL.
           MOVE "Y" TO RECORD-STAT.
           MOVE SEL-CNT TO SUB1.
           PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM
               1 BY 1 UNTIL CNT1 > 15.

       DELETE-MENU-SELECTION.  
           COMPUTE CNT1 = MOD-ROW - 4.
           COMPUTE MOD-SEL = SEL-CNT + (CNT1 - 1).
           PERFORM VARYING CNT1 FROM MOD-SEL BY 1
                   UNTIL CNT1 = SEL-MAX
               COMPUTE CNT2 = CNT1 + 1
               MOVE MENU-SELECTION(CNT2) TO MENU-SELECTION(CNT1)
           END-PERFORM.
           MOVE SPACES TO MENU-SELECTION(SEL-MAX).
           SUBTRACT 1 FROM SEL-MAX.
           MOVE "Y" TO RECORD-STAT.
           MOVE SEL-CNT TO SUB1.
           PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM
               1 BY 1 UNTIL CNT1 > 15.

       SAVE-MODIFIED-MSSEL.
           MOVE MOD-SEL TO SUB1.
           IF MSEL-FUNC(CNT1) NOT = TFUNCTION(SUB1)
               MOVE "Y" TO SELECTION-FLAG
               MOVE SPACES TO MENU-SELECTION(MOD-SEL)
               MOVE SPACES TO MSEL-AA(CNT1)
           ELSE
               MOVE "N" TO SELECTION-FLAG.

           PERFORM MOVE-SCN-TO-MS-TABLE.

       SET-MS-FACS.
           MOVE SPACES TO AMUES122-HELP-DEF.
           IF ACCESS-UPDATE
               MOVE BR-MOD-UCL TO HOLD-FAC
               MOVE "Modify Mode " TO SCN-MODE
               IF DEF-MO-FORMAT = "C3"
                   MOVE BR-MOD-ALL TO FAC OF C3-1AMUES122-4-5
               END-IF
               IF DEF-MO-FORMAT = "P3"               
                   MOVE BR-MOD-ALL TO FAC OF P3-1AMUES122-4-5
               END-IF
               IF DEF-MO-FORMAT = "C2"
                   MOVE BR-MOD-ALL TO FAC OF C2-1AMUES122-4-5
               END-IF
               IF DEF-MO-FORMAT = "P2"
                   MOVE BR-MOD-ALL TO FAC OF P2-1AMUES122-4-5
               END-IF
               IF DEF-MO-FORMAT = "C1"
                   MOVE BR-MOD-ALL TO FAC OF C1-1AMUES122-4-5
               END-IF
               IF DEF-MO-FORMAT = "P1"
                   MOVE BR-MOD-ALL TO FAC OF P1-1AMUES122-4-5
               END-IF

               IF SCN-NUM = 1
                   MOVE "Make Changes and Press (RETURN) to Continue or 
      -             "Select:" TO AMUES122-HELP(3)
                   MOVE "1-Display Mode" TO AMUES122-HELP(4)
               ELSE
                   MOVE "Make Changes and Press (RETURN) to Modify Entry
      -             " or Select:" TO AMUES122-HELP(3)
                   STRING "1-Modify Basic Attributes                  ",
                          PF16 DELIMITED BY SIZE INTO AMUES122-HELP(4)
               END-IF
           ELSE
               IF SCN-NUM = 1
                 MOVE " Press (RETURN) to Display Advanced Attributes or 
      -                " Select:" TO AMUES122-HELP(2)
               ELSE
                 MOVE " Press (RETURN) to Display Basic Attributes or Se
      -               "lect:" TO AMUES122-HELP(2)
               END-IF
               STRING PF2-F, PF4, PF6, PF8, PF10-RV,
                      PF12, PF14, PF16 DELIMITED BY SIZE
                   INTO AMUES122-HELP(3)
               STRING PF3-L, PF5, PF7, PF9, PF11, PF13
                   DELIMITED BY SIZE INTO AMUES122-HELP(4)
               MOVE PLAIN-TEXT TO HOLD-FAC.
               MOVE "Display Mode" TO SCN-MODE.

           IF SCN-NUM = 2
               MOVE UNDER-TEXT TO FAC OF 2AMUES122-2-1,
                                  FAC OF 2AMUES122-2-2,
                                  FAC OF 2AMUES122-4-1,
                                  FAC OF 2AMUES122-4-2,
                                  FAC OF 2AMUES122-4-3,
                                  FAC OF 2AMUES122-4-4
                                  FAC OF 2AMUES122-4-5
                                  FAC OF 2AMUES122-4-6, 
                                  FAC OF 2AMUES122-4-7,
                                  FAC OF 2AMUES122-4-8, 
                                  FAC OF 2AMUES122-4-9, 
                                  FAC OF 2AMUES122-4-10,
                                  FAC OF 2AMUES122-4-11
               MOVE UNDER-TEXT TO FAC OF 2AMUES122-21-ROW(2)
           ELSE
               IF DEF-MO-FORMAT = "C3"
                   MOVE UNDER-TEXT TO FAC OF C3-1AMUES122-2-1,
                                      FAC OF C3-1AMUES122-2-2,
                                      FAC OF C3-1AMUES122-4-1,
                                      FAC OF C3-1AMUES122-4-2,
                                      FAC OF C3-1AMUES122-4-3,
                                      FAC OF C3-1AMUES122-4-5
                   MOVE UNDER-TEXT TO FAC OF C3-1AMUES122-21-ROW(2)
               END-IF
               IF DEF-MO-FORMAT = "P3"
                   MOVE UNDER-TEXT TO FAC OF P3-1AMUES122-2-1,
                                      FAC OF P3-1AMUES122-2-2,
                                      FAC OF P3-1AMUES122-4-1,
                                      FAC OF P3-1AMUES122-4-2,
                                      FAC OF P3-1AMUES122-4-3,
                                      FAC OF P3-1AMUES122-4-4,
                                      FAC OF P3-1AMUES122-4-5
                   MOVE UNDER-TEXT TO FAC OF P3-1AMUES122-21-ROW(2)
               END-IF
               IF DEF-MO-FORMAT = "C2"
                   MOVE UNDER-TEXT TO FAC OF C2-1AMUES122-2-1,
                                      FAC OF C2-1AMUES122-2-2,
                                      FAC OF C2-1AMUES122-4-1,
                                      FAC OF C2-1AMUES122-4-2,
                                      FAC OF C2-1AMUES122-4-3,
                                      FAC OF C2-1AMUES122-4-5
                   MOVE UNDER-TEXT TO FAC OF C2-1AMUES122-21-ROW(2)
               END-IF
               IF DEF-MO-FORMAT = "P2"
                   MOVE UNDER-TEXT TO FAC OF P2-1AMUES122-2-1,
                                      FAC OF P2-1AMUES122-2-2,
                                      FAC OF P2-1AMUES122-4-1,
                                      FAC OF P2-1AMUES122-4-2,
                                      FAC OF P2-1AMUES122-4-3,
                                      FAC OF P2-1AMUES122-4-4,
                                      FAC OF P2-1AMUES122-4-5
                   MOVE UNDER-TEXT TO FAC OF P2-1AMUES122-21-ROW(2)
               END-IF
               IF DEF-MO-FORMAT = "C1"
                   MOVE UNDER-TEXT TO FAC OF C1-1AMUES122-2-1,
                                      FAC OF C1-1AMUES122-2-2,
                                      FAC OF C1-1AMUES122-4-1,
                                      FAC OF C1-1AMUES122-4-2,
                                      FAC OF C1-1AMUES122-4-3,
                                      FAC OF C1-1AMUES122-4-5
                   MOVE UNDER-TEXT TO FAC OF C1-1AMUES122-21-ROW(2)
               END-IF
               IF DEF-MO-FORMAT = "P1"
                   MOVE UNDER-TEXT TO FAC OF P1-1AMUES122-2-1,
                                      FAC OF P1-1AMUES122-2-2,
                                      FAC OF P1-1AMUES122-4-1,
                                      FAC OF P1-1AMUES122-4-2,
                                      FAC OF P1-1AMUES122-4-3,
                                      FAC OF P1-1AMUES122-4-4,
                                      FAC OF P1-1AMUES122-4-5
                   MOVE UNDER-TEXT TO FAC OF P1-1AMUES122-21-ROW(2)
               END-IF
           END-IF.
           PERFORM SET-SELECTION-LINE-FAC.

       SET-SELECTION-LINE-FAC.
           IF MOD-ROW > 4 AND < 20
               COMPUTE CNT1 = MOD-ROW - 4
               COMPUTE MOD-SEL = SEL-CNT + (CNT1 - 1)
               IF SCN-NUM = 2
                   MOVE PLAIN-TEXT TO FAC OF 2S-MS-SEQ(CNT1),
                                      FAC OF 2S-MS-POSN(CNT1),
                                      FAC OF 2S-MS-FUNC(CNT1)
                   IF MSEL-FUNC(CNT1) = "<DFTEXT>"
                       MOVE MSEL-AA(CNT1) TO AA-DFTEXT
                       MOVE HOLD-FAC TO 2S-WIDTH-FAC,
                                        2S-JUSTIFY-FAC,
                                        2S-LINE-FAC,
                                        2S-VIDEO-FAC,
                                        2S-PAROPT-FAC
                       MOVE AA-DFTEXT TO MSEL-AA(CNT1)
                   ELSE
                     IF MSEL-FUNC-MENU-ID-CHAR(CNT1,1) = "<"
                         MOVE MSEL-AA(CNT1) TO AA-EXIT-ACTION
                         IF NOT ACCESS-UPDATE
                             MOVE BLANK-PRO TO 2S-EA-PW-FAC
                         ELSE
                             MOVE HOLD-FAC TO 2S-EA-PW-FAC
                         END-IF
                         MOVE HOLD-FAC TO 2S-EA-SC-FAC,
                                          2S-EA-PAROPT-FAC
                         MOVE AA-EXIT-ACTION TO MSEL-AA(CNT1)
                     ELSE
                       IF MSEL-FUNC-MENU-ID-CHAR(CNT1,1) = "("
                           MOVE MSEL-AA(CNT1) TO AA-MENU
                           MOVE HOLD-FAC TO 2S-SC-FAC
                           MOVE AA-MENU TO MSEL-AA(CNT1)
                       ELSE
                           MOVE MSEL-AA(CNT1) TO AA-PROG-PROC
                           MOVE HOLD-FAC TO 2S-VOL-FAC,
                                            2S-PP-SC-FAC,
                                            2S-DHK-FAC,
                                            2S-QRC-FAC,
                                            2S-SLP-FAC,
                                            2S-PP-PAROPT-FAC
                           IF NOT ACCESS-UPDATE
                               MOVE BLANK-PRO TO 2S-PP-PW-FAC
                           ELSE
                               MOVE HOLD-FAC TO 2S-PP-PW-FAC
                           END-IF
                           MOVE AA-PROG-PROC TO MSEL-AA(CNT1)
                           MOVE HOLD-FAC TO FAC OF 2S-MS-AA(CNT1)
                       END-IF
                     END-IF
                   END-IF
               ELSE
                   IF DEF-MO-FORMAT = "C3"
                       MOVE HOLD-FAC TO FAC OF C3-1S-MS-POSN(CNT1),
                                        FAC OF C3-1S-MS-FUNC(CNT1)
                       IF HOLD-FAC = PLAIN-TEXT
                           MOVE HOLD-FAC TO FAC OF C3-1S-MS-DESC(CNT1)
                       ELSE
                           MOVE BR-MOD-ALL TO
                               FAC OF C3-1S-MS-DESC(CNT1)
                       END-IF
                   END-IF
                   IF DEF-MO-FORMAT = "P3"
                       MOVE HOLD-FAC TO FAC OF P3-1S-MS-POSN(CNT1),
                                        FAC OF P3-1S-MS-FUNC(CNT1),
                                        FAC OF P3-1S-MS-PFKEY(CNT1)
                       IF HOLD-FAC = PLAIN-TEXT
                           MOVE HOLD-FAC TO FAC OF P3-1S-MS-DESC(CNT1)
                       ELSE
                           MOVE BR-MOD-ALL TO
                               FAC OF P3-1S-MS-DESC(CNT1)
                       END-IF
                   END-IF
                   IF DEF-MO-FORMAT = "C2"
                       MOVE HOLD-FAC TO FAC OF C2-1S-MS-POSN(CNT1),
                                        FAC OF C2-1S-MS-FUNC(CNT1)
                       IF HOLD-FAC = PLAIN-TEXT
                           MOVE HOLD-FAC TO
                               FAC OF C2-1S-MS-DESC(CNT1)
                       ELSE
                           MOVE BR-MOD-ALL TO
                               FAC OF C2-1S-MS-DESC(CNT1)
                       END-IF
                   END-IF
                   IF DEF-MO-FORMAT = "P2"
                       MOVE HOLD-FAC TO FAC OF P2-1S-MS-POSN(CNT1),
                                        FAC OF P2-1S-MS-FUNC(CNT1),
                                        FAC OF P2-1S-MS-PFKEY(CNT1)
                       IF HOLD-FAC = PLAIN-TEXT
                           MOVE HOLD-FAC TO
                               FAC OF P2-1S-MS-DESC(CNT1)
                       ELSE
                           MOVE BR-MOD-ALL TO
                               FAC OF P2-1S-MS-DESC(CNT1)
                       END-IF
                   END-IF
                   IF DEF-MO-FORMAT = "C1"
                       MOVE HOLD-FAC TO FAC OF C1-1S-MS-POSN(CNT1),
                                        FAC OF C1-1S-MS-FUNC(CNT1),
                       IF HOLD-FAC = PLAIN-TEXT
                           MOVE HOLD-FAC TO
                               FAC OF C1-1S-MS-DESC(CNT1)
                       ELSE
                           MOVE BR-MOD-ALL TO
                               FAC OF C1-1S-MS-DESC(CNT1)
                       END-IF
                   END-IF
                   IF DEF-MO-FORMAT = "P1"
                       MOVE HOLD-FAC TO FAC OF P1-1S-MS-POSN(CNT1),
                                        FAC OF P1-1S-MS-FUNC(CNT1),
                                        FAC OF P1-1S-MS-PFKEY(CNT1)
                       IF HOLD-FAC = PLAIN-TEXT
                           MOVE HOLD-FAC TO
                               FAC OF P1-1S-MS-DESC(CNT1)
                       ELSE
                           MOVE BR-MOD-ALL TO
                               FAC OF P1-1S-MS-DESC(CNT1)
                       END-IF
                   END-IF
               END-IF
           END-IF.

       RUNTIME-VARS-ROUTINE.
           PERFORM SETUP-RV-TABLE.
           MOVE 1 TO SEL-CNT,
                     SUB1.
           PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM 1 BY 1
               UNTIL CNT1 > 15.
           MOVE "BROWSE" TO CUR-ACCESS.
           PERFORM SET-RV-FACS.
           PERFORM DISPLAY-RV-SCREEN THRU EXIT-DISPLAY-RV-SCREEN.

       DISPLAY-RV-SCREEN.
           MOVE 6 TO SCN-INDEX.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE TEMP-OA TO ORDER-AREA OF AMUES114-SCREEN.
           MOVE "Y" TO CHANGED-FLAG.

           DISPLAY AND READ AMUES114-SCREEN ON CRT
           PFKEYS 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,
                 14, 15, 16, 32
           NO-MOD MOVE "N" TO CHANGED-FLAG.

           IF MADE-CHANGES
               MOVE "Y" TO RECORD-STAT.
           IF ACCESS-UPDATE
               IF MOD-ROW < 6
                   MOVE 6 TO MOD-ROW
                   MOVE 5 TO MOD-COL
               ELSE
                 IF MOD-ROW > 20
                     MOVE 20 TO MOD-ROW
                     MOVE 5 TO MOD-COL
                 END-IF
               END-IF
               PERFORM SAVE-OA-ROW-COL.

           IF PF-KEY = "16" THEN
               IF REC-CHANGED
                   MOVE "WARNING" TO CUR-ACCESS
                   PERFORM PROMPT-PFKEY-FUNC
               ELSE
                   MOVE "N" TO RECORD-STAT
                   MOVE "Y" TO DEFAULT-STAT 
                   MOVE 0 TO MOD-ROW,
                             MOD-COL
                   PERFORM SAVE-OA-ROW-COL
                   GO TO EXIT-DISPLAY-RV-SCREEN
               END-IF
           ELSE
           IF PF-KEY = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF PF-KEY = "00" AND ACCESS-WARNING THEN
               MOVE "BROWSE" TO CUR-ACCESS
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT 
               GO TO EXIT-DISPLAY-RV-SCREEN
           ELSE
           IF PF-KEY = "00" AND ACCESS-DEFAULT THEN
      *  Move RV-INSTALL-DEFAULTS to current
               MOVE "N" TO DEFAULT-STAT
               MOVE "Y" TO RECORD-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-RESTORE THEN
               PERFORM SETUP-RV-TABLE
               MOVE 1 TO SEL-CNT,
                         SUB1
               PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM 1 BY 1
                   UNTIL CNT1 > 15
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-SAVE THEN
               PERFORM SAVE-RV-TO-DISK
               MOVE "N" TO RECORD-STAT
               MOVE "Y" TO DEFAULT-STAT
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-UPDATE THEN
               PERFORM SAVE-MODIFIED-RVSEL
               MOVE PLAIN-TEXT TO HOLD-FAC
               PERFORM SET-RVSEL-LINE-FAC
               IF CNT1 = (MOD-ROW - 5)
                   ADD 1 TO MOD-ROW
                   PERFORM SAVE-OA-ROW-COL
               ELSE
                   MOVE "BROWSE" TO CUR-ACCESS
               END-IF
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "00" AND ACCESS-INSERT THEN
               PERFORM SAVE-MODIFIED-RVSEL
               MOVE PLAIN-TEXT TO HOLD-FAC
               PERFORM SET-RVSEL-LINE-FAC
               PERFORM INSERT-RV-SELECTION
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "01" AND NOT ACCESS-BROWSE THEN
               IF ACCESS-UPDATE
                   PERFORM LOAD-RVSEL-SCREEN
               END-IF
               IF ACCESS-INSERT
                   PERFORM DELETE-RV-SELECTION
               END-IF
               MOVE 0 TO MOD-ROW,
                         MOD-COL
               PERFORM SAVE-OA-ROW-COL
               MOVE "BROWSE" TO CUR-ACCESS
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "02" AND ACCESS-BROWSE THEN
               IF SEL-CNT  = 1
                   CALL "BELL" USING BELL-TIME
               ELSE
                   MOVE SPACES TO AMUES114-RVSEL-TABLE
                   MOVE 1 TO SEL-CNT,
                             SUB1
                   PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM 1 BY 1
                       UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-RV-FACS
               END-IF
           ELSE
           IF PF-KEY = "03" AND ACCESS-BROWSE THEN
               IF SEL-CNT  > SEL-MAX - 14
                   CALL "BELL" USING BELL-TIME
               ELSE
                   MOVE SPACES TO AMUES114-RVSEL-TABLE
                   COMPUTE SEL-CNT = SEL-MAX - 14
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM 1 BY 1
                       UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-RV-FACS
               END-IF
           ELSE
           IF PF-KEY = "04" AND ACCESS-BROWSE THEN
               IF SEL-CNT = 1
                   CALL "BELL" USING BELL-TIME
               ELSE
                   IF SEL-CNT - 15 < 1
                       MOVE 1 TO SEL-CNT
                   ELSE
                       COMPUTE SEL-CNT = SEL-CNT - 15
                   END-IF
                   MOVE SPACES TO AMUES114-RVSEL-TABLE
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM
                       1 BY 1 UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-RV-FACS
               END-IF
           ELSE
           IF PF-KEY = "05" AND ACCESS-BROWSE THEN
               IF SEL-CNT + 15 >= SEL-MAX
                   CALL "BELL" USING BELL-TIME
               ELSE
                   IF SEL-MAX - 15 > SEL-CNT
                       COMPUTE SEL-CNT = SEL-MAX - 15
                   ELSE
                       COMPUTE SEL-CNT = SEL-CNT + 15
                   END-IF
                   MOVE SPACES TO AMUES114-RVSEL-TABLE
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM
                       1 BY 1 UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-RV-FACS
               END-IF
           ELSE
           IF PF-KEY = "06" AND ACCESS-BROWSE THEN
               IF SEL-CNT - 1 < 1
                   CALL "BELL" USING BELL-TIME
               ELSE
                   SUBTRACT 1 FROM SEL-CNT
                   MOVE SPACES TO AMUES114-RVSEL-TABLE
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM
                       1 BY 1 UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-RV-FACS
               END-IF
           ELSE
           IF PF-KEY = "07" AND ACCESS-BROWSE THEN
               IF SEL-CNT + 15 > SEL-MAX
                   CALL "BELL" USING BELL-TIME
               ELSE
                   ADD 1 TO SEL-CNT
                   MOVE SPACES TO AMUES114-RVSEL-TABLE
                   MOVE SEL-CNT TO SUB1
                   PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM
                       1 BY 1 UNTIL CNT1 > 15
                   MOVE "BROWSE" TO CUR-ACCESS
                   PERFORM SET-RV-FACS
               END-IF
           ELSE
           IF PF-KEY = "08" AND ACCESS-BROWSE THEN
               PERFORM POSITION-RV
           ELSE
           IF PF-KEY = "09" AND ACCESS-BROWSE THEN
               MOVE "UPDATE" TO CUR-ACCESS
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "10" AND ACCESS-UPDATE THEN
               PERFORM RENUMBER-RV
           ELSE
           IF PF-KEY = "11" AND ACCESS-BROWSE THEN
               MOVE "INSERT" TO CUR-ACCESS
               PERFORM INSERT-RV-SELECTION
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "12" AND ACCESS-BROWSE THEN
               PERFORM DELETE-RV-SELECTION
               PERFORM SET-RV-FACS
           ELSE
           IF PF-KEY = "14" AND ACCESS-BROWSE THEN
               PERFORM MOVE-RV
           ELSE
           IF PF-KEY = "15" AND ACCESS-BROWSE THEN
               MOVE "SAVE" TO CUR-ACCESS
               PERFORM PROMPT-PFKEY-FUNC
           ELSE
               CALL "BELL" USING BELL-TIME.

           GO TO DISPLAY-RV-SCREEN.

       EXIT-DISPLAY-RV-SCREEN.
           EXIT.

       SAVE-MODIFIED-RVSEL.
           MOVE MOD-SEL TO SUB1.
           PERFORM MOVE-SCN-TO-RV-TABLE.

       DELETE-RV-SELECTION.  
           COMPUTE CNT1 = MOD-ROW - 5.
           COMPUTE MOD-SEL = SEL-CNT + (CNT1 - 1).
           PERFORM VARYING CNT1 FROM MOD-SEL BY 1
                   UNTIL CNT1 = SEL-MAX
               COMPUTE CNT2 = CNT1 + 1
               MOVE RUNTIME-SELECTION(CNT2) TO RUNTIME-SELECTION(CNT1)
           END-PERFORM.
           MOVE SPACES TO RUNTIME-SELECTION(SEL-MAX).
           SUBTRACT 1 FROM SEL-MAX.
           MOVE "Y" TO RECORD-STAT.
           MOVE SEL-CNT TO SUB1.
           PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM
               1 BY 1 UNTIL CNT1 > 15.

       SET-RV-FACS.
           IF REC-CHANGED
               MOVE "Modified" TO REC-STAT-TEXT
           ELSE
               MOVE SPACES TO REC-STAT-TEXT.

           MOVE SPACES TO AMUES114-HELP-DEF.
           IF ACCESS-UPDATE THEN
               MOVE BR-MOD-UCL TO HOLD-FAC
               MOVE "Make Changes and Press <RETURN> to Modify Entry or 
      -         "Select:" TO AMUES114-HELP(3)
               MOVE "1-Return to Display Mode" TO AMUES114-HELP(4)
               MOVE UNDER-TEXT TO FAC OF AMUES114-21-ROW(3)
               MOVE "Modify Mode " TO SCN-MODE
           ELSE
           IF ACCESS-INSERT THEN
               MOVE BR-MOD-UCL TO HOLD-FAC
               MOVE "Enter Data as Required and Press (RETURN) to Add E
      -         "ntry or" TO AMUES114-HELP(2)
               MOVE "Select:" TO AMUES114-HELP(3)
               MOVE "1-Display Mode          11-Set Defaults"
                 TO AMUES114-HELP(4)
               MOVE UNDER-TEXT TO FAC OF AMUES114-21-ROW(2)
                                  FAC OF AMUES114-21-ROW(3)
               MOVE "Insert Mode " TO SCN-MODE
           ELSE
               MOVE PLAIN-TEXT TO HOLD-FAC
               MOVE "Position Cursor to Desired Variable and/or Select:"
                 TO AMUES114-HELP(2)
               STRING "                              ", PF8, PF10-RV,
                      PF12, PF14,PF16
                   DELIMITED BY SIZE INTO AMUES114-HELP(3)
               IF REC-CHANGED
                   STRING "                              ", PF9, PF11,
                       PF13, PF15 
                       DELIMITED BY SIZE INTO AMUES114-HELP(4)
               ELSE
                   STRING "                              ", PF9, PF11,
                       PF13 
                       DELIMITED BY SIZE INTO AMUES114-HELP(4)
               END-IF
               MOVE "Display Mode" TO SCN-MODE.

           MOVE UNDER-TEXT TO FAC OF AMUES114-2-1, FAC OF AMUES114-2-2,
                              FAC OF AMUES114-5-1, FAC OF AMUES114-5-2,
                              FAC OF AMUES114-5-3, FAC OF AMUES114-5-4,
                              FAC OF AMUES114-5-5, FAC OF AMUES114-5-6,
                              FAC OF AMUES114-5-7.

           PERFORM SET-RVSEL-LINE-FAC.

       SET-RVSEL-LINE-FAC.
           IF MOD-ROW > 5 AND < 21
               COMPUTE CNT1 = MOD-ROW - 5
               COMPUTE MOD-SEL = SEL-CNT + (CNT1 - 1)
               MOVE HOLD-FAC TO FAC OF S-RT-VAR-LABEL(CNT1),
                                FAC OF S-RT-VAR-FILE(CNT1),
                                FAC OF S-RT-VAR-LIB(CNT1),
                                FAC OF S-RT-VAR-VOL(CNT1),
                                FAC OF S-RT-VAR-MOD(CNT1)
               IF HOLD-FAC = PLAIN-TEXT
                   MOVE HOLD-FAC TO FAC OF S-RT-VAR-DESC(CNT1)
               ELSE
                   MOVE BR-MOD-ALL TO FAC OF S-RT-VAR-DESC(CNT1)
               END-IF.

       SETUP-RV-TABLE.
           MOVE SPACES TO MFILE-KEY.
           MOVE "MD" TO RECORD-TYPE.
           MOVE LOW-VALUES TO MENU-ID.
           MOVE SPACES TO RV-TABLE.
           MOVE 1 TO SEL-CNT.
           MOVE "Y" TO TEST-RECORD.
           PERFORM GET-REST-RV-SELECTIONS VARYING RV-REC-NUM FROM
               0 BY 1 UNTIL RECORD-NOTEXISTS OR RV-REC-NUM > 9.
           COMPUTE SEL-MAX = SEL-CNT - 1.

       GET-REST-RV-SELECTIONS.
           MOVE RV-REC TO MRECORD-DEF.
           PERFORM READ-MENU-FILE-RECORD.
           IF RECORD-EXISTS
               MOVE MFILE-REST-OF-RECORD TO RUNTIME-VARS-RECORD
               PERFORM MOVE-RV-DEF-TO-RV-TABLE VARYING SUB1 FROM 1 BY 1
                   UNTIL RT-VAR-SEQ(SUB1) = SPACES OR SUB1 > 25.

       MOVE-RV-DEF-TO-RV-TABLE.
           MOVE RT-VAR-SEQ(SUB1)   TO RVSEQ(SEL-CNT).
           MOVE RT-VAR-LABEL(SUB1) TO RVLABEL(SEL-CNT).
           MOVE RT-VAR-DESC(SUB1)  TO RVDESCRIPTION(SEL-CNT).
           MOVE RT-VAR-FILE(SUB1)  TO RVFILE(SEL-CNT).
           MOVE RT-VAR-LIB(SUB1)   TO RVLIB(SEL-CNT).
           MOVE RT-VAR-VOL(SUB1)   TO RVVOL(SEL-CNT).
           MOVE RT-VAR-MOD(SUB1)   TO RVMOD(SEL-CNT).
           ADD 1 TO SEL-CNT.

       MOVE-RV-TABLE-TO-RV-DEF.
           MOVE RVSEQ(SEL-CNT)         TO RT-VAR-SEQ(SUB1).
           MOVE RVLABEL(SEL-CNT)       TO RT-VAR-LABEL(SUB1).
           MOVE RVDESCRIPTION(SEL-CNT) TO RT-VAR-DESC(SUB1).
           MOVE RVFILE(SEL-CNT)        TO RT-VAR-FILE(SUB1).
           MOVE RVLIB(SEL-CNT)         TO RT-VAR-LIB(SUB1).
           MOVE RVVOL(SEL-CNT)         TO RT-VAR-VOL(SUB1).
           MOVE RVMOD(SEL-CNT)         TO RT-VAR-MOD(SUB1).
           ADD 1 TO SEL-CNT.

       MOVE-SCN-TO-RV-TABLE.
           MOVE RVSEL-SEQ(CNT1)  TO RVSEQ(SUB1).
           MOVE RVSEL-LABEL(CNT1) TO RVLABEL(SUB1).
           MOVE RVSEL-DESC(CNT1) TO RVDESCRIPTION(SUB1).
           MOVE RVSEL-FILE(CNT1) TO RVFILE(SUB1).
           MOVE RVSEL-LIB(CNT1)  TO RVLIB(SUB1).
           MOVE RVSEL-VOL(CNT1)  TO RVVOL(SUB1).
           MOVE RVSEL-MOD(CNT1)  TO RVMOD(SUB1).
           ADD 1 TO SUB1.

       LOAD-RVSEL-SCREEN.
           MOVE RVSEQ(SUB1)         TO RVSEL-SEQ(CNT1).
           MOVE RVLABEL(SUB1)       TO RVSEL-LABEL(CNT1).
           MOVE RVDESCRIPTION(SUB1) TO RVSEL-DESC(CNT1).
           MOVE RVFILE(SUB1)        TO RVSEL-FILE(CNT1).
           MOVE RVLIB(SUB1)         TO RVSEL-LIB(CNT1).
           MOVE RVVOL(SUB1)         TO RVSEL-VOL(CNT1).
           MOVE RVMOD(SUB1)         TO RVSEL-MOD(CNT1).
           MOVE PLAIN-TEXT TO FAC OF S-RT-VAR-SEQ(CNT1),
                              FAC OF S-RT-VAR-LABEL(CNT1),              
                              FAC OF S-RT-VAR-DESC(CNT1),
                              FAC OF S-RT-VAR-FILE(CNT1),
                              FAC OF S-RT-VAR-LIB(CNT1),
                              FAC OF S-RT-VAR-VOL(CNT1),
                              FAC OF S-RT-VAR-MOD(CNT1).
           ADD 1 TO SUB1.

       SAVE-RV-TO-DISK.
           MOVE 1 TO SEL-CNT.
           MOVE "Y" TO TEST-RECORD.
           PERFORM MOVE-REST-RVSEL VARYING RV-REC-NUM FROM
               0 BY 1 UNTIL RECORD-NOTEXISTS OR RV-REC-NUM > 9.

       MOVE-REST-RVSEL.
           MOVE RV-REC TO MRECORD-DEF.
           PERFORM READ-MENU-FILE-RECORD-HOLD.
           IF RECORD-EXISTS AND SEL-CNT > SEL-MAX
               PERFORM DELETE-MENU-FILE-RECORD
           ELSE
             IF RECORD-EXISTS
                 MOVE SPACES TO RUNTIME-VARS-RECORD
                 PERFORM MOVE-RV-TABLE-TO-RV-DEF VARYING SUB1 FROM 1
                     BY 1 UNTIL RVSEQ(SUB1) = SPACES OR SUB1 > 25
                 MOVE RUNTIME-VARS-RECORD TO MFILE-REST-OF-RECORD               
                 PERFORM REWRITE-MENU-FILE-RECORD
             ELSE 
               IF SEL-CNT < SEL-MAX
                   MOVE SPACES TO RUNTIME-VARS-RECORD
                   PERFORM MOVE-RV-TABLE-TO-RV-DEF VARYING SUB1 FROM 1
                       BY 1 UNTIL RVSEQ(SEL-CNT) = SPACES OR SUB1 > 25
                   MOVE RUNTIME-VARS-RECORD TO MFILE-REST-OF-RECORD
                   PERFORM WRITE-MENU-FILE-RECORD
               END-IF
             END-IF
           END-IF.

       PROMPT-PFKEY-FUNC.
           IF SCN-INDEX = 3
               MOVE "File Option*" TO SCN-TEXT
               MOVE SPACES TO AMUES111-HELP-DEF
           ELSE
           IF SCN-INDEX = 4
               MOVE "Window*" TO SCN-TEXT
               MOVE SPACES TO AMUES112-HELP-AREA
           ELSE
           IF SCN-INDEX = 5
               IF ACCESS-RESTORE
                   MOVE "Default Menu Option*" TO SCN-TEXT
               ELSE
               IF ACCESS-SAVE
                   MOVE "Default Menu Options*" TO SCN-TEXT
               ELSE
                   MOVE "Menu Option*" TO SCN-TEXT
               END-IF
               MOVE SPACES TO AMUES113-HELP-DEF
           ELSE
           IF SCN-INDEX = 6
               MOVE "Runtime Variable*" TO SCN-TEXT
               MOVE SPACES TO AMUES114-HELP-DEF.

           IF ACCESS-DEFAULT
               MOVE "Default Mode" TO SCN-MODE
               STRING "Press (RETURN) to Reestablish the Default "
                        DELIMITED BY SIZE,
                      SCN-TEXT DELIMITED BY DELIM-CHAR,
                      "s or Select:" DELIMITED BY SIZE
                   INTO HOLD-TEXT
           ELSE
           IF ACCESS-RESTORE
               MOVE "Restore Mode" TO SCN-MODE
               STRING "Press (RETURN) to Restore " DELIMITED
                 BY SIZE, SCN-TEXT DELIMITED BY DELIM-CHAR,
                      "s from the File or Select:" DELIMITED BY SIZE
                   INTO HOLD-TEXT
           ELSE
           IF ACCESS-SAVE
               MOVE "   Save Mode" TO SCN-MODE
               STRING "Press (RETURN) to Save " DELIMITED BY SIZE,
                      SCN-TEXT DELIMITED BY DELIM-CHAR,
                      " Modifications or Select:" DELIMITED BY SIZE
                   INTO HOLD-TEXT
           ELSE
           IF ACCESS-WARNING
               MOVE "WARNING:  The Latest Set of Changes Have Not Been S
      -             "aved" TO HOLD-TEXT3
               MOVE "Press (RETURN) to Exit Without Saving Changes or Se 
      -             "lect:" TO HOLD-TEXT.

           MOVE "1-Cancel Request and Respecify Function"
               TO HOLD-TEXT2.

           IF SCN-INDEX = 3
               IF ACCESS-WARNING
                   MOVE HOLD-TEXT3 TO AMUES111-HELP(1)
               END-IF
               MOVE HOLD-TEXT TO AMUES111-HELP(3)
               MOVE UNDER-TEXT TO FAC OF AMUES111-21-ROW(3)
               MOVE HOLD-TEXT2 TO AMUES111-HELP(4)
           ELSE
           IF SCN-INDEX = 4
               IF ACCESS-WARNING
                   MOVE HOLD-TEXT3 TO AMUES112-21-VALUE(1)
               END-IF
               MOVE HOLD-TEXT  TO AMUES112-21-VALUE(3)
               MOVE UNDER-TEXT TO AMUES112-21-FAC(3)
               MOVE HOLD-TEXT2 TO AMUES112-21-VALUE(4)
           ELSE
           IF SCN-INDEX = 5
               IF ACCESS-WARNING
                   MOVE HOLD-TEXT3 TO AMUES113-HELP(1)
               END-IF
               MOVE HOLD-TEXT TO AMUES113-HELP(3)
               MOVE UNDER-TEXT TO FAC OF AMUES113-21-ROW(3)
               MOVE HOLD-TEXT2 TO AMUES113-HELP(4)
           ELSE
           IF SCN-INDEX = 6
               IF ACCESS-WARNING
                   MOVE HOLD-TEXT3 TO AMUES114-HELP(1)
               END-IF
               MOVE HOLD-TEXT TO AMUES114-HELP(3)
               MOVE UNDER-TEXT TO FAC OF AMUES114-21-ROW(3)
               MOVE HOLD-TEXT2 TO AMUES114-HELP(4).

       LOAD-INSTALL-DEFAULTS.
           MOVE "AMUDEF" TO FIL-FOR-MFILE.
           MOVE "Y" TO DEFAULT-STAT.

       READ-MENU-FILE-RECORD.
           MOVE "Y" TO TEST-RECORD.
           READ MENU-FILE RECORD
               INVALID KEY
                   MOVE "N" TO TEST-RECORD.

       READ-MENU-FILE-RECORD-HOLD.
           MOVE "Y" TO TEST-RECORD.
           READ MENU-FILE WITH HOLD
               INVALID KEY
                   MOVE "N" TO TEST-RECORD.

       READ-MENU-FILE-RECORD-NEXT.
           MOVE "Y" TO TEST-RECORD.
           READ MENU-FILE NEXT RECORD
               AT END
                   MOVE "N" TO TEST-RECORD.

       WRITE-MENU-FILE-RECORD.
           WRITE MFILE-RECORD
               INVALID KEY
                   DISPLAY "Invalid key - ", MFILE-KEY.

       REWRITE-MENU-FILE-RECORD.
           REWRITE MFILE-RECORD
               INVALID KEY
                   DISPLAY "Invalid key - ", MFILE-KEY.

       DELETE-MENU-FILE-RECORD.
           DELETE MENU-FILE RECORD
               INVALID KEY
                   MOVE "N" TO TEST-RECORD.

       CHANGE-SEQUENCE-OF-WINDOWS.
           DISPLAY "CHANGE SEQUENCE OF WINDOWS NOT SUPPORTED".

       INSERT-WS-ROW.
           DISPLAY "INSERT WS ROW NOT SUPPORTED".

       DELETE-WS-ROW.
           DISPLAY "DELETE WS ROW NOT SUPPORTED".

       RENUMBER-RV.
           DISPLAY "RE-NUMBER RUNTIME VARIABLES NOT SUPPORTED".

       INSERT-RV-SELECTION.
           IF SEL-MAX = 0
               MOVE 1 TO SEL-CNT,
                         CNT1,                            
                         MOD-SEL
               MOVE SPACES TO RUNTIME-SELECTION(CNT1)
               MOVE "020" TO RVSEQ(CNT1)
               MOVE "N"   TO RVMOD(CNT1)
               MOVE 6 TO MOD-ROW
           ELSE
             IF SEL-CNT > (SEL-MAX - 15) AND MOD-ROW > 20
                 COMPUTE MOD-SEL = SEL-MAX + 1
                 ADD 1 TO SEL-CNT
                 MOVE 20 TO MOD-ROW
             ELSE
               IF SEL-CNT = 1 AND MOD-ROW < 6
                   MOVE 1 TO MOD-SEL
                   MOVE 6 TO MOD-ROW
               ELSE
                   COMPUTE CNT1 = MOD-ROW - 5
                   COMPUTE MOD-SEL = SEL-CNT + (CNT1 - 1)
                   ADD 1 TO MOD-SEL
                   ADD 1 TO MOD-ROW
               END-IF
               PERFORM VARYING CNT1 FROM SEL-MAX BY -1
                       UNTIL CNT1 = (MOD-SEL - 1)
                   COMPUTE CNT2 = CNT1 + 1
                   MOVE RUNTIME-SELECTION(CNT1) TO
                        RUNTIME-SELECTION(CNT2)
               END-PERFORM
             END-IF
             MOVE SPACES TO RUNTIME-SELECTION(MOD-SEL)
                    
             IF MOD-SEL = 1
                 MOVE 0 TO 1-SEQ
             ELSE                
                 MOVE WITH CONVERSION RVSEQ(MOD-SEL - 1) TO 1-SEQ
             END-IF
             IF MOD-SEL = SEL-MAX + 1
                 MOVE WITH CONVERSION RVSEQ(MOD-SEL) TO 1-SEQ
                 COMPUTE 2-SEQ = 1-SEQ + 10
             ELSE
                 MOVE WITH CONVERSION RVSEQ(MOD-SEL + 1) TO 2-SEQ
             END-IF
             COMPUTE NEW-SEQ = 1-SEQ + ((2-SEQ - 1-SEQ)/2)
             MOVE NEW-SEQ TO RVSEQ(MOD-SEL)
             MOVE "N"     TO RVMOD(MOD-SEL)
           END-IF.
               
           ADD 1 TO SEL-MAX.
           MOVE 5 TO MOD-COL.
           PERFORM SAVE-OA-ROW-COL.
           MOVE "Y" TO RECORD-STAT.
           MOVE SEL-CNT TO SUB1.
           PERFORM LOAD-RVSEL-SCREEN VARYING CNT1 FROM
               1 BY 1 UNTIL CNT1 > 15.

       MOVE-RV.
           DISPLAY "MOVE RUNTIME VARIABLES NOT SUPPORTED".

       POSITION-RV.
           DISPLAY "POSITION RUNTIME VARIABLES NOT SUPPORTED".

       LIST-ALL-MENUS.
           MOVE LINK-MENU-FILE TO LIST-MENU-FILE.
           MOVE LINK-MENU-LIB  TO LIST-MENU-LIB.
           MOVE LINK-MENU-VOL  TO LIST-MENU-VOL.
           MOVE UNDER-TEXT TO FAC OF AMUEL120-3-ROW.
           PERFORM SET-UP-MENU-LIST.
           PERFORM SET-LIST-MENU-FACS.
           MOVE MENU-COUNT TO LIST-MENU-CNT.
           PERFORM DISPLAY-ALL-MENUS THRU EXIT-DISPLAY-ALL-MENUS.

       DISPLAY-ALL-MENUS.
           MOVE 7 TO SCN-INDEX.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE TEMP-OA TO ORDER-AREA OF AMUEL120-SCREEN.

           DISPLAY AND READ AMUEL120-SCREEN ON CRT
           PFKEYS 2, 3, 4, 5, 6, 7, 8, 16, 32.

           PERFORM SAVE-OA-ROW-COL.

           IF PF-KEY = "16" THEN
               MOVE 0 TO MOD-ROW,
                         MOD-COL
               PERFORM SAVE-OA-ROW-COL
               GO TO EXIT-DISPLAY-ALL-MENUS
           ELSE
           IF PF-KEY = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF PF-KEY = "00" THEN
                PERFORM MENU-MAINTENANCE
           ELSE
      *                         Displays first screen.
           IF PF-KEY = "02" THEN
               IF CURR-MENU-COUNT = 1
                 CALL "BELL" USING BELL-TIME
               ELSE
                   MOVE MENU-PICK TO HOLD-FAC
                   MOVE 1 TO CURR-MENU-COUNT
                             SUB1
                   PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
                       CNT1 > 15
               END-IF
           ELSE
      *                         Displays last screen.
           IF PF-KEY = "03" THEN
               COMPUTE CURR-MENU-COUNT = MENU-COUNT - 15
               IF CURR-MENU-COUNT < 1
                   MOVE 1 TO CURR-MENU-COUNT
                   CALL "BELL" USING BELL-TIME
               ELSE
                   MOVE MENU-PICK TO HOLD-FAC
                   MOVE CURR-MENU-COUNT TO SUB1
                   PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
                       CNT1 > 15
               END-IF
           ELSE
      *                         Displays previous screen.
           IF PF-KEY = "04" THEN
               IF CURR-MENU-COUNT = 1
                   CALL "BELL" USING BELL-TIME
               END-IF
               IF CURR-MENU-COUNT > 15
                   COMPUTE CURR-MENU-COUNT = CURR-MENU-COUNT - 15
               ELSE
                   MOVE 1 TO CURR-MENU-COUNT
               END-IF
               MOVE CURR-MENU-COUNT TO SUB1
               MOVE MENU-PICK TO HOLD-FAC
               PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
                   CNT1 > 15
           ELSE
      *                         Displays next screen.
           IF PF-KEY = "05" THEN
               IF CURR-MENU-COUNT = MENU-COUNT
                   CALL "BELL" USING BELL-TIME
               END-IF
               IF CURR-MENU-COUNT  < (MENU-COUNT - 15)
                   COMPUTE CURR-MENU-COUNT = CURR-MENU-COUNT + 15
               ELSE
                   MOVE MENU-COUNT TO CURR-MENU-COUNT
               END-IF
               MOVE CURR-MENU-COUNT TO SUB1
               MOVE MENU-PICK TO HOLD-FAC
               PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
                   CNT1 > 15
           ELSE
      *                         Moves list down one row.
           IF PF-KEY = "06" THEN
               ADD 1 TO CURR-MENU-COUNT
               IF CURR-MENU-COUNT > (MENU-COUNT - 15)
                   SUBTRACT 1 FROM CURR-MENU-COUNT
                   CALL "BELL" USING BELL-TIME
               ELSE
                   MOVE CURR-MENU-COUNT TO SUB1
                   MOVE MENU-PICK TO HOLD-FAC
                   PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
                       CNT1 > 15
               END-IF
           ELSE
      *                         Moves list up one row.
           IF PF-KEY = "07" THEN
               SUBTRACT 1 FROM CURR-MENU-COUNT
               IF CURR-MENU-COUNT < 1
                   ADD 1 TO CURR-MENU-COUNT
                   CALL "BELL" USING BELL-TIME
               ELSE
                   MOVE CURR-MENU-COUNT TO SUB1
                   MOVE MENU-PICK TO HOLD-FAC
                   PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
                       CNT1 > 15
               END-IF
           ELSE
      *                         Prompts for USER-ID; then scrolls list so specified
      *                         menu entry appears in first row of display.
           IF PF-KEY = "08" THEN
               MOVE PLAIN-TEXT TO HOLD-FAC
               PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
                   CNT1 > 15
               MOVE SPACES TO ENTER-MENU-ID
               PERFORM PROMPT-MENU-ID THRU EXIT-PROMPT-MENU-ID
               MOVE MENU-PICK TO HOLD-FAC
               MOVE CURR-MENU-COUNT TO SUB1
               PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
                   CNT1 > 15
               MOVE A-0-BYTE TO D-SCN-COL(2)
               MOVE A-0-BYTE TO D-SCN-ROW(2).

           GO TO DISPLAY-ALL-MENUS.

       EXIT-DISPLAY-ALL-MENUS.
           EXIT.

       SET-UP-MENU-LIST.
           MOVE SPACES TO MDM-MENU-TABLE.
           MOVE SPACES TO MFILE-KEY.
           MOVE "MD" TO RECORD-TYPE.
           MOVE "M1" TO MRECORD-DEF.
           MOVE 0 TO MENU-COUNT.
           MOVE 1 TO CURR-MENU-COUNT
           MOVE SPACES TO AMUEL120-ITEM.
           MOVE "Y" TO TEST-RECORD.
           START MENU-FILE KEY IS NOT < MFILE-KEY.
           IF MFILE-STAT = "00"
               PERFORM SETUP-MENU-ITEM-TABLE UNTIL RECORD-NOTEXISTS
           ELSE
               MOVE "N" TO TEST-RECORD.
           MOVE 1 TO SUB1.
           MOVE MENU-PICK TO HOLD-FAC.
           PERFORM INIT-MENU-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
               CNT1 > 15.

       INIT-MENU-LIST.
           MOVE HOLD-FAC TO 120-SUB-COL1(CNT1).
           IF HOLD-FAC = MENU-PICK
               MOVE SUB-5     TO 120-SUB-COL2(CNT1)
               MOVE MDM-MENU-ID(SUB1) TO LIST-MENU-ID(CNT1) 
               MOVE "   "     TO LIST-SEPARATOR(CNT1)
               MOVE MDM-MENU-TITLE(SUB1) TO LIST-MENU-TITLE(CNT1)
               ADD 1 TO SUB1
           ELSE
               MOVE SPACES TO 120-SUB-COL2(CNT1).
           
       SETUP-MENU-ITEM-TABLE.
           PERFORM READ-MENU-FILE-RECORD-NEXT.
               
           IF RECORD-EXISTS AND RECORD-TYPE NOT = "MD"
               MOVE "N" TO TEST-RECORD.

           IF RECORD-EXISTS AND RECORD-TYPE = "MD"
                  AND MRECORD-DEF = "M1"
               MOVE MFILE-REST-OF-RECORD TO MENU-OPTS-RECORD
               ADD 1 TO MENU-COUNT
               MOVE MENU-ID      TO MDM-MENU-ID(MENU-COUNT)
               MOVE DEF-MO-TITLE TO MDM-MENU-TITLE(MENU-COUNT).

       SET-LIST-MENU-FACS.
           MOVE "Position Cursor and Press (RETURN) to Maintain Menu or
      -         "Select:" TO AMUEL120-HELP(1).
           MOVE "                            8-Position                 
      -         "               16-Exit" TO AMUEL120-HELP(2).
           MOVE "                                                       
      -         "      13-Help  32-Quit" TO AMUEL120-HELP(3).

           MOVE UNDER-TEXT TO FAC OF AMUEL120-21-ROW(1).

       SAVE-OA-ROW-COL.
           IF MOD-ROW = 1 THEN
               MOVE A-1-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 2 THEN
               MOVE A-2-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 3 THEN
               MOVE A-3-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 4 THEN
               MOVE A-4-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 5 THEN
               MOVE A-5-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 6 THEN
               MOVE A-6-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 7 THEN
               MOVE A-7-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 8 THEN
               MOVE A-8-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 9 THEN
               MOVE A-9-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 10 THEN
               MOVE A-10-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 11 THEN
               MOVE A-11-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 12 THEN
               MOVE A-12-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 13 THEN
               MOVE A-13-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 14 THEN
               MOVE A-14-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 15 THEN
               MOVE A-15-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 16 THEN
               MOVE A-16-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 17 THEN
               MOVE A-17-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 18 THEN
               MOVE A-18-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 19 THEN
               MOVE A-19-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 20 THEN
               MOVE A-20-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 21 THEN
               MOVE A-21-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 22 THEN
               MOVE A-22-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 23 THEN
               MOVE A-23-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
           IF MOD-ROW = 24 THEN
               MOVE A-24-BYTE TO D-SCN-ROW(SCN-INDEX)
           ELSE
               MOVE A-0-BYTE TO D-SCN-ROW(SCN-INDEX).

           IF MOD-COL = 5 THEN
               MOVE A-5-BYTE TO D-SCN-COL(SCN-INDEX)
           ELSE
           IF MOD-COL = 7 THEN
               MOVE A-7-BYTE TO D-SCN-COL(SCN-INDEX)
           ELSE
           IF MOD-COL = 21 THEN
               MOVE A-21-BYTE TO D-SCN-COL(SCN-INDEX)
           ELSE
           IF MOD-COL = 26 THEN
               MOVE A-26-BYTE TO D-SCN-COL(SCN-INDEX)
           ELSE
               MOVE A-0-BYTE TO D-SCN-COL(SCN-INDEX).

       MENU-MAINTENANCE.
           COMPUTE CNT1 = CURR-MENU-COUNT + (MOD-ROW - 5).
           MOVE MDM-MENU-ID(CNT1) TO MAIN-MENU-ID.
           PERFORM MAINTAIN-A-MENU.

       PROMPT-MENU-ID.
           MOVE SPACES TO ENTER-MENU-ID.
           MOVE WSXIO-WRITE TO WSXIO-CMD.
           MOVE A-20-BYTE   TO WSXIO-O-A-1.
           MOVE A-160-BYTE  TO WSXIO-O-A-2.
           MOVE A-12-BYTE   TO WSXIO-O-A-3.
           MOVE A-20-BYTE   TO WSXIO-O-A-4.
           MOVE 400 TO S2-LEN.
           MOVE "X" To WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-PROMPT-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE WSXIO-READ TO WSXIO-CMD.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-PROMPT-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE "A" TO WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB, WSXIO-AID.

           IF WSXIO-AID = "A" THEN
               GO TO EXIT-PROMPT-MENU-ID
           ELSE
           IF WSXIO-AID = "@" THEN
                PERFORM SET-LIST-TO-POSITION
           ELSE
               CALL "BELL" USING BELL-TIME
               GO TO PROMPT-MENU-ID.

       EXIT-PROMPT-MENU-ID.
           EXIT.

       SET-LIST-TO-POSITION.
           MOVE "N" TO TEST-RECORD.
           MOVE " " TO MATCH-RECORD.
           MOVE CURR-MENU-COUNT TO HOLD1-CNT.
           PERFORM FIND-MENU-IN-LIST VARYING CNT1 FROM 1 BY 1 UNTIL
               RECORD-EXISTS OR CNT1 > MENU-COUNT.

           IF RECORD-EXISTS
               SUBTRACT 1 FROM CNT1
               MOVE CNT1 TO CURR-MENU-COUNT
           ELSE
           IF 2ND-CHAR-MATCH
               MOVE HOLD2-CNT TO CURR-MENU-COUNT
           ELSE
               MOVE HOLD1-CNT TO CURR-MENU-COUNT.
           
       FIND-MENU-IN-LIST.
           IF ENTER-MENU-ID = MDM-MENU-ID(CNT1)
               MOVE "Y" TO TEST-RECORD
           ELSE
           IF ID-CHAR(1) = MDM-ID-CHAR(CNT1,1)                                                  
               MOVE "1" TO MATCH-RECORD
               MOVE CNT1 TO HOLD1-CNT
           ELSE
           IF 1ST-CHAR-MATCH AND ID-CHAR(2)
                    = MDM-ID-CHAR(CNT1,2)
               MOVE "2" TO MATCH-RECORD
               MOVE CNT1 TO HOLD2-CNT.

       PROMPT-CREATE-MENU-ID.
           MOVE SPACES TO CREATE-MENU-ID,
                          CREATE-MENU-TITLE.
           MOVE WSXIO-WRITE TO WSXIO-CMD.
           MOVE A-19-BYTE   TO WSXIO-O-A-1.
           MOVE A-160-BYTE  TO WSXIO-O-A-2.
           MOVE A-22-BYTE   TO WSXIO-O-A-3.
           MOVE A-21-BYTE   TO WSXIO-O-A-4.
           MOVE 400 TO S2-LEN.
           MOVE "X" TO WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-CREATE-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE WSXIO-READ TO WSXIO-CMD.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-CREATE-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE "A" TO WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB, WSXIO-AID.

           IF WSXIO-AID = "A" THEN
               GO TO EXIT-PROMPT-CREATE-MENU-ID
           ELSE
           IF WSXIO-AID = "@" THEN
                PERFORM CREATE-A-NEW-MENU
           ELSE
               CALL "BELL" USING BELL-TIME
               GO TO PROMPT-CREATE-MENU-ID.

       EXIT-PROMPT-CREATE-MENU-ID.
           EXIT.

       PROMPT-MAINTAIN-MENU-ID.
           MOVE SPACES TO MAIN-MENU-ID.
           MOVE WSXIO-WRITE TO WSXIO-CMD.
           MOVE A-19-BYTE   TO WSXIO-O-A-1.
           MOVE A-160-BYTE  TO WSXIO-O-A-2.
           MOVE A-36-BYTE   TO WSXIO-O-A-3.
           MOVE A-22-BYTE   TO WSXIO-O-A-4.
           MOVE 480 TO S2-LEN.
           MOVE "X" To WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-MAINTAIN-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE WSXIO-READ TO WSXIO-CMD.
           MOVE "N" TO WSXIO-ERROR-FLAG
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-MAINTAIN-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE "A" TO WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB, WSXIO-AID.

           IF WSXIO-AID = "A" THEN
               GO TO EXIT-PROMPT-MAINTAIN-MENU-ID
           ELSE
             IF WSXIO-AID = "@" THEN
                  PERFORM MAINTAIN-A-MENU
                  IF WSXIO-ERROR
                      GO TO PROMPT-MAINTAIN-MENU-ID
                  END-IF 
             ELSE
                 MOVE "Y" TO WSXIO-ERROR-FLAG
                 MOVE "Invalid PF-key pressed." TO
                     WSXIO-MAINTAIN-MESSAGE
                 CALL "BELL" USING BELL-TIME
                 GO TO PROMPT-MAINTAIN-MENU-ID
             END-IF
           END-IF.

       EXIT-PROMPT-MAINTAIN-MENU-ID.
           EXIT.

       PROMPT-SAVE-MENU-ID.
           IF NOT-NEW
               MOVE SPACES TO SAVE-EMENU-ID
           ELSE
               MOVE MENU-ID TO SAVE-MENU-ID.
           MOVE WSXIO-WRITE TO WSXIO-CMD.
           MOVE A-19-BYTE   TO WSXIO-O-A-1.
           MOVE A-160-BYTE  TO WSXIO-O-A-2.
           IF SAVE-ID-FAC = PLAIN-TEXT
               MOVE A-0-BYTE   TO WSXIO-O-A-3
               MOVE A-19-BYTE   TO WSXIO-O-A-4
           ELSE
               MOVE A-32-BYTE   TO WSXIO-O-A-3
               MOVE A-21-BYTE   TO WSXIO-O-A-4.
           MOVE 400 TO S2-LEN.
           MOVE "X" TO WSXIO-FUNCTION.
           IF IS-NEW
               CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-SAVE-NEW-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID
           ELSE
               CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH,
                              WSXIO-SAVE-NEW-EXISTING-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE WSXIO-READ TO WSXIO-CMD.
           IF IS-NEW
               CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-SAVE-NEW-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID
           ELSE
               CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH,
                              WSXIO-SAVE-NEW-EXISTING-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE "A" TO WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB, WSXIO-AID.

           IF WSXIO-AID = "A" THEN
               GO TO EXIT-PROMPT-SAVE-MENU-ID
           ELSE
           IF WSXIO-AID = "@" THEN
               IF IS-NEW
                   IF SAVE-MENU-ID = SPACES
                       MOVE BLINK-MOD-UCL TO SAVE-ID-FAC
                       GO TO PROMPT-SAVE-MENU-ID
                   ELSE
                       MOVE SAVE-MENU-ID TO MENU-ID
                       PERFORM SAVE-CREATED-MENU
                   END-IF
               ELSE
                   IF SAVE-EMENU-ID = SPACES
                       MOVE BLINK-MOD-UCL TO SAVE-EID-FAC
                       GO TO PROMPT-SAVE-MENU-ID
                   ELSE
                       MOVE SAVE-EMENU-ID TO MENU-ID
                       MOVE "N" TO TEST-RECORD
                       PERFORM READ-MENU-FILE-RECORD
                       IF RECORD-EXISTS
                           MOVE BLINK-MOD-UCL TO SAVE-EID-FAC
                           GO TO PROMPT-SAVE-MENU-ID
                       ELSE
                           MOVE "Y" TO CREATE-FLAG 
                           PERFORM SAVE-CREATED-MENU
                       END-IF
                   END-IF
               END-IF
           ELSE
           IF IS-NEW AND WSXIO-AID = "I" THEN
                MOVE BR-MOD-UCL TO SAVE-ID-FAC
                GO TO PROMPT-SAVE-MENU-ID
           ELSE
               CALL "BELL" USING BELL-TIME
               GO TO PROMPT-SAVE-MENU-ID.

       EXIT-PROMPT-SAVE-MENU-ID.
           EXIT.

       CREATE-A-NEW-MENU.
           MOVE SPACES TO MFILE-KEY.
           MOVE "N" TO TEST-RECORD.
           IF CREATE-MENU-ID NOT = SPACES
               MOVE "MD" TO RECORD-TYPE
               MOVE CREATE-MENU-ID TO MENU-ID
               MOVE "M1" TO MRECORD-DEF
               PERFORM READ-MENU-FILE-RECORD
               IF RECORD-EXISTS
                   DISPLAY "Menu ",MENU-ID," already exists."
                   MOVE "N" TO CREATE-FLAG
                   MOVE MFILE-REST-OF-RECORD TO MENU-OPTS-RECORD
               ELSE
                   MOVE "MD" TO RECORD-TYPE
                   MOVE LOW-VALUES TO MENU-ID
                   MOVE "MD" TO MRECORD-DEF
                   PERFORM READ-MENU-FILE-RECORD.
                   IF RECORD-EXISTS
                       MOVE MFILE-REST-OF-RECORD TO MENU-OPTS-RECORD
                       MOVE CREATE-MENU-ID TO MENU-ID
                       MOVE CREATE-MENU-TITLE TO DEF-MO-TITLE
                       MOVE FORMAT-DATE TO MODIFIED-ON-DATE
                       MOVE EXT-USER-ID TO MODIFIED-BY-USER
                       MOVE "Modified" TO REC-STAT-TEXT
                       MOVE 0 TO SEL-CNT
                       MOVE "Y" TO CREATE-FLAG
                   ELSE
                       DISPLAY "Default MD record does not exist.".
           STRING "Maintain Menu ",CREATE-MENU-ID,
                  ": ",CREATE-MENU-TITLE DELIMITED BY SIZE
               INTO MENU-ID-TITLE.
           IF NOT-NEW
               PERFORM SETUP-MS-TABLE
           ELSE
               MOVE SPACES TO MS-TABLE
               MOVE 0 TO SEL-MAX.

           PERFORM DISP-MENU-MAINTENANCE THRU
               EXIT-DISP-MENU-MAINTENANCE.

       DISP-MENU-MAINTENANCE.
           MOVE 8 TO SCN-INDEX.
           MOVE UNDER-TEXT TO FAC OF AMUEM120-1, FAC OF AMUEM120-2.
           PERFORM INIT-AMUEM120-SELECTIONS.
           MOVE D-SCN-COL(SCN-INDEX) TO TEMP-OA-COL.
           MOVE D-SCN-ROW(SCN-INDEX) TO TEMP-OA-ROW.
           MOVE TEMP-OA TO ORDER-AREA OF AMUEM120-SCREEN.

           DISPLAY AND READ AMUEM120-SCREEN ON CRT
           PFKEYS 16, 32.

           PERFORM SAVE-OA-ROW-COL.

           IF PF-KEY = "16" THEN
               MOVE 0 TO MOD-ROW,
                         MOD-COL
               PERFORM SAVE-OA-ROW-COL
               GO TO EXIT-DISP-MENU-MAINTENANCE
           ELSE
           IF PF-KEY = "32" THEN
               GO TO EXIT-PROGRAM
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 6 THEN
               STRING "MENU ",MENU-ID DELIMITED BY SIZE
                 INTO REC-STAT-TEXT
               MOVE "    Menu Options" TO MENU-OPTIONS-SCREEN
               IF MENU-LOCKED
                   MOVE "                 Locked On" TO MOD-LOCK-ON-TEXT
                   MOVE "     Locked By" TO MOD-LOCK-BY-TEXT
               ELSE
                   MOVE "               Modified On" TO MOD-LOCK-ON-TEXT
                   MOVE "   Modified By" TO MOD-LOCK-BY-TEXT
               END-IF
               MOVE "AMUES121" TO SCREEN-NAME
               IF NOT-NEW
                   MOVE 1 TO MENU-RECORD
                   MOVE MENU-RECORD TO MREC-DEF-NUM
                   PERFORM READ-MENU-FILE-RECORD
                   MOVE MFILE-REST-OF-RECORD TO MENU-OPTS-RECORD
               END-IF
               PERFORM SET-DMO-FACS
               PERFORM DISPLAY-DMO-SCREEN THRU EXIT-DISPLAY-DMO-SCREEN
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 7 THEN
               STRING "MENU ",MENU-ID DELIMITED BY SIZE
                 INTO REC-STAT-TEXT
               MOVE SPACES TO AMUES122-MSEL-TABLE
               MOVE 1 TO SEL-CNT,
                         SUB1
               PERFORM LOAD-MSEL-SCREEN VARYING CNT1 FROM 1 BY 1
                   UNTIL CNT1 > 15
               IF NOT-NEW OR SEL-MAX > 0
                   MOVE 1 TO SEL-CNT
                   MOVE "BROWSE" TO CUR-ACCESS
               ELSE
                   PERFORM INSERT-MENU-SELECTION
                   MOVE "UPDATE" TO CUR-ACCESS
               END-IF
               MOVE 1 TO SCN-NUM
               PERFORM SET-MS-FACS
               MOVE 9 TO SCN-INDEX
               PERFORM DISPLAY-MS-SCREEN THRU EXIT-DISPLAY-MS-SCREEN
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 8 AND ACCESS-UPDATE AND
              NOT-NEW THEN
               IF MENU-LOCKED
                   MOVE "N" TO LOCKED-STATUS
               ELSE
                   MOVE "Y" TO LOCKED-STATUS
                   MOVE 1 TO MENU-RECORD
                   MOVE MENU-RECORD TO MREC-DEF-NUM
                   PERFORM READ-MENU-FILE-RECORD-HOLD
                   MOVE FORMAT-DATE TO MODIFIED-ON-DATE
                   MOVE EXT-USER-ID TO MODIFIED-BY-USER
                   MOVE MENU-OPTS-RECORD TO MFILE-REST-OF-RECORD
                   PERFORM REWRITE-MENU-FILE-RECORD
               END-IF 
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 9 AND
                   (IS-NEW OR MENU-NOTLOCKED) THEN
               IF IS-NEW
                   MOVE PLAIN-TEXT TO SAVE-ID-FAC
               ELSE
                   MOVE BR-MOD-UCL TO SAVE-EID-FAC
               END-IF
               PERFORM PROMPT-SAVE-MENU-ID THRU
                       EXIT-PROMPT-SAVE-MENU-ID
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 10 AND NOT-NEW THEN
               PERFORM SAVE-MS-TO-DISK
               MOVE SPACES TO REC-STAT-TEXT
               MOVE "N" TO RECORD-STAT
           ELSE
           IF PF-KEY = "00" AND MOD-ROW = 11 AND NOT-NEW THEN
               MOVE "N" TO DELETE-FLAG
               PERFORM PROMPT-DELETE-MENU-ID THRU
                       EXIT-PROMPT-DELETE-MENU-ID
               IF IS-DELETED
                   GO TO EXIT-DISP-MENU-MAINTENANCE
               END-IF 
           ELSE
               CALL "BELL" USING BELL-TIME.

           GO TO DISP-MENU-MAINTENANCE.

       EXIT-DISP-MENU-MAINTENANCE.
           EXIT.

       INIT-AMUEM120-SELECTIONS.
           IF IS-NEW
               MOVE SPACES TO AMUEM120-I3,
                              120-SUB-COL1-I3, 120-SUB-COL2-I3,
           ELSE
               IF MENU-NOTLOCKED
                   MOVE "Lock Menu From Updates" TO AMUEM120-I3
               ELSE
                   MOVE "UnLock Menu For Updates" TO AMUEM120-I3
               END-IF
               MOVE MENU-PICK TO 120-SUB-COL1-I3
               MOVE SUB-5     TO 120-SUB-COL2-I3
           END-IF
           MOVE "Create New Menu Definition" TO AMUEM120-I4
           MOVE MENU-PICK TO 120-SUB-COL1-I4
           MOVE SUB-5     TO 120-SUB-COL2-I4
           IF NOT-NEW
               MOVE "Replace Current Menu Definition" TO AMUEM120-I5
               MOVE "Delete Menu From File" TO AMUEM120-I6
               MOVE MENU-PICK TO 120-SUB-COL1-I5, 120-SUB-COL1-I6
               MOVE SUB-5     TO 120-SUB-COL2-I5, 120-SUB-COL2-I6
           ELSE
               MOVE SPACES TO AMUEM120-I5, AMUEM120-I6,
                              120-SUB-COL1-I5, 120-SUB-COL1-I6
                              120-SUB-COL2-I5, 120-SUB-COL2-I6
           END-IF.

       SAVE-CREATED-MENU.
           MOVE 1 TO MENU-RECORD.
           MOVE 1 TO SEL-CNT.
           PERFORM MOVE-MS-TABLE-TO-MS-DEF VARYING SUB1 FROM 1
               BY 1 UNTIL TSEQ(SEL-CNT) = SPACES OR SUB1 > 12.
           MOVE MENU-OPTS-RECORD TO MFILE-REST-OF-RECORD.
           MOVE MENU-RECORD TO MREC-DEF-NUM.
           PERFORM WRITE-MENU-FILE-RECORD.
           IF SEL-CNT < SEL-MAX
               PERFORM MOVE-REST-SELECTIONS VARYING MENU-RECORD FROM
                   2 BY 1 UNTIL SEL-CNT > SEL-MAX OR MENU-RECORD > 6.
           MOVE "N" TO CREATE-FLAG.

       SAVE-MS-TO-DISK.
           MOVE "Y" TO TEST-RECORD.
           MOVE 1 TO MENU-RECORD.
           MOVE 1 TO SEL-CNT.
           MOVE MENU-RECORD TO MREC-DEF-NUM.
           PERFORM READ-MENU-FILE-RECORD-HOLD.
           IF RECORD-EXISTS
               MOVE FORMAT-DATE TO MODIFIED-ON-DATE
               MOVE EXT-USER-ID TO MODIFIED-BY-USER
               MOVE SPACES TO MS-RECORD-DEFINITION
               PERFORM MOVE-MS-TABLE-TO-MS-DEF VARYING SUB1 FROM 1
                   BY 1 UNTIL TSEQ(SEL-CNT) = SPACES OR SUB1 > 12
               MOVE MENU-OPTS-RECORD TO MFILE-REST-OF-RECORD
               PERFORM REWRITE-MENU-FILE-RECORD
               PERFORM MOVE-REST-SELECTIONS VARYING MENU-RECORD FROM
                   2 BY 1 UNTIL RECORD-NOTEXISTS OR MENU-RECORD > 6.

       SETUP-MS-TABLE.
           MOVE SPACES TO MS-TABLE.
           MOVE 1 TO SEL-CNT.
           PERFORM MOVE-MS-DEF-TO-MS-TABLE VARYING SUB1 FROM 1 BY 1
               UNTIL MS-SEQ(SUB1) = SPACES OR SUB1 > 12.
           PERFORM GET-REST-SELECTIONS VARYING MENU-RECORD FROM
               2 BY 1 UNTIL RECORD-NOTEXISTS OR MENU-RECORD > 6.
           COMPUTE SEL-MAX = SEL-CNT - 1.

       GET-REST-SELECTIONS.
           MOVE MENU-RECORD TO MREC-DEF-NUM.
           PERFORM READ-MENU-FILE-RECORD.
           IF RECORD-EXISTS
               MOVE MFILE-REST-OF-RECORD TO MS-RECORD-DEFINITION
               PERFORM MOVE-MS-DEF-TO-MS-TABLE VARYING SUB1 FROM 1
                   BY 1 UNTIL MS-SEQ(SUB1) = SPACES OR SUB1 > 15.

       MOVE-REST-SELECTIONS.
           MOVE MENU-RECORD TO MREC-DEF-NUM.
           PERFORM READ-MENU-FILE-RECORD-HOLD.

           IF RECORD-EXISTS AND SEL-CNT > SEL-MAX
               PERFORM DELETE-MENU-FILE-RECORD
           ELSE IF RECORD-EXISTS
               MOVE SPACES TO MS-RECORD-DEFINITION
               PERFORM MOVE-MS-TABLE-TO-MS-DEF VARYING SUB1 FROM 1
                   BY 1 UNTIL TSEQ(SEL-CNT) = SPACES OR SUB1 > 15
               MOVE MS-RECORD-DEFINITION TO MFILE-REST-OF-RECORD
               PERFORM REWRITE-MENU-FILE-RECORD
           ELSE IF SEL-CNT < SEL-MAX
               MOVE SPACES TO MS-RECORD-DEFINITION
               PERFORM MOVE-MS-TABLE-TO-MS-DEF VARYING SUB1 FROM 1
                   BY 1 UNTIL TSEQ(SEL-CNT) = SPACES OR SUB1 > 15
               MOVE MS-RECORD-DEFINITION TO MFILE-REST-OF-RECORD
               PERFORM WRITE-MENU-FILE-RECORD.

       LOAD-MSEL-SCREEN.
           MOVE TSEQ(SUB1)         TO MSEL-SEQ(CNT1).
           MOVE TPOSN(SUB1)        TO MSEL-POSN(CNT1).
           MOVE TFUNCTION(SUB1)    TO MSEL-FUNC(CNT1).
           MOVE TPF(SUB1)          TO MSEL-PFKEY(CNT1).
           MOVE TDESCRIPTION(SUB1) TO MSEL-DESC(CNT1).
           MOVE PLAIN-TEXT TO     FAC OF 2S-MS-SEQ(CNT1),
                                  FAC OF 2S-MS-POSN(CNT1),
                                  FAC OF 2S-MS-FUNC(CNT1),
                                  FAC OF 2S-MS-AA(CNT1).
           IF DEF-MO-FORMAT = "C3"
               MOVE PLAIN-TEXT TO FAC OF C3-1S-MS-SEQ(CNT1),
                                  FAC OF C3-1S-MS-POSN(CNT1),              
                                  FAC OF C3-1S-MS-FUNC(CNT1),
                                  FAC OF C3-1S-MS-DESC(CNT1).
           IF DEF-MO-FORMAT = "P3"
               MOVE PLAIN-TEXT TO FAC OF P3-1S-MS-SEQ(CNT1),
                                  FAC OF P3-1S-MS-POSN(CNT1),              
                                  FAC OF P3-1S-MS-FUNC(CNT1),
                                  FAC OF P3-1S-MS-PFKEY(CNT1),
                                  FAC OF P3-1S-MS-DESC(CNT1).
           IF DEF-MO-FORMAT = "C2"
               MOVE PLAIN-TEXT TO FAC OF C2-1S-MS-SEQ(CNT1),
                                  FAC OF C2-1S-MS-POSN(CNT1),              
                                  FAC OF C2-1S-MS-FUNC(CNT1),
                                  FAC OF C2-1S-MS-DESC(CNT1).
           IF DEF-MO-FORMAT = "P2"
               MOVE PLAIN-TEXT TO FAC OF P2-1S-MS-SEQ(CNT1),
                                  FAC OF P2-1S-MS-POSN(CNT1),              
                                  FAC OF P2-1S-MS-FUNC(CNT1),
                                  FAC OF P2-1S-MS-PFKEY(CNT1),
                                  FAC OF P2-1S-MS-DESC(CNT1).
           IF DEF-MO-FORMAT = "C1"
               MOVE PLAIN-TEXT TO FAC OF C1-1S-MS-SEQ(CNT1),
                                  FAC OF C1-1S-MS-POSN(CNT1),              
                                  FAC OF C1-1S-MS-FUNC(CNT1),
                                  FAC OF C1-1S-MS-DESC(CNT1).
           IF DEF-MO-FORMAT = "P1"
               MOVE PLAIN-TEXT TO FAC OF P1-1S-MS-SEQ(CNT1),
                                  FAC OF P1-1S-MS-POSN(CNT1),              
                                  FAC OF P1-1S-MS-FUNC(CNT1),
                                  FAC OF P1-1S-MS-PFKEY(CNT1),
                                  FAC OF P1-1S-MS-DESC(CNT1).

           IF TFUNCTION(SUB1) = "<DFTEXT>"
               MOVE TWIDTH(SUB1)      TO 2S-WIDTH
               MOVE TJUSTIFY(SUB1)    TO 2S-JUSTIFY
               MOVE TLINE(SUB1)       TO 2S-LINE 
               MOVE TVIDEO(SUB1)      TO 2S-VIDEO
               MOVE TDF-PAR-OPT(SUB1) TO 2S-PAR-OPT
               MOVE PLAIN-TEXT TO 2S-WIDTH-FAC,
                                  2S-JUSTIFY-FAC,
                                  2S-LINE-FAC,
                                  2S-VIDEO-FAC,
                                  2S-PAROPT-FAC
               MOVE AA-DFTEXT         TO MSEL-AA(CNT1)
           ELSE
           IF TFUNC-MENU-ID-CHAR(SUB1,1) = "<"
               MOVE TEA-PASSWORD(SUB1) TO 2S-EA-PW
               MOVE TEA-SC(SUB1)       TO 2S-EA-SC
               MOVE TEA-PAR-OPT(SUB1)  TO 2S-EA-PAR-OPT
               MOVE BLANK-PRO  TO 2S-EA-PW-FAC
               MOVE PLAIN-TEXT TO 2S-EA-SC-FAC,
                                  2S-EA-PAROPT-FAC
               MOVE AA-EXIT-ACTION     TO MSEL-AA(CNT1)
           ELSE
           IF TFUNC-MENU-ID-CHAR(SUB1,1) = "("
               MOVE TSEC-CLASSES(SUB1)  TO 2S-SCLASSES
               MOVE PLAIN-TEXT TO 2S-SC-FAC
               MOVE AA-MENU             TO MSEL-AA(CNT1)
           ELSE
               MOVE TLIBRARY(SUB1)    TO 2S-LIB
               MOVE TVOLUME(SUB1)     TO 2S-VOL
               MOVE TPASSWORD(SUB1)   TO 2S-PP-PW
               MOVE TSECURITY-CLASS(SUB1) TO 2S-PP-SC
               MOVE TDHK(SUB1)        TO 2S-DHK
               MOVE TQRC(SUB1)        TO 2S-QRC
               MOVE TSLP(SUB1)        TO 2S-SLP
               MOVE TPAR-OPTION(SUB1) TO 2S-PP-PAR-OPT
               MOVE BLANK-PRO  TO 2S-PP-PW-FAC,
               MOVE PLAIN-TEXT TO 2S-VOL-FAC,
                                  2S-PP-SC-FAC,
                                  2S-DHK-FAC,
                                  2S-QRC-FAC,
                                  2S-SLP-FAC,
                                  2S-PP-PAROPT-FAC
               MOVE AA-PROG-PROC      TO MSEL-AA(CNT1)
               MOVE HOLD-FAC TO FAC OF 2S-MS-AA(CNT1).

           ADD 1 TO SUB1.

       MOVE-SCN-TO-MS-TABLE.
           MOVE MSEL-SEQ(CNT1)   TO TSEQ(SUB1).
           MOVE MSEL-POSN(CNT1)  TO TPOSN(SUB1).
           MOVE MSEL-FUNC(CNT1)  TO TFUNCTION(SUB1).
           MOVE MSEL-PFKEY(CNT1) TO TPF(SUB1).
           MOVE MSEL-DESC(CNT1)  TO TDESCRIPTION(SUB1).
           
           IF MSEL-FUNC(CNT1) = "<DFTEXT>"
               MOVE MSEL-AA(CNT1)     TO AA-DFTEXT
               MOVE 2S-WIDTH          TO TWIDTH(SUB1)
               MOVE 2S-JUSTIFY        TO TJUSTIFY(SUB1)
               MOVE 2S-LINE           TO TLINE(SUB1)
               MOVE 2S-VIDEO          TO TVIDEO(SUB1)
               MOVE 2S-PAR-OPT        TO TDF-PAR-OPT(SUB1)
           ELSE
           IF MSEL-FUNC-MENU-ID-CHAR(SUB1,1) = "<"
               MOVE MSEL-AA(CNT1)      TO AA-EXIT-ACTION
               MOVE 2S-EA-PW           TO TEA-PASSWORD(SUB1)
               MOVE 2S-EA-SC           TO TEA-SC(SUB1)
               MOVE 2S-EA-PAR-OPT      TO TEA-PAR-OPT(SUB1)
           ELSE
           IF MSEL-FUNC-MENU-ID-CHAR(SUB1,1) = "("
               MOVE MSEL-AA(CNT1)       TO AA-MENU
               MOVE 2S-SCLASSES         TO TSEC-CLASSES(SUB1)
           ELSE
               MOVE MSEL-AA(CNT1)     TO AA-PROG-PROC
               MOVE 2S-LIB            TO TLIBRARY(SUB1)
               MOVE 2S-VOL            TO TVOLUME(SUB1)
               MOVE 2S-PP-PW          TO TPASSWORD(SUB1)
               MOVE 2S-PP-SC          TO TSECURITY-CLASS(SUB1)
               MOVE 2S-DHK            TO TDHK(SUB1)
               MOVE 2S-QRC            TO TQRC(SUB1)
               MOVE 2S-SLP            TO TSLP(SUB1)
               MOVE 2S-PP-PAR-OPT     TO TPAR-OPTION(SUB1).

           ADD 1 TO SUB1.

       MOVE-MS-TABLE-TO-MS-DEF.
           IF TFUNCTION(SEL-CNT) NOT = MS-FUNC(SUB1)
               MOVE SPACES TO MS-DEFINITION(SUB1)
           END-IF
           MOVE TSEQ(SEL-CNT)      TO MS-SEQ(SUB1).
           MOVE TPOSN(SEL-CNT)     TO MS-POSN(SUB1).
           MOVE TFUNCTION(SEL-CNT) TO MS-FUNC(SUB1).
           MOVE TDESCRIPTION(SEL-CNT) TO MS-DESC(SUB1).
           IF TFUNCTION(SEL-CNT) = "<DFTEXT>"
               MOVE TWIDTH(SEL-CNT)   TO DF-WIDTH(SUB1)
               MOVE TJUSTIFY(SEL-CNT) TO DF-JUSTIFY(SUB1)
               MOVE TLINE(SEL-CNT)    TO DF-LINE(SUB1)
               MOVE TVIDEO(SEL-CNT)   TO DF-VIDEO(SUB1)
               MOVE TDF-PAR-OPT(SEL-CNT) TO MS-DF-PAR-OPT(SUB1)
           ELSE
           IF TFUNC-MENU-ID-CHAR(SEL-CNT,1) = "<"
               MOVE TPF(SEL-CNT)          TO MS-EA-PFKEY(SUB1)
               MOVE TEA-PASSWORD(SEL-CNT) TO MS-EA-PW(SUB1)
               MOVE TEA-SC(SEL-CNT)       TO MS-EA-SC(SUB1)
               MOVE TEA-PAR-OPT(SEL-CNT)  TO MS-EA-PAR-OPT(SUB1)
           ELSE
           IF TFUNC-MENU-ID-CHAR(SEL-CNT,1) = "("
               MOVE TPF(SEL-CNT)          TO MS-SC-PFKEY(SUB1)
               MOVE TSEC-CLASSES(SEL-CNT) TO MS-SECUR-CLASSES(SUB1)
           ELSE
               MOVE TLIBRARY(SEL-CNT)  TO MS-LIB(SUB1)
               MOVE TVOLUME(SEL-CNT)   TO MS-VOL(SUB1)
               MOVE TPF(SEL-CNT)       TO MS-PP-PFKEY(SUB1)
               MOVE TPASSWORD(SEL-CNT) TO MS-PP-PW(SUB1)
               MOVE TDHK(SEL-CNT)      TO MS-DHK(SUB1)
               MOVE TQRC(SEL-CNT)      TO MS-QRC(SUB1)
               MOVE TSECURITY-CLASS(SEL-CNT) TO MS-PP-SC(SUB1)
               MOVE TSLP(SEL-CNT)      TO MS-SLP(SUB1)
               MOVE TPAR-OPTION(SEL-CNT) TO MS-PP-PAR-OPT(SUB1).
     
           ADD 1 TO SEL-CNT.

       MOVE-MS-DEF-TO-MS-TABLE.
           MOVE MS-SEQ(SUB1)   TO TSEQ(SEL-CNT).
           MOVE MS-POSN(SUB1)  TO TPOSN(SEL-CNT).
           MOVE MS-FUNC(SUB1)  TO TFUNCTION(SEL-CNT).
           MOVE MS-DESC(SUB1)  TO TDESCRIPTION(SEL-CNT).
           IF MS-FUNC(SUB1) = "<DFTEXT>"
               MOVE DF-WIDTH(SUB1)   TO TWIDTH(SEL-CNT)
               MOVE DF-JUSTIFY(SUB1) TO TJUSTIFY(SEL-CNT)
               MOVE DF-LINE(SUB1)    TO TLINE(SEL-CNT)
               MOVE DF-VIDEO(SUB1)   TO TVIDEO(SEL-CNT)
               MOVE MS-DF-PAR-OPT(SUB1) TO TDF-PAR-OPT(SEL-CNT)
           ELSE
           IF FUNC-MENU-ID-CHAR(SUB1,1) = "<"
               MOVE MS-EA-PFKEY(SUB1) TO TPF(SEL-CNT)
               MOVE MS-EA-PW(SUB1) TO TEA-PASSWORD(SEL-CNT)
               MOVE MS-EA-SC(SUB1) TO TEA-SC(SEL-CNT)
               MOVE MS-EA-PAR-OPT(SUB1) TO TEA-PAR-OPT(SEL-CNT)
           ELSE
           IF FUNC-MENU-ID-CHAR(SUB1,1) = "("
               MOVE MS-SC-PFKEY(SUB1) TO TPF(SEL-CNT)
               MOVE MS-SECUR-CLASSES(SUB1) TO TSEC-CLASSES(SEL-CNT) 
           ELSE
               MOVE MS-LIB(SUB1)   TO TLIBRARY(SEL-CNT)
               MOVE MS-VOL(SUB1)   TO TVOLUME(SEL-CNT)
               MOVE MS-PP-PFKEY(SUB1) TO TPF(SEL-CNT)
               MOVE MS-PP-PW(SUB1) TO TPASSWORD(SEL-CNT)
               MOVE MS-DHK(SUB1)   TO TDHK(SEL-CNT)
               MOVE MS-QRC(SUB1)   TO TQRC(SEL-CNT)
               MOVE MS-PP-SC(SUB1) TO TSECURITY-CLASS(SEL-CNT)
               MOVE MS-SLP(SUB1)   TO TSLP(SEL-CNT)
               MOVE MS-PP-PAR-OPT(SUB1) TO TPAR-OPTION(SEL-CNT).
           ADD 1 TO SEL-CNT.

       MAINTAIN-A-MENU.
           MOVE SPACES TO REC-STAT-TEXT.
           MOVE "N" TO CHANGED-FLAG.
           MOVE "N" TO TEST-RECORD.
           MOVE SPACES TO MFILE-KEY.
           MOVE "MD" TO RECORD-TYPE
           MOVE MAIN-MENU-ID TO MENU-ID.
           MOVE "M1" TO MRECORD-DEF.
           PERFORM READ-MENU-FILE-RECORD.
           IF RECORD-EXISTS
               MOVE "N" TO CREATE-FLAG
               PERFORM DO-MAINTENANCE
           ELSE
               MOVE "Y" TO WSXIO-ERROR-FLAG
               CALL "BELL" USING BELL-TIME
               STRING "Menu ",MAIN-MENU-ID," does NOT exist"
                   DELIMITED BY SIZE INTO WSXIO-MAINTAIN-MESSAGE.

       DO-MAINTENANCE.
           MOVE MFILE-REST-OF-RECORD TO MENU-OPTS-RECORD.
           STRING "Maintain Menu ",MAIN-MENU-ID,
                  ": ",MENU-TITLE DELIMITED BY SIZE
               INTO MENU-ID-TITLE.
           IF NOT-NEW
               PERFORM SETUP-MS-TABLE.
           PERFORM DISP-MENU-MAINTENANCE THRU
               EXIT-DISP-MENU-MAINTENANCE.
           IF DO-WRITE
               PERFORM READ-MENU-FILE-RECORD-HOLD
               MOVE MENU-OPTS-RECORD TO MFILE-REST-OF-RECORD
               PERFORM REWRITE-MENU-FILE-RECORD.

       PROMPT-DELETE-MENU-ID.
           MOVE WSXIO-WRITE TO WSXIO-CMD.
           MOVE A-20-BYTE   TO WSXIO-O-A-1.
           MOVE A-160-BYTE  TO WSXIO-O-A-2.
           MOVE A-0-BYTE   TO WSXIO-O-A-3.
           MOVE A-20-BYTE   TO WSXIO-O-A-4.
           MOVE 320 TO S2-LEN.
           MOVE "X" TO WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-DELETE-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE WSXIO-READ TO WSXIO-CMD.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB,
                              WSXIO-CMD, WSXIO-ORDER-AREA,
                              WSXIO-O-A-LENGTH, WSXIO-DELETE-SCREEN,
                              WSXIO-SCREEN-LENGTH, WSXIO-TIMEOUT-SEC,
                              WSXIO-TIMEOUT-HSEC, WSXIO-IOSW, WSXIO-AID.
           MOVE "A" TO WSXIO-FUNCTION.
           CALL "WSXIO" USING WSXIO-FUNCTION, WSXIO-UFB, WSXIO-AID.

           IF WSXIO-AID = "A" THEN
               MOVE "N" TO DELETE-FLAG
           ELSE
           IF WSXIO-AID = "@" THEN
               MOVE "Y" TO TEST-RECORD
               PERFORM DELETE-ALL-MENU-RECORDS VARYING MENU-RECORD FROM
                   1 BY 1 UNTIL RECORD-NOTEXISTS OR MENU-RECORD > 6
               MOVE "Y" TO DELETE-FLAG
           ELSE
               CALL "BELL" USING BELL-TIME
               GO TO PROMPT-DELETE-MENU-ID.

       EXIT-PROMPT-DELETE-MENU-ID.
           EXIT.

       DELETE-ALL-MENU-RECORDS.
           MOVE MENU-RECORD TO MREC-DEF-NUM.
           PERFORM DELETE-MENU-FILE-RECORD.

       SCROLL-UP.
           DISPLAY "NOT implemented yet.".
