000000 01  VAL-NAME    PIC X(8).
000000 01  FILLER REDEFINES VAL-NAME.
000000     05  VAL-CHAR  PIC X
000000         OCCURS 8 TIMES.
000000
000000 01  VAL-RC     PIC 99.
000000


