000200 OPEN-CRT-FILE.
000300     OPEN I-O CRT-FILE.
000400 CLOSE-CRT-FILE.
000500     CLOSE CRT-FILE.
000000 SAVE-CURSOR-POS.
000000     MOVE CRT-COL-POS-BYTE TO CRT-POS-COL.
000000     MOVE CRT-ROW-POS-BYTE TO CRT-POS-ROW.
000000
