000100 01  SCRATCH-VALUES.
000200     05  SCRATCH-TYPE                    PIC X(01) VALUE "F".
000300     05  SCRATCH-FILE-NAME               PIC X(08) VALUE SPACES.
000400     05  SCRATCH-FILE-LIBRARY            PIC X(08) VALUE SPACES.
000500     05  SCRATCH-FILE-VOLUME             PIC X(06) VALUE SPACES.
000600 01  SCRATCH-RETURN-CODE.
000700     05  SCRATCH-RETURN-CODE-1       BINARY VALUE ZEROES.
000800     05  SCRATCH-RETURN-CODE-2       BINARY VALUE ZEROES.
000900
