000100 01  TRACE-BLOCK       PIC X(81) VALUE SPACE.
000200 01  FILLER REDEFINES TRACE-BLOCK.
000300     05  TRACE-MODULE  PIC X.
000400     05  TRACE-PARA    PIC X.
000500     05  TRACE-RECORD.
000600         10  MOD-ULE     PIC X(9).
000700         10  TRACE-DATA.
000800             15  PARA-GRAPH  PIC X(31).
000900             15  TRACE-FIELD PIC X(39).
001000
001100
