000100 DISPLAY-PRINT-FILE.
000200     MOVE "P" TO DISPLAY-TYPE.
000000     MOVE SPACE TO DISPLAY-SYS-NAME.
000300     MOVE ZEROES TO DISPLAY-RETURN-CODE.
000500     PERFORM CALL-DISPLAY.
000600
001800
001900 CALL-DISPLAY.
002000     CALL "KDISP" USING
002100         DISPLAY-FILE-SPEC
000000         DISPLAY-TYPE
000000         DISPLAY-RETURN-CODE.
000000
