000100     05  FILLER     PIC X(79) ROW 1 COLUMN 2
000200     SOURCE EM-LINE-1.
000300     05  FILLER     PIC X(79) ROW 2 COLUMN 2
000400     SOURCE EM-LINE-2.
000500     05  FILLER     PIC X(79) ROW 3 COLUMN 2
000600     SOURCE EM-LINE-3.
000500     05  FILLER     PIC X(79) ROW 4 COLUMN 2
000600     SOURCE EM-LINE-4.
000700     05  FILLER  PIC X(79) ROW 6 COLUMN 2
000800     SOURCE EM-LINE-6.

