
000000 01  BUBBLE-CHANGES-FLAG PIC X VALUE SPACE.
000000     88  BUBBLE-HAS-CHANGED    VALUE "Y".
000000     88  BUBBLE-HAS-NOT-CHANGED VALUE SPACE.
000000 01  BUBBLE-SWAP-FLAG    PIC X VALUE SPACE.
000000
000000 01  BUBBLE-1ST     BINARY VALUE ZEROES.
000000 01  BUBBLE-2ND     BINARY VALUE ZEROES.
000000 01  BUBBLE-LAST    BINARY VALUE ZEROES.
000000
000000 01  BUBBLE-HOLD-AREA PIC X(2048).

