000000 01  DISPLAY-FILE-SPEC.
002000     05  DISPLAY-FILE       PIC X(8).
002200     05  DISPLAY-LIBRARY    PIC X(8).
002400     05  DISPLAY-VOLUME     PIC X(6).
002500     05  DISPLAY-SYS-NAME   PIC X(81).
000000
002800 01  DISPLAY-TYPE           PIC X.
000000 01  DISPLAY-RETURN-CODE    PIC 99.
