000100**   Copyright (c) Shell Stream Software LLC, All rights reserved.
000200**   $Id:$
000300**
000400**   File:       W@FILESTATUSCHECK.cob
000500**
000600**   Project:    WISP Acucobol
000700**
000800**   Purpose:    Declaratives File Status Checking
000900**
001000**   Build:      ccbl W@FILESTATUSCHECK.cob
001100**
001200**
001300
001400 IDENTIFICATION DIVISION.
001500 PROGRAM-ID. "W@FILESTATUSCHECK".
001600
001700 ENVIRONMENT DIVISION.
001800 CONFIGURATION SECTION.
001900
002000 DATA DIVISION.
002100
002200 WORKING-STORAGE SECTION.
002300
002400
002500 LINKAGE SECTION.
002600 01  FILE-OPERATION          PIC X(20).
002700 01  FILE-STATUS             PIC X(2).
002800 01  FILE-STATUS-EXTENDED    PIC X(10).
002900 01  FILE-ATTRIBUTES         PIC X(10).
003000 01  FILE-VOL                PIC X(6).
003100 01  FILE-LIB                PIC X(8).
003200 01  FILE-FILE               PIC X(8).
003300 01  FILE-PATH               PIC X(80).
003400 01  SELECT-NAME             PIC X(40).
003500 01  APP-NAME                PIC X(40).
003600 01  SKIP-DECLARATIVES       PIC X.
003700 01  HAS-DECLARATIVES        PIC X.
003800
003900
004000
004100 PROCEDURE DIVISION USING
004200         FILE-OPERATION
004300         FILE-STATUS
004400         FILE-STATUS-EXTENDED
004500         FILE-ATTRIBUTES
004600         FILE-VOL
004700         FILE-LIB
004800         FILE-FILE
004900         FILE-PATH
005000         SELECT-NAME
005100         APP-NAME
005200         SKIP-DECLARATIVES
005300         HAS-DECLARATIVES.
005400
005500 MAIN SECTION.
005600
005700     IF (FILE-OPERATION = "ReadLock" OR
005800         FILE-OPERATION = "ReadNextLock") AND
005900         FILE-STATUS = "99"
006000     THEN
006100         MOVE "Y" TO SKIP-DECLARATIVES
006200         GO TO EXIT-PROGRAM
006300     END-IF.
006400
006500     CALL "WFILECHK3" USING
006600         FILE-OPERATION
006700         FILE-STATUS
006800         FILE-STATUS-EXTENDED
006900         FILE-ATTRIBUTES
007000         FILE-VOL
007100         FILE-LIB
007200         FILE-FILE
007300         FILE-PATH
007400         SELECT-NAME
007500         APP-NAME
007600         SKIP-DECLARATIVES
007700         HAS-DECLARATIVES.
007800
007900 EXIT-PROGRAM.
008000     EXIT PROGRAM.
008100
