000100**   Copyright (c) 1997-2002 NeoMedia Technologies, All rights reserved.
000200**   $Id:$
000300**
000400**   File:       WACUWSB.cob
000500**
000600**   Project:    WISP for Acucobol with Native Screens
000700**
000800**   Purpose:    Display a WISP WSB screen
000900**
001000**   Build:      ccbl -Da4 -o WACUWSB.acu WACUWSB.cob
001100**
001200**
001300
001400 IDENTIFICATION DIVISION.
001500 PROGRAM-ID.  WACUWSB IS INITIAL.
001600 ENVIRONMENT DIVISION.
001700 CONFIGURATION SECTION.
001800 SPECIAL-NAMES.
001900     CURSOR         IS WISP-CURSOR
002000     CRT STATUS     IS WISP-CRT-STATUS
002100     SCREEN CONTROL IS WISP-SCREEN-CONTROL.
002200
002300 DATA DIVISION.
002400
002500 WORKING-STORAGE SECTION.
002600*    Special-names CURSOR clause.
002700 01  WISP-CURSOR.
002800     05  WISP-CURSOR-LINE    PIC 999 VALUE 1.
002900     05  WISP-CURSOR-COL     PIC 999 VALUE 1.
003000
003100*    Special-names CRT STATUS clause.
003200 01  WISP-CRT-STATUS.
003300     05  WISP-CRT-KEY-1               PIC X.
003400         88  WISP-CRT-STATUS-TERMINATED  VALUE '0'.
003500         88  WISP-CRT-STATUS-EXCEPTION   VALUE '1'.
003600         88  WISP-CRT-STATUS-EOF         VALUE '2'.
003700         88  WISP-CRT-STATUS-TIMEOUT     VALUE '3'.
003800         88  WISP-CRT-STATUS-NOITEM      VALUE '9'.
003900     05  WISP-CRT-KEY-EXCEPTION       PIC X COMP-X.
004000         88  WISP-CRT-EX-HELP            VALUE 33.
004100         88  WISP-CRT-EX-GETKEY          VALUE 34.
004200         88  WISP-CRT-KEY-AUTOSKIP       VALUE 49.
004300     05  WISP-CRT-KEY-3               PIC X COMP-X.
004400         88  WISP-CRT-KEY-TAB            VALUE  9.
004500         88  WISP-CRT-KEY-ENTER          VALUE 13.
004600
004700*    Special-names SCREEN CONTROL clause.
004800 01  WISP-SCREEN-CONTROL.
004900     05  WISP-ACCEPT-CONTROL     PIC 9   VALUE 0.
005000     05  WISP-CONTROL-VALUE      PIC 999 VALUE 1.
005100     05  WISP-CONTROL-HANDLE     USAGE HANDLE.
005200     05  WISP-CONTROL-ID         PIC XX COMP-X.
005300
005400*    WISP workstation working items.
005500 01  WISP-PFKEY                 PIC 99.
005600     88  WISP-PFKEY-ENTER       VALUE  0.
005700     88  WISP-PFKEY-HELP        VALUE 33.
005800     88  WISP-PFKEY-INVALID     VALUE 99.
005900
006000*    WISP DISPLAY AND READ working items.
006100 01  WISP-ALLOWABLE-PF-KEYS-CNT PIC 99.
006200
006300 01  WISP-DNR-DONE-FLAG        PIC X.
006400     88  WISP-DNR-DONE         VALUE "Y".
006500     88  WISP-DNR-NOT-DONE     VALUE "N".
006600
006700 01  CONTROL-FLAGS.
006800     05  V-01                PIC X(20) VALUE "OFF".
006900     05  V-02                PIC X(20) VALUE "OFF".
007000     05  V-03                PIC X(20) VALUE "OFF".
007100     05  V-04                PIC X(20) VALUE "OFF".
007200     05  V-05                PIC X(20) VALUE "OFF".
007300     05  V-06                PIC X(20) VALUE "OFF".
007400     05  V-07                PIC X(20) VALUE "OFF".
007500     05  V-08                PIC X(20) VALUE "OFF".
007600     05  V-09                PIC X(20) VALUE "OFF".
007700     05  V-10                PIC X(20) VALUE "OFF".
007800     05  V-11                PIC X(20) VALUE "OFF".
007900     05  V-12                PIC X(20) VALUE "OFF".
008000     05  V-13                PIC X(20) VALUE "OFF".
008100     05  V-14                PIC X(20) VALUE "OFF".
008200     05  V-15                PIC X(20) VALUE "OFF".
008300     05  V-16                PIC X(20) VALUE "OFF".
008400     05  V-17                PIC X(20) VALUE "OFF".
008500     05  V-18                PIC X(20) VALUE "OFF".
008600     05  V-19                PIC X(20) VALUE "OFF".
008700     05  V-20                PIC X(20) VALUE "OFF".
008800     05  V-21                PIC X(20) VALUE "OFF".
008900     05  V-22                PIC X(20) VALUE "OFF".
009000     05  V-23                PIC X(20) VALUE "OFF".
009100     05  V-24                PIC X(20) VALUE "OFF".
009200     05  V-25                PIC X(20) VALUE "OFF".
009300     05  V-26                PIC X(20) VALUE "OFF".
009400     05  V-27                PIC X(20) VALUE "OFF".
009500     05  V-28                PIC X(20) VALUE "OFF".
009600     05  V-29                PIC X(20) VALUE "OFF".
009700     05  V-30                PIC X(20) VALUE "OFF".
009800     05  V-31                PIC X(20) VALUE "OFF".
009900     05  V-32                PIC X(20) VALUE "OFF".
009901     05  V-33                PIC X(20) VALUE "OFF".
009902     05  V-34                PIC X(20) VALUE "OFF".
009903     05  V-35                PIC X(20) VALUE "OFF".
009904     05  V-36                PIC X(20) VALUE "OFF".
009905     05  V-37                PIC X(20) VALUE "OFF".
009906     05  V-38                PIC X(20) VALUE "OFF".
009907     05  V-39                PIC X(20) VALUE "OFF".
009908     05  V-40                PIC X(20) VALUE "OFF".
010000 01  REDEFINES CONTROL-FLAGS.
010100     05  V-XX OCCURS 40      PIC X(20).
010200
010300 78  WCLR-PROTECT     VALUE 32768.
010400
010500 01  COLOR-FLAGS.
010600     05  K-01                PIC 9(5) VALUE WCLR-PROTECT.
010700     05  K-02                PIC 9(5) VALUE WCLR-PROTECT.
010800     05  K-03                PIC 9(5) VALUE WCLR-PROTECT.
010900     05  K-04                PIC 9(5) VALUE WCLR-PROTECT.
011000     05  K-05                PIC 9(5) VALUE WCLR-PROTECT.
011100     05  K-06                PIC 9(5) VALUE WCLR-PROTECT.
011200     05  K-07                PIC 9(5) VALUE WCLR-PROTECT.
011300     05  K-08                PIC 9(5) VALUE WCLR-PROTECT.
011400     05  K-09                PIC 9(5) VALUE WCLR-PROTECT.
011500     05  K-10                PIC 9(5) VALUE WCLR-PROTECT.
011600     05  K-11                PIC 9(5) VALUE WCLR-PROTECT.
011700     05  K-12                PIC 9(5) VALUE WCLR-PROTECT.
011800     05  K-13                PIC 9(5) VALUE WCLR-PROTECT.
011900     05  K-14                PIC 9(5) VALUE WCLR-PROTECT.
012000     05  K-15                PIC 9(5) VALUE WCLR-PROTECT.
012100     05  K-16                PIC 9(5) VALUE WCLR-PROTECT.
012200     05  K-17                PIC 9(5) VALUE WCLR-PROTECT.
012300     05  K-18                PIC 9(5) VALUE WCLR-PROTECT.
012400     05  K-19                PIC 9(5) VALUE WCLR-PROTECT.
012500     05  K-20                PIC 9(5) VALUE WCLR-PROTECT.
012600     05  K-21                PIC 9(5) VALUE WCLR-PROTECT.
012700     05  K-22                PIC 9(5) VALUE WCLR-PROTECT.
012800     05  K-23                PIC 9(5) VALUE WCLR-PROTECT.
012900     05  K-24                PIC 9(5) VALUE WCLR-PROTECT.
013000     05  K-25                PIC 9(5) VALUE WCLR-PROTECT.
013100     05  K-26                PIC 9(5) VALUE WCLR-PROTECT.
013200     05  K-27                PIC 9(5) VALUE WCLR-PROTECT.
013300     05  K-28                PIC 9(5) VALUE WCLR-PROTECT.
013400     05  K-29                PIC 9(5) VALUE WCLR-PROTECT.
013500     05  K-30                PIC 9(5) VALUE WCLR-PROTECT.
013600     05  K-31                PIC 9(5) VALUE WCLR-PROTECT.
013700     05  K-32                PIC 9(5) VALUE WCLR-PROTECT.
013701     05  K-33                PIC 9(5) VALUE WCLR-PROTECT.
013702     05  K-34                PIC 9(5) VALUE WCLR-PROTECT.
013703     05  K-35                PIC 9(5) VALUE WCLR-PROTECT.
013704     05  K-36                PIC 9(5) VALUE WCLR-PROTECT.
013705     05  K-37                PIC 9(5) VALUE WCLR-PROTECT.
013706     05  K-38                PIC 9(5) VALUE WCLR-PROTECT.
013707     05  K-39                PIC 9(5) VALUE WCLR-PROTECT.
013708     05  K-40                PIC 9(5) VALUE WCLR-PROTECT.
013800 01  REDEFINES COLOR-FLAGS.
013900     05  K-XX OCCURS 40      PIC 9(5).
014000
014100 01  IDX1                    PIC 99.
014200
014300 LINKAGE SECTION.
014400 01  STATIC-TEXT             PIC X(1920).
014500 01  FILLER REDEFINES STATIC-TEXT.
014600     05  STATIC-TEXT-LINES   PIC X(80) OCCURS 24.
014700 01  FIELD-CNT               UNSIGNED-SHORT.
014800 01  FIELD-TABLE.
014900     05  OCCURS 40.
015000         10  FIELD-ROW       UNSIGNED-SHORT.
015100         10  FIELD-COL       UNSIGNED-SHORT.
015200         10  FIELD-LEN       UNSIGNED-SHORT.
015300         10  FIELD-FAC       PIC X COMP-X.
015400         10  FIELD-DATA      PIC X(79).
015500 01  FILLER REDEFINES FIELD-TABLE.
015600
015700     05  R-01                UNSIGNED-SHORT.
015800     05  C-01                UNSIGNED-SHORT.
015900     05  L-01                UNSIGNED-SHORT.
016000     05  F-01                PIC X COMP-X.
016100     05  D-01                PIC X(79).
016200
016300     05  R-02                UNSIGNED-SHORT.
016400     05  C-02                UNSIGNED-SHORT.
016500     05  L-02                UNSIGNED-SHORT.
016600     05  F-02                PIC X COMP-X.
016700     05  D-02                PIC X(79).
016800
016900     05  R-03                UNSIGNED-SHORT.
017000     05  C-03                UNSIGNED-SHORT.
017100     05  L-03                UNSIGNED-SHORT.
017200     05  F-03                PIC X COMP-X.
017300     05  D-03                PIC X(79).
017400
017500     05  R-04                UNSIGNED-SHORT.
017600     05  C-04                UNSIGNED-SHORT.
017700     05  L-04                UNSIGNED-SHORT.
017800     05  F-04                PIC X COMP-X.
017900     05  D-04                PIC X(79).
018000
018100     05  R-05                UNSIGNED-SHORT.
018200     05  C-05                UNSIGNED-SHORT.
018300     05  L-05                UNSIGNED-SHORT.
018400     05  F-05                PIC X COMP-X.
018500     05  D-05                PIC X(79).
018600
018700     05  R-06                UNSIGNED-SHORT.
018800     05  C-06                UNSIGNED-SHORT.
018900     05  L-06                UNSIGNED-SHORT.
019000     05  F-06                PIC X COMP-X.
019100     05  D-06                PIC X(79).
019200
019300     05  R-07                UNSIGNED-SHORT.
019400     05  C-07                UNSIGNED-SHORT.
019500     05  L-07                UNSIGNED-SHORT.
019600     05  F-07                PIC X COMP-X.
019700     05  D-07                PIC X(79).
019800
019900     05  R-08                UNSIGNED-SHORT.
020000     05  C-08                UNSIGNED-SHORT.
020100     05  L-08                UNSIGNED-SHORT.
020200     05  F-08                PIC X COMP-X.
020300     05  D-08                PIC X(79).
020400
020500     05  R-09                UNSIGNED-SHORT.
020600     05  C-09                UNSIGNED-SHORT.
020700     05  L-09                UNSIGNED-SHORT.
020800     05  F-09                PIC X COMP-X.
020900     05  D-09                PIC X(79).
021000
021100     05  R-10                UNSIGNED-SHORT.
021200     05  C-10                UNSIGNED-SHORT.
021300     05  L-10                UNSIGNED-SHORT.
021400     05  F-10                PIC X COMP-X.
021500     05  D-10                PIC X(79).
021600
021700     05  R-11                UNSIGNED-SHORT.
021800     05  C-11                UNSIGNED-SHORT.
021900     05  L-11                UNSIGNED-SHORT.
022000     05  F-11                PIC X COMP-X.
022100     05  D-11                PIC X(79).
022200
022300     05  R-12                UNSIGNED-SHORT.
022400     05  C-12                UNSIGNED-SHORT.
022500     05  L-12                UNSIGNED-SHORT.
022600     05  F-12                PIC X COMP-X.
022700     05  D-12                PIC X(79).
022800
022900     05  R-13                UNSIGNED-SHORT.
023000     05  C-13                UNSIGNED-SHORT.
023100     05  L-13                UNSIGNED-SHORT.
023200     05  F-13                PIC X COMP-X.
023300     05  D-13                PIC X(79).
023400
023500     05  R-14                UNSIGNED-SHORT.
023600     05  C-14                UNSIGNED-SHORT.
023700     05  L-14                UNSIGNED-SHORT.
023800     05  F-14                PIC X COMP-X.
023900     05  D-14                PIC X(79).
024000
024100     05  R-15                UNSIGNED-SHORT.
024200     05  C-15                UNSIGNED-SHORT.
024300     05  L-15                UNSIGNED-SHORT.
024400     05  F-15                PIC X COMP-X.
024500     05  D-15                PIC X(79).
024600
024700     05  R-16                UNSIGNED-SHORT.
024800     05  C-16                UNSIGNED-SHORT.
024900     05  L-16                UNSIGNED-SHORT.
025000     05  F-16                PIC X COMP-X.
025100     05  D-16                PIC X(79).
025200
025300     05  R-17                UNSIGNED-SHORT.
025400     05  C-17                UNSIGNED-SHORT.
025500     05  L-17                UNSIGNED-SHORT.
025600     05  F-17                PIC X COMP-X.
025700     05  D-17                PIC X(79).
025800
025900     05  R-18                UNSIGNED-SHORT.
026000     05  C-18                UNSIGNED-SHORT.
026100     05  L-18                UNSIGNED-SHORT.
026200     05  F-18                PIC X COMP-X.
026300     05  D-18                PIC X(79).
026400
026500     05  R-19                UNSIGNED-SHORT.
026600     05  C-19                UNSIGNED-SHORT.
026700     05  L-19                UNSIGNED-SHORT.
026800     05  F-19                PIC X COMP-X.
026900     05  D-19                PIC X(79).
027000
027100     05  R-20                UNSIGNED-SHORT.
027200     05  C-20                UNSIGNED-SHORT.
027300     05  L-20                UNSIGNED-SHORT.
027400     05  F-20                PIC X COMP-X.
027500     05  D-20                PIC X(79).
027600
027700     05  R-21                UNSIGNED-SHORT.
027800     05  C-21                UNSIGNED-SHORT.
027900     05  L-21                UNSIGNED-SHORT.
028000     05  F-21                PIC X COMP-X.
028100     05  D-21                PIC X(79).
028200
028300     05  R-22                UNSIGNED-SHORT.
028400     05  C-22                UNSIGNED-SHORT.
028500     05  L-22                UNSIGNED-SHORT.
028600     05  F-22                PIC X COMP-X.
028700     05  D-22                PIC X(79).
028800
028900     05  R-23                UNSIGNED-SHORT.
029000     05  C-23                UNSIGNED-SHORT.
029100     05  L-23                UNSIGNED-SHORT.
029200     05  F-23                PIC X COMP-X.
029300     05  D-23                PIC X(79).
029400
029500     05  R-24                UNSIGNED-SHORT.
029600     05  C-24                UNSIGNED-SHORT.
029700     05  L-24                UNSIGNED-SHORT.
029800     05  F-24                PIC X COMP-X.
029900     05  D-24                PIC X(79).
030000
030100     05  R-25                UNSIGNED-SHORT.
030200     05  C-25                UNSIGNED-SHORT.
030300     05  L-25                UNSIGNED-SHORT.
030400     05  F-25                PIC X COMP-X.
030500     05  D-25                PIC X(79).
030600
030700     05  R-26                UNSIGNED-SHORT.
030800     05  C-26                UNSIGNED-SHORT.
030900     05  L-26                UNSIGNED-SHORT.
031000     05  F-26                PIC X COMP-X.
031100     05  D-26                PIC X(79).
031200
031300     05  R-27                UNSIGNED-SHORT.
031400     05  C-27                UNSIGNED-SHORT.
031500     05  L-27                UNSIGNED-SHORT.
031600     05  F-27                PIC X COMP-X.
031700     05  D-27                PIC X(79).
031800
031900     05  R-28                UNSIGNED-SHORT.
032000     05  C-28                UNSIGNED-SHORT.
032100     05  L-28                UNSIGNED-SHORT.
032200     05  F-28                PIC X COMP-X.
032300     05  D-28                PIC X(79).
032400
032500     05  R-29                UNSIGNED-SHORT.
032600     05  C-29                UNSIGNED-SHORT.
032700     05  L-29                UNSIGNED-SHORT.
032800     05  F-29                PIC X COMP-X.
032900     05  D-29                PIC X(79).
033000
033100     05  R-30                UNSIGNED-SHORT.
033200     05  C-30                UNSIGNED-SHORT.
033300     05  L-30                UNSIGNED-SHORT.
033400     05  F-30                PIC X COMP-X.
033500     05  D-30                PIC X(79).
033600
033700     05  R-31                UNSIGNED-SHORT.
033800     05  C-31                UNSIGNED-SHORT.
033900     05  L-31                UNSIGNED-SHORT.
034000     05  F-31                PIC X COMP-X.
034100     05  D-31                PIC X(79).
034200
034300     05  R-32                UNSIGNED-SHORT.
034400     05  C-32                UNSIGNED-SHORT.
034500     05  L-32                UNSIGNED-SHORT.
034600     05  F-32                PIC X COMP-X.
034700     05  D-32                PIC X(79).
034701
034702     05  R-33                UNSIGNED-SHORT.
034703     05  C-33                UNSIGNED-SHORT.
034704     05  L-33                UNSIGNED-SHORT.
034705     05  F-33                PIC X COMP-X.
034706     05  D-33                PIC X(79).
034707
034708     05  R-34                UNSIGNED-SHORT.
034709     05  C-34                UNSIGNED-SHORT.
034710     05  L-34                UNSIGNED-SHORT.
034711     05  F-34                PIC X COMP-X.
034712     05  D-34                PIC X(79).
034713
034714     05  R-35                UNSIGNED-SHORT.
034715     05  C-35                UNSIGNED-SHORT.
034716     05  L-35                UNSIGNED-SHORT.
034717     05  F-35                PIC X COMP-X.
034718     05  D-35                PIC X(79).
034719
034720     05  R-36                UNSIGNED-SHORT.
034721     05  C-36                UNSIGNED-SHORT.
034722     05  L-36                UNSIGNED-SHORT.
034723     05  F-36                PIC X COMP-X.
034724     05  D-36                PIC X(79).
034725
034726     05  R-37                UNSIGNED-SHORT.
034727     05  C-37                UNSIGNED-SHORT.
034728     05  L-37                UNSIGNED-SHORT.
034729     05  F-37                PIC X COMP-X.
034730     05  D-37                PIC X(79).
034731
034732     05  R-38                UNSIGNED-SHORT.
034733     05  C-38                UNSIGNED-SHORT.
034734     05  L-38                UNSIGNED-SHORT.
034735     05  F-38                PIC X COMP-X.
034736     05  D-38                PIC X(79).
034737
034738     05  R-39                UNSIGNED-SHORT.
034739     05  C-39                UNSIGNED-SHORT.
034740     05  L-39                UNSIGNED-SHORT.
034741     05  F-39                PIC X COMP-X.
034742     05  D-39                PIC X(79).
034743
034744     05  R-40                UNSIGNED-SHORT.
034745     05  C-40                UNSIGNED-SHORT.
034746     05  L-40                UNSIGNED-SHORT.
034747     05  F-40                PIC X COMP-X.
034748     05  D-40                PIC X(79).
034800
034900 01  KEY-LIST.
035000     05  KEY-ITEM            PIC 99 OCCURS 40.
035100 01  KEY-CNT                 UNSIGNED-SHORT.
035200 01  TERM-KEY                UNSIGNED-SHORT.
035210 01  CURSOR-ROW              UNSIGNED-SHORT.
035220 01  CURSOR-COL              UNSIGNED-SHORT.
035221 01  SOUND_ALARM             UNSIGNED-SHORT.
035222 01  TIMEOUT_HSECS           UNSIGNED-SHORT.
035300
035400 SCREEN SECTION.
035500
035600 01  STATIC-TEXT-SCREEN.
035700     05  LINE 0.
035800     05  LINE PLUS 1 COL 1 PIC X(80) OCCURS 24
035900         FROM STATIC-TEXT-LINES.
036000
036100 01  ENTRY-FIELDS-SCREEN.
036200
036300     05  USING   D-01
036400         LINE    R-01
036500         COL     C-01
036600         SIZE    L-01
036700         COLOR   K-01
036800         CONTROL V-01.
036900
037000     05  USING   D-02
037100         LINE    R-02
037200         COL     C-02
037300         SIZE    L-02
037400         COLOR   K-02
037500         CONTROL V-02.
037600
037700     05  USING   D-03
037800         LINE    R-03
037900         COL     C-03
038000         SIZE    L-03
038100         COLOR   K-03
038200         CONTROL V-03.
038300
038400     05  USING   D-04
038500         LINE    R-04
038600         COL     C-04
038700         SIZE    L-04
038800         COLOR   K-04
038900         CONTROL V-04.
039000
039100     05  USING   D-05
039200         LINE    R-05
039300         COL     C-05
039400         SIZE    L-05
039500         COLOR   K-05
039600         CONTROL V-05.
039700
039800     05  USING   D-06
039900         LINE    R-06
040000         COL     C-06
040100         SIZE    L-06
040200         COLOR   K-06
040300         CONTROL V-06.
040400
040500     05  USING   D-07
040600         LINE    R-07
040700         COL     C-07
040800         SIZE    L-07
040900         COLOR   K-07
041000         CONTROL V-07.
041100
041200     05  USING   D-08
041300         LINE    R-08
041400         COL     C-08
041500         SIZE    L-08
041600         COLOR   K-08
041700         CONTROL V-08.
041800
041900     05  USING   D-09
042000         LINE    R-09
042100         COL     C-09
042200         SIZE    L-09
042300         COLOR   K-09
042400         CONTROL V-09.
042500
042600     05  USING   D-10
042700         LINE    R-10
042800         COL     C-10
042900         SIZE    L-10
043000         COLOR   K-10
043100         CONTROL V-10.
043200
043300     05  USING   D-11
043400         LINE    R-11
043500         COL     C-11
043600         SIZE    L-11
043700         COLOR   K-11
043800         CONTROL V-11.
043900
044000     05  USING   D-12
044100         LINE    R-12
044200         COL     C-12
044300         SIZE    L-12
044400         COLOR   K-12
044500         CONTROL V-12.
044600
044700     05  USING   D-13
044800         LINE    R-13
044900         COL     C-13
045000         SIZE    L-13
045100         COLOR   K-13
045200         CONTROL V-13.
045300
045400     05  USING   D-14
045500         LINE    R-14
045600         COL     C-14
045700         SIZE    L-14
045800         COLOR   K-14
045900         CONTROL V-14.
046000
046100     05  USING   D-15
046200         LINE    R-15
046300         COL     C-15
046400         SIZE    L-15
046500         COLOR   K-15
046600         CONTROL V-15.
046700
046800     05  USING   D-16
046900         LINE    R-16
047000         COL     C-16
047100         SIZE    L-16
047200         COLOR   K-16
047300         CONTROL V-16.
047400
047500     05  USING   D-17
047600         LINE    R-17
047700         COL     C-17
047800         SIZE    L-17
047900         COLOR   K-17
048000         CONTROL V-17.
048100
048200     05  USING   D-18
048300         LINE    R-18
048400         COL     C-18
048500         SIZE    L-18
048600         COLOR   K-18
048700         CONTROL V-18.
048800
048900     05  USING   D-19
049000         LINE    R-19
049100         COL     C-19
049200         SIZE    L-19
049300         COLOR   K-19
049400         CONTROL V-19.
049500
049600     05  USING   D-20
049700         LINE    R-20
049800         COL     C-20
049900         SIZE    L-20
050000         COLOR   K-20
050100         CONTROL V-20.
050200
050300     05  USING   D-21
050400         LINE    R-21
050500         COL     C-21
050600         SIZE    L-21
050700         COLOR   K-21
050800         CONTROL V-21.
050900
051000     05  USING   D-22
051100         LINE    R-22
051200         COL     C-22
051300         SIZE    L-22
051400         COLOR   K-22
051500         CONTROL V-22.
051600
051700     05  USING   D-23
051800         LINE    R-23
051900         COL     C-23
052000         SIZE    L-23
052100         COLOR   K-23
052200         CONTROL V-23.
052300
052400     05  USING   D-24
052500         LINE    R-24
052600         COL     C-24
052700         SIZE    L-24
052800         COLOR   K-24
052900         CONTROL V-24.
053000
053100     05  USING   D-25
053200         LINE    R-25
053300         COL     C-25
053400         SIZE    L-25
053500         COLOR   K-25
053600         CONTROL V-25.
053700
053800     05  USING   D-26
053900         LINE    R-26
054000         COL     C-26
054100         SIZE    L-26
054200         COLOR   K-26
054300         CONTROL V-26.
054400
054500     05  USING   D-27
054600         LINE    R-27
054700         COL     C-27
054800         SIZE    L-27
054900         COLOR   K-27
055000         CONTROL V-27.
055100
055200     05  USING   D-28
055300         LINE    R-28
055400         COL     C-28
055500         SIZE    L-28
055600         COLOR   K-28
055700         CONTROL V-28.
055800
055900     05  USING   D-29
056000         LINE    R-29
056100         COL     C-29
056200         SIZE    L-29
056300         COLOR   K-29
056400         CONTROL V-29.
056500
056600     05  USING   D-30
056700         LINE    R-30
056800         COL     C-30
056900         SIZE    L-30
057000         COLOR   K-30
057100         CONTROL V-30.
057200
057300     05  USING   D-31
057400         LINE    R-31
057500         COL     C-31
057600         SIZE    L-31
057700         COLOR   K-31
057800         CONTROL V-31.
057900
058000     05  USING   D-32
058100         LINE    R-32
058200         COL     C-32
058300         SIZE    L-32
058400         COLOR   K-32
058500         CONTROL V-32.
058501
058502     05  USING   D-33
058503         LINE    R-33
058504         COL     C-33
058505         SIZE    L-33
058506         COLOR   K-33
058507         CONTROL V-33.
058508
058509     05  USING   D-34
058510         LINE    R-34
058511         COL     C-34
058512         SIZE    L-34
058513         COLOR   K-34
058514         CONTROL V-34.
058515
058516     05  USING   D-35
058517         LINE    R-35
058518         COL     C-35
058519         SIZE    L-35
058520         COLOR   K-35
058521         CONTROL V-35.
058522
058523     05  USING   D-36
058524         LINE    R-36
058525         COL     C-36
058526         SIZE    L-36
058527         COLOR   K-36
058528         CONTROL V-36.
058529
058530     05  USING   D-37
058531         LINE    R-37
058532         COL     C-37
058533         SIZE    L-37
058534         COLOR   K-37
058535         CONTROL V-37.
058536
058537     05  USING   D-38
058538         LINE    R-38
058539         COL     C-38
058540         SIZE    L-38
058541         COLOR   K-38
058542         CONTROL V-38.
058543
058544     05  USING   D-39
058545         LINE    R-39
058546         COL     C-39
058547         SIZE    L-39
058548         COLOR   K-39
058549         CONTROL V-39.
058550
058551     05  USING   D-40
058552         LINE    R-40
058553         COL     C-40
058554         SIZE    L-40
058555         COLOR   K-40
058556         CONTROL V-40.
058600
058700
058800*    Invalid CRT status.
058900 01  WISP-INVALID-CRT-STATUS-SCREEN.
059000     05  LINE 12 COL 30  VALUE "INVALID CRT STATUS" BOLD.
059100     05  LINE + 2 PIC X   FROM WISP-CRT-KEY-1 BOLD.
059200     05  LINE + 2 PIC 999 FROM WISP-CRT-KEY-EXCEPTION BOLD.
059300     05  LINE + 2 PIC 999 FROM WISP-CRT-KEY-3 BOLD.
059400     05  LINE 24 COL 25 VALUE "PRESS (ENTER) TO CONTINUE." BOLD.
059500
059600
059700
059800
059900 PROCEDURE DIVISION USING
060000             STATIC-TEXT,
060100             FIELD-CNT,
060200             FIELD-TABLE,
060300             KEY-LIST,
060400             KEY-CNT,
060500             TERM-KEY,
060510             CURSOR-ROW,
060520             CURSOR-COL,
060521             SOUND_ALARM,
060522             TIMEOUT_HSECS.
060600
060700 0000-START.
060800     PERFORM 1000-INIT.
060900     PERFORM 2000-WSB.
061000     PERFORM 3000-CLEANUP.
061100     PERFORM 9999-EXIT.
061200     PERFORM 9999-STOP.
061300
061400 1000-INIT.
061500
061600     PERFORM VARYING IDX1 FROM 1 BY 1 UNTIL IDX1 > FIELD-CNT
061700         CALL "WACUFAC2SCREEN" USING
061800             FIELD-FAC(IDX1), K-XX(IDX1), V-XX(IDX1)
061900     END-PERFORM.
062000
062100 2000-WSB.
062200
062300     DISPLAY WINDOW ERASE.
062301     IF SOUND_ALARM = 1 THEN
062302         DISPLAY OMITTED BELL
062303     END-IF.
062310     MOVE CURSOR-ROW TO WISP-CURSOR-LINE.
062320     MOVE CURSOR-COL TO WISP-CURSOR-COL.
062500     MOVE "N" TO WISP-DNR-DONE-FLAG.
062600     PERFORM UNTIL WISP-DNR-DONE
062700         DISPLAY STATIC-TEXT-SCREEN
062800         IF FIELD-CNT > 0 THEN
062900             DISPLAY ENTRY-FIELDS-SCREEN
062910         END-IF
062920         IF KEY-CNT > 0 THEN
062930             IF FIELD-CNT > 0 THEN
063000                 ACCEPT  ENTRY-FIELDS-SCREEN
063100                     EXCEPTION CONTINUE
063200                 END-ACCEPT
063201                 IF WISP-CRT-STATUS-NOITEM THEN
063202                     PERFORM WISP-DNR-ACCEPT-NOFIELDS
063203                 END-IF
063300             ELSE
063400                 ACCEPT OMITTED LINE 1 COL 1
063500                     EXCEPTION CONTINUE
063600                 END-ACCEPT
063700             END-IF
063710             PERFORM WISP-CHECK-PFKEY
063720         ELSE
063721             MOVE "Y" TO WISP-DNR-DONE-FLAG
063800         END-IF
063900     END-PERFORM.
064000
064100
064200 3000-CLEANUP.
064400     MOVE WISP-PFKEY TO TERM-KEY.
064410     MOVE WISP-CURSOR-LINE TO CURSOR-ROW.
064420     MOVE WISP-CURSOR-COL TO CURSOR-COL.
064500
064600 9999-EXIT.
064700     EXIT PROGRAM.
064800
064900 9999-STOP.
065000     STOP RUN.
065100
065101***** ACCEPT A SCREEN WITH NO FIELDS
065102 WISP-DNR-ACCEPT-NOFIELDS.
065103     ACCEPT OMITTED LINE 1 COL 1
065104         EXCEPTION CONTINUE
065105     END-ACCEPT.
065106
065200***** CHECK PF KEYS AFTER AN ACCEPT
065300 WISP-CHECK-PFKEY.
065400
065500     SET WISP-PFKEY-INVALID TO TRUE.
065600     IF WISP-CRT-STATUS-TERMINATED AND
065700         (WISP-CRT-KEY-TAB OR WISP-CRT-KEY-AUTOSKIP) THEN
065800         MOVE 0 TO WISP-CURSOR-LINE, WISP-CURSOR-COL
065900     ELSE IF WISP-CRT-STATUS-TERMINATED AND WISP-CRT-KEY-ENTER
066000         MOVE 0 TO WISP-PFKEY
066100     ELSE IF WISP-CRT-STATUS-EXCEPTION AND WISP-CRT-EX-GETKEY
066200         CALL "WACUGETPFKEY" USING WISP-PFKEY
066300     ELSE IF WISP-CRT-STATUS-EXCEPTION
066400         MOVE WISP-CRT-KEY-EXCEPTION TO WISP-PFKEY
066500     ELSE
066600         DISPLAY WINDOW ERASE
066700         DISPLAY WISP-INVALID-CRT-STATUS-SCREEN
066800         ACCEPT OMITTED BELL
066900         DISPLAY WINDOW ERASE
067000     END-IF.
067100
067400     IF NOT WISP-PFKEY-INVALID THEN
067500         PERFORM VARYING IDX1 FROM 1 BY 1 UNTIL WISP-DNR-DONE
067600             OR IDX1 > KEY-CNT
067700             IF WISP-PFKEY = KEY-ITEM(IDX1)
067800                 MOVE "Y" TO WISP-DNR-DONE-FLAG
067900             END-IF
068000         END-PERFORM
068100
068200         IF WISP-DNR-DONE-FLAG = "N" THEN
068210             IF WISP-PFKEY-HELP THEN
068220                 CALL "WACUHELP"
068230             ELSE
068300                 DISPLAY OMITTED BELL
068310             END-IF
068400         END-IF
068500     END-IF.
068600
068700
