000100
000200/*****************************************************************
000300*                                                                *
000400*                       IDENTIFICATION DIVISION                  *
000500*                                                                *
000600******************************************************************
000700*
000800 IDENTIFICATION DIVISION.
000900 PROGRAM-ID.
001000     DISPFILE.
001100 AUTHOR.
001200     Greg Lindholm.
001300/*****************************************************************
001400*                                                                *
001500*                         ENVIRONMENT DIVISION                   *
001600*                                                                *
001700******************************************************************
001800 ENVIRONMENT DIVISION.
001900
002000/*****************************************************************
002100*                                                                *
002200*                      DATA DIVISION                             *
002300*                                                                *
002400******************************************************************
002500 DATA DIVISION.
002600
002700/*****************************************************************
002800*                                                                *
002900*                         WORKING STORAGE                        *
003000*                                                                *
003100******************************************************************
003200*
003300 WORKING-STORAGE SECTION.
003400
003500******************************************************************
003700
003800
003900 01  PP-FUNCTION PIC X VALUE "E".
004000 01  PP-PRNAME PIC X(8) VALUE "INPUT   ".
004100 01  PP-KWCOUNT.
004200     03  PP-KW1 BINARY VALUE 0.
004300     03  PP-KW2 BINARY VALUE 3.
004400
004500 01  PP-FILE-KW PIC X(8) VALUE "FILE    ".
004600 01  PP-LIB-KW PIC X(8) VALUE "LIBRARY ".
004700 01  PP-VOL-KW PIC X(8) VALUE "VOLUME  ".
004800
004900 01  PP-LEN-6.
005000     03 PP-L6-KW1 BINARY VALUE 0.
005100     03 PP-L6-KW2 BINARY VALUE 6.
005200
005300 01  PP-LEN-8.
005400     03 PP-L8-KW1 BINARY VALUE 0.
005500     03 PP-L8-KW2 BINARY VALUE 8.
005600
005700 01  PP-RCODE.
005800     03  PP-RCODE-1 BINARY VALUE 0.
005900     03  PP-RCODE-2 BINARY VALUE 0.
006000
006100 01  LINK-DISPLAY-PROG         PIC X(8) VALUE "DISPLAY ".
006200
006300 01  LINK-TYPE PIC X(1) VALUE "S".
006400
006500 01  LINK-COMP-CODE.
006600     03 LINK-COMP-CODE-1 BINARY VALUE ZERO.
006700     03 LINK-COMP-CODE-2 BINARY VALUE ZERO.
006800 01  LINK-COMP-CODE-X PIC 9999  VALUE ZERO.
006900 01  LINK-RETURN.
007000     03 LINK-RETURN-1 BINARY    VALUE ZERO.
007100     03 LINK-RETURN-2 BINARY    VALUE ZERO.
007200 01  LINK-RETURN-X    PIC S9999 VALUE ZERO.
007300
007400
007500/*****************************************************************
007600*                                                                *
007700*                         WORKING STORAGE                        *
007800*                                                                *
007900******************************************************************
008000 LINKAGE SECTION.
008100 01  DISP-FILE PIC X(8).
008200 01  DISP-LIB  PIC X(8).
008300 01  DISP-VOL  PIC X(6).
008400
008500/*****************************************************************
008600*                                                                *
008700*                         PROCEDURE DIVISION                     *
008800*                                                                *
008900******************************************************************
009000*
009100 PROCEDURE DIVISION USING DISP-FILE, DISP-LIB, DISP-VOL.
009200
009300 MAIN-PARA.
009400
009500
009600     CALL "PUTPARM" USING PP-FUNCTION, PP-PRNAME, PP-KWCOUNT,
009700                          PP-FILE-KW, DISP-FILE, PP-LEN-8,
009800                          PP-LIB-KW, DISP-LIB, PP-LEN-8,
009900                          PP-VOL-KW, DISP-VOL, PP-LEN-6,
010000                          PP-RCODE.
010100
010200     CALL "LINK" USING LINK-DISPLAY-PROG,
010300                       LINK-TYPE,
010400                       LINK-COMP-CODE,
010500                       LINK-RETURN.
010600
010700     IF LINK-COMP-CODE-2 NOT = ZERO THEN
010800         MOVE LINK-COMP-CODE-2 TO LINK-COMP-CODE-X
010900         DISPLAY "LINK TO DISPLAY FAILED WITH COMP-CODE "
011000                 LINK-COMP-CODE-X.
011100
011200 MAIN-EXIT.
011300     EXIT PROGRAM.
