       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           QASMALL.
       AUTHOR.
           Greg Lindholm.
       DATE-WRITTEN.
           01/25/91.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

       MAIN-PARA.

           DISPLAY "THIS IS A SMALL (4) PROGRAM".

       THE-END.
           STOP RUN.

