000001******************************************************************
000002* QASY000M
000003******************************************************************
000006 IDENTIFICATION DIVISION.
000013 PROGRAM-ID. QASY000M.
000015 AUTHOR. S. BORON.
000016 DATE-WRITTEN. APRIL 3 91.
000085 ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
           WANG-VS.
       OBJECT-COMPUTER.
           WANG-VS.
000085 INPUT-OUTPUT SECTION.
000085 FILE-CONTROL.
      *
           SELECT CRT
               ASSIGN TO "CRT",      "DISPLAY",
               ORGANIZATION    IS SEQUENTIAL
               ACCESS MODE     IS RANDOM
               RELATIVE KEY    IS LINENUM
               PFKEY           IS PF-KEY
               CURSOR POSITION IS CURSOR-POS
               FILE STATUS     IS FILSTAT.

      /*****************************************************************
      *                                                                *
      *                      DATA DIVISION - FILE SECTION              *
      *                                                                *
      ******************************************************************
      *
       DATA DIVISION.
       FILE SECTION.
      *
       FD  CRT
           LABEL RECORDS ARE OMITTED.
       01  CRTREC                         PIC X(1924).

      *
000018 WORKING-STORAGE SECTION.
       01  FILSTAT.
           03  ERR-FLAG                   PIC X(01).
           03  PFK-BYTE                   PIC X(01).

       01  PF-KEY                         PIC X(02) VALUE ZERO.

       01  CURSOR-POS.
           03  MOD-COL                    BINARY.
           03  MOD-ROW                    BINARY.

       01  REDEF-CURS-POS                 REDEFINES CURSOR-POS.
           03  FILLER                     PIC X(01).
           03  CURS-COL                   PIC X(01).
           03  FILLER                     PIC X(01).
           03  CURS-ROW                   PIC X(01).

      ******************************************************************

       01  SY000M-SCREEN USAGE IS DISPLAY-WS.
           03 FILLER PIC X(34) ROW 2 COL 20 VALUE
              "*** Display screen for SY000M ***".

           03  FILLER PIC X(15) ROW 24 COL 30 VALUE 
               "PRESS PF16 EXIT".

      ******************************************************************

000045 PROCEDURE DIVISION.
       SY000M-TESTS.

           DISPLAY AND READ SY000M-SCREEN ON CRT
           PFKEYS  16.

           IF PF-KEY = "16" THEN
              GO TO EXIT-PROGRAM.

           GO TO SY000M-TESTS.

      ******************************************************************
      * ALL DONE.
      ******************************************************************

       EXIT-PROGRAM.
           EXIT PROGRAM.
