000001******************************************************************
000002* QAWSFNM#S - subsystem library and volume definition maintenance
000003******************************************************************
000006 IDENTIFICATION DIVISION.
000013 PROGRAM-ID. QAWSFNM.
000015 AUTHOR. M Jensen.
000016 DATE-WRITTEN. SEPT 6 88.
000085 ENVIRONMENT DIVISION.
000214 FIGURATIVE-CONSTANTS.
000214     HIPRO             IS "84"
000214     LOPRO             IS "8C"
000214     LOPRONUM          IS "8E"
000214     FLPRO             IS "94"
000214     SUPRO             IS "9C"
000214     SOLID             IS "0B"
000445     RDMN-UNDERSCORE  IS "20"
000445     RDMN-NUMERIC     IS "02"
000445     S1-FIG-CON-8C         IS "8C"
000445     S1-FIG-CON-A1         IS "A1"
000445     S1-FIG-CON-AD         IS "AD"
000445     S2-FIG-CON-8C         IS "8C"
000445     S2-FIG-CON-8D         IS "8D"
000445     S2-FIG-CON-8E         IS "8E"
000445     S2-FIG-CON-A1         IS "A1"
000445     S2-FIG-CON-AD         IS "AD"
000445     S1-NUMERIC-ERROR      IS "3F"
000445     S2-NUMERIC-ERROR      IS "3F"
000445     DEGEN-PROTECTED  IS "04"
000445     DEGEN-DIM        IS "08"
000445     DEGEN-SOLID      IS "0B"
000445     DEGEN-FLASHING   IS "10"
000445     DEGEN-HIPRO      IS "84"
000445     DEGEN-LOPRO      IS "8C"
000445     DEGEN-FLPRO      IS "94"
000445     DEGEN-HIMODUPRUL IS "A1"
000445     DEGEN-HIMODUL    IS "A0"
000445     DEGEN-HIMODNUMUL IS "A2"
000214     .
000085 INPUT-OUTPUT SECTION.
000085 FILE-CONTROL.
000085 DATA DIVISION.
000085 FILE SECTION.
000018 WORKING-STORAGE SECTION.
000445 01  S1-SCREENLINES USAGE BINARY VALUE 39.
000445 01  S1-SFIRST     USAGE BINARY VALUE 5.
000445 01  S1-SLAST       USAGE BINARY VALUE 34.
000445 01  S2-SCREENLINES USAGE BINARY VALUE 24.
000445 01  S2-SFIRST     USAGE BINARY VALUE 7.
000445 01  S2-SLAST       USAGE BINARY VALUE 24.
000020 01  WS-TALLY             PIC 999 COMP.
000021 01  MODIFY-ADD-FLAG      PIC X VALUE SPACES.
000022 01  MM-SYSTEM            PIC XX VALUE "MM".
000026*.COMMENTS
000027*$WANG_CODE
000028 01  LK-VARIABLES.
000029     05  LK-LINK-NAME           PIC X(8)   VALUE "ASSIGN#P".
000030     05  LK-LINK-TYPE           PIC X      VALUE "P".
000031 01  LK-LIB                     PIC X(8)   VALUE SPACES.
000032 01  LK-VOL                     PIC X(6)   VALUE SPACES.
000033 01  LK-ARGUMENT-COUNT.
000034     05  FILLER                 BINARY     VALUE ZERO.
000035     05  HALFWORD-ARG-COUNT     BINARY     VALUE 1.
000036 01  LK-COMPLETION-CODE.
000037     05  FILLER                 BINARY     VALUE ZERO.
000038     05  HALFWORD-COM-LENGTH    BINARY     VALUE 1.
000039 01  LK-RETURN-CODE.
000040     05  FILLER                 BINARY     VALUE ZERO.
000041     05  HALFWORD-RET-LENGTH    BINARY     VALUE 1.
000042*$WANG_END
000085 01  GET-FUNC-TYPE          PIC XX   VALUE "I ".
000085 01  GET-FORM-TYPE          PIC X    VALUE "R".
000085 01  GET-PRNAME             PIC X(8) VALUE "DATA".
000085 01  GET-PFKEY-REC          PIC X    VALUE "@".
000085 01  GET-MESS-ID            PIC X(4) VALUE SPACES.
000085 01  GET-MESS-SOURCE        PIC X(6) VALUE SPACES.
000085 01  GET-MESS-TEXT          PIC X    VALUE SPACES.
000085 01  GET-MESS-TEXT-LENGTH.
000085     05  FILLER USAGE IS      BINARY  VALUE ZERO.
000085     05  FILLER USAGE IS      BINARY  VALUE ZERO.
000085 01  GET-KEYWORD-TYPE       PIC X    VALUE "K".
000085 01  GET-KEYWORD            PIC X(8) VALUE "PARMS".
000085 01  GET-RECEIVER-FIELD              VALUE SPACES.
000085     05  SY000-S1-PORT      PIC X(4).
000085     05  SY000-S2-PORT      PIC X(4).
000085     05  SY000-DATASET      PIC X(4).
000085     05  GET-SECURITY-DATA.
000085         10  SY000-USER-SECURITY-CLASS  PIC X(3).
000085         10  SY000-PROG-SECURITY-TYPE   PIC X.
000085     05  GET-MENU-OPT-TYPE              PIC X.
000085 01  GET-MESSAGE-LENGTH.
000085     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000085     05  FILLER USAGE IS     BINARY   VALUE 17.
000085 01  GET-ROW-OF-FIELD.
000085     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000085     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000085 01  GET-COL-OF-FIELD.
000085     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000085     05  FILLER USAGE IS     BINARY   VALUE ZERO.
000085 01  GET-DATA-TYPE          PIC X    VALUE "C".
000085 01  SY000-RECEIVE-PORT     PIC X(4).
000085 01  SY000-RECEIVE-PORT-RED REDEFINES SY000-RECEIVE-PORT
000085                             PIC 9(4).
000085*$WANG_CODE
000085 01  SY000-EXTRACT-PORT.
000085     05  FILLER  BINARY VALUE ZERO.
000085     05  SY000-BIN-PORT BINARY VALUE ZERO.
000085 01  SY000-KEYWORD          PIC XX VALUE "T#".
000085 01  SY000-INTTASK-PORT     PIC X(4).
000085 01  SY000-INTTASK-FUNC     PIC XX.
000085 01  SY000-INTTASK-CHECK-TYPE  PIC X.
000085 01  SY000-INTTASK-RCODE.
000085     05  FILLER USAGE IS BINARY VALUE ZERO.
000085     05  SY000-INTTASK-ECODE USAGE IS BINARY VALUE ZERO.
000085 01  SY000-INTTASK-MSG-LEN.
000085     05  FILLER USAGE IS BINARY VALUE ZERO.
000085     05  SY000-INTTASK-LENGTH USAGE IS BINARY VALUE ZERO.
000085 01  SY000-INTTASK-INTERVAL.
000085     05  FILLER USAGE IS BINARY VALUE ZERO.
000085     05  SY000-INTTASK-WAIT BINARY VALUE 3000.
000085*$WANG_END
000085*$WANG_CODE
000085 01  SERV1-INTERTASK-REQUEST.
000085     05  SERV1-REQUEST-CODE          PIC 99.
000085     05  SERV1-RETURN-PORT           PIC X(4).
000085     05  SERV1-REQUEST-DATASET       PIC X(4).
000085     05  SERV1-REQUEST-SUBSYSTEM     PIC XX.
000085     05  SERV1-REQUEST-FILE          PIC X(8).
000085     05  SERV1-REQUEST-FILETYPE      PIC X.
000085     05  SERV1-REQUEST-OPENMODE      PIC XX.
000085 01  SERV1-RESPONSE-CODE-00.
000085     05  SERV1-RESPONSE-FILE         PIC X(8).
000085     05  SERV1-RESPONSE-LIBRARY      PIC X(8).
000085     05  SERV1-RESPONSE-VOLUME       PIC X(6).
000085     05  SERV1-RESPONSE-LOG-FLAG     PIC X.
000085 01  SERV1-RESPONSE-CODE-01.
000085     05  SERV1-RESPONSE-RUNLIB       PIC X(8).
000085     05  SERV1-RESPONSE-RUNVOL       PIC X(6).
000085*$WANG_END
000086 01  STDERR-SAVE-FUNCTION  PIC X(3) VALUE SPACES.
000086 01  STDERR-LITERALS.
000086     05  STDERR-C     PIC X   VALUE "C".   % Close
000086     05  STDERR-D     PIC X   VALUE "D".   %
000086     05  STDERR-F     PIC X   VALUE "F".   %
000086     05  STDERR-N     PIC X   VALUE "N".   % No
000086     05  STDERR-O     PIC X   VALUE "O".   % Open
000086     05  STDERR-S     PIC X   VALUE "S".   % Sort
000086     05  STDERR-T     PIC X   VALUE "T".   % Transaction
000086     05  STDERR-W     PIC X   VALUE "W".   % Work
000086     05  STDERR-Y     PIC X   VALUE "Y".   % Yes
000086     05  STDERR-00    PIC XX  VALUE "00".  %
000086     05  STDERR-23    PIC XX  VALUE "23".  %
000086     05  STDERR-CL    PIC XX  VALUE "CL".  % Close
000086     05  STDERR-DL    PIC XX  VALUE "DL".  % Delete
000086     05  STDERR-FE    PIC XX  VALUE "FE".  % Fatal Error
000086     05  STDERR-GC    PIC XX  VALUE "GC".  % Logfile Close
000086     05  STDERR-GIN   PIC XX  VALUE "GI".  % Logfile Open Input
000086     05  STDERR-GRN   PIC XXX VALUE "GRN". % Logfile Read Next
000086     05  STDERR-GSH   PIC XX  VALUE "GS".  % Logfile Open Shared
000086     05  STDERR-IN    PIC XX  VALUE "IN".  % Open Input
000086     05  STDERR-IO    PIC XX  VALUE "IO".  % Open I-O
000086     05  STDERR-FLV   PIC XXX VALUE "FLV". % File/Lib/Vol
000086     05  STDERR-OU    PIC XX  VALUE "OU".  % Open Output
000086     05  STDERR-RK    PIC XX  VALUE "RK".  % Read
000086     05  STDERR-RN    PIC XX  VALUE "RN".  % Read Next
000086     05  STDERR-RW    PIC XX  VALUE "RW".  % Rewrite
000086     05  STDERR-SH    PIC XX  VALUE "SH".  % Open Shared
000086     05  STDERR-SP    PIC XX  VALUE "SP".  % Open Special Input
000086     05  STDERR-WL    PIC XX  VALUE "WL".  % Work Library
000086     05  STDERR-WR    PIC XX  VALUE "WR".  % Write
000086     05  STDERR-WV    PIC XX  VALUE "WV".  % Work Volume
000086     05  STDERR-RKH   PIC XXX VALUE "RKH". % Read Hold
000086     05  STDERR-RNH   PIC XXX VALUE "RNH". % Read Next Hold
000086     05  STDERR-SEQ   PIC XXX VALUE "SEQ". % Start =
000086     05  STDERR-SNL   PIC XXX VALUE "SNL". % Start Not <
000086     05  STDERR-STG   PIC XXX VALUE "STG". % Start >
000086 01  SYS99-BLOCK.
000086     05  SYS99-PROGRAM             PIC X(8)  VALUE SPACES.
000086     05  SYS99-CONTEXT             PIC X(8)  VALUE SPACES.
000086     05  SYS99-FUNCTION            PIC X(3)  VALUE SPACES.
000086     05  SYS99-FILE                PIC X(8)  VALUE SPACES.
000086     05  SYS99-LIBRARY             PIC X(8)  VALUE SPACES.
000086     05  SYS99-VOLUME              PIC X(6)  VALUE SPACES.
000086     05  SYS99-STATUS              PIC X(2)  VALUE SPACES.
000086     05  SYS99-KEY                 PIC X(70) VALUE SPACES.
000086     05  SYS99-KEY-NO              PIC 9(02) VALUE ZERO.
000086     05  SYS99-RECORD              PIC X(70) VALUE SPACES.
000086     05  SYS99-MESSAGE1            PIC X(70) VALUE SPACES.
000086     05  SYS99-MESSAGE2            PIC X(70) VALUE SPACES.
000086  01  SY000-TRANSACTION-NO          PIC 9(2).
000086  01  SY000-DEADLOCK-FLAG           PIC X(1) VALUE "N".
000086      88  SY000-DEADLOCKED              VALUE "Y".
000086      88  SY000-NOT-DEADLOCKED          VALUE "N".
000086*.COMMENTS
000086*$WANG_CODE
000086  01  STDERR-LINK-PROG              PIC X(8) VALUE "SYS99#O".
000086  01  STDERR-LINK-TYPE              PIC X    VALUE "S".
000086  01  STDERR-LINK-LIB               PIC X(8) VALUE SPACES.
000086  01  STDERR-LINK-VOL               PIC X(6) VALUE SPACES.
000086  01  STDERR-LINK-ARG-COUNT.
000086      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000086      05  STDERR-LINK-PARM-COUNT USAGE IS BINARY VALUE 1.
000086  01  STDERR-LINK-COMP-CODE.
000086      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000086      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000086  01  STDERR-LINK-RET-CODE.
000086      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000086      05  FILLER                  USAGE IS BINARY VALUE ZERO.
000086*$WANG_END
000086
000214 01  RDMN-FILE-STORAGE.
000214     05 RDMN-FILE-START-KEY      PIC X(30) VALUE SPACES.
000214     05 RDMN-FILERECSAVE         PIC X(500).
000214     05 RDMN-FILE-STATUS         PIC X(2).
000214     05 RDMN-PRIMEKEY-SAVE PIC X(6)
000214        VALUE SPACES.
000214     05 RDMN-NEXTKEY-SAVE  PIC X(6)
000214        VALUE LOW-VALUES.
000214     05 RDMN-DEFAULTREC           PIC X(500).
000214 01  RDMN-STATUS-WORKING-STORAGE.
000214     05 RDMN-STATUS           PIC X(02) VALUE "UI".
000214     05 RDMN-I                PIC 9(04).
000214     05 RDMN-COLPLUS1         PIC 9(04).
000214     05 RDMN-ROW              PIC 9(04).
000214     05 RDMN-HOLDFLAG         PIC X.
000214     05 RDMN-SKIP-READNEXT-FLAG PIC X VALUE SPACE.
000214     05 RDMN-EXIT-FLAG        PIC X  VALUE SPACE.
000214     05 RDMN-RETURN-CODE      PIC 9(3) VALUE 4.
000214 01  RDMN-COPYFLAG            PIC X.
000214 01  RDMN-UPDATE-DISABLEFLAG  PIC X    VALUE "N".
000214     88  RDMN-UPDATE-DISABLE           VALUE "Y".
000214 01  RDMN-TITLE.
000214     05 RDMN-TITLE1           PIC X(09)
000214              VALUE "SY000M".
000214     05 RDMN-TITLE2           PIC X(70) VALUE
000214     "FILE MAINTENANCE PROGRAM".
000214 01  RDMN-OPTS VALUE SPACES.
000214     05 RDMN-OPT1.
000214        10 RDMN-OPT11              PIC X(29).
000214        10 RDMN-OPT12              PIC X(17).
000214        10 RDMN-OPT13              PIC X(18).
000214        10 RDMN-OPT14              PIC X(15).
000214     05 RDMN-OPT2.
000214        10 RDMN-OPT21              PIC X(16).
000214        10 RDMN-OPT22              PIC X(13).
000214        10 RDMN-OPT23              PIC X(17).
000214        10 RDMN-OPT24              PIC X(18).
000214        10 RDMN-OPT25              PIC X(15).
000214     05 RDMN-OPT3.
000214        10 RDMN-OPT31              PIC X(16).
000214        10 RDMN-OPT32              PIC X(30).
000214        10 RDMN-OPT33              PIC X(18).
000214        10 RDMN-OPT34              PIC X(15).
000214 01  RDMN-PFK-TABLE
000214         VALUE " BBB BBBBBBBBBBXBBBBBBBBBBBBBSSBB".
000214     05  RDMN-PFK       PIC X   OCCURS 33.
000214 01  RDMN-MSG.
000214     05  RDMN-MSG1      PIC X(35).
000214     05  RDMN-MSG2      PIC X(35).
000214 77  RDMN-OK            PIC X(33) VALUE
000214          "XBBBBBBBBBBBBBBBBBBBBBBBBBBBBSSB ".
000214 77  RDMN-MODE-LOCK     PIC X VALUE "U".
000214 01  RDMN-S2-TITLE        PIC X(79) VALUE SPACES.
000214 01  RDMN-S2-OPT1.
000214     05 RDMN-S2-OPT1-1    PIC X(30)
000214            VALUE "(en) select record by cursor".
000214     05 RDMN-S2-OPT1-2    PIC X(10)
000214            VALUE "(2) top   ".
000214     05 RDMN-S2-OPT1-3    PIC X(11)
000214            VALUE "(5) next   ".
000214     05 RDMN-S2-OPT1-4    PIC X(27)
000214            VALUE "(16) exit without selecting".
000214
000214 01  RDMN-S2-OPT2         PIC X(21)
000214            VALUE " (5) start next at   ".
000214 01  RDMN-S2-KEYTABLE.
000214     05 RDMN-S2-KEYSAVE     PIC X(6)
000214          OCCURS 14.
000214 01  RDMN-SEARCH-PFKEY   BINARY    VALUE ZERO.
000214 77  RDMN-SEARCHKEY-SAVE          PIC X(6)
000214     VALUE LOW-VALUES.
000214 77  RDMN-SEARCH-REC-SAVE         PIC X(500).
000214 77  RDMN-SCROLL-FROM-BOTTOM-FLAG PIC X.
000214 77  RDMN-S2-RECNO        PIC S9(3) COMP.
000214 77  RDMN-S2-RECLAST      PIC S9(3) COMP.
000302 01  RDMN-S2-TABLE.
000302     02  RDMN-S2-LINE-WS           OCCURS 14.
000302         05 RDMN-S2-LINEBOX        PIC X.
000303   05 RDMN-SEARCHFIELD-01 PIC X(04).
000304   05 RDMN-SEARCHFIELD-02 PIC X(02).
000305   05 RDMN-SEARCHFIELD-03 PIC X(08).
000306   05 RDMN-SEARCHFIELD-04 PIC X(06).
000307   05 RDMN-SEARCHFIELD-05 PIC X(08).
000308   05 RDMN-SEARCHFIELD-06 PIC X(06).
000445 77  RDMN-FAC-I             PIC S9(5) COMP VALUE ZERO.
000445 77  RDMN-KEY-FLAG          PIC X.
000445 77  RDMN-PROTECT-KEY-FLAG  PIC X.
000445 01  RDMN-FACS-TABLES.
000445     05  RDMN-FACS-TABLE    OCCURS 99.
000445         10  RDMN-FACS-SAVE PIC X(1).
000445         10  RDMN-MOD-FLAG  PIC X.
000445 01  S1-REC.
000445     05 FILLER PIC X(2) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(56) VALUE
000445     "SY000#Z1           Subsystem Library And Volume Definiti".
000445     05 FILLER PIC X(22) VALUE
000445     "on              SY000M".
000445     05 FILLER PIC X(89) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(7) VALUE
000445     "Dataset".
000445     05 FILLER PIC X(73) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(9) VALUE
000445     "Subsystem".
000445     05 FILLER PIC X(165) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(24) VALUE
000445     "LIBRARIES        VOLUMES".
000445     05 FILLER PIC X(34) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(3) VALUE
000445     "Run".
000445     05 FILLER PIC X(77) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(4) VALUE
000445     "Work".
000445     05 FILLER PIC X(76) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(17) VALUE
000445     "Current Year Data".
000445     05 FILLER PIC X(63) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(18) VALUE
000445     "Previous Year Data".
000445     05 FILLER PIC X(62) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(16) VALUE
000445     "Future Year Data".
000445     05 FILLER PIC X(144) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(56) VALUE
000445     "Should the Data Files Be Logged For This Subsystem and D".
000445     05 FILLER PIC X(6) VALUE
000445     "ataset".
000445     05 FILLER PIC X(593) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(50) VALUE
000445     "Current              Previous               Future".
000445     05 FILLER PIC X(9) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(3) VALUE
000445     "Log".
000445     05 FILLER PIC X(4) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(56) VALUE
000445     "Mask      Library   Volume      Library   Volume      Li".
000445     05 FILLER PIC X(21) VALUE
000445     "brary   Volume   Flag".
000445     05 FILLER PIC X(723) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(56) VALUE
000445     "'+'  match to multiple characters    '/'  end of mask (m".
000445     05 FILLER PIC X(9) VALUE
000445     "andatory)".
000445     05 FILLER PIC X(15) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(27) VALUE
000445     "'-'  single character match".
000445     05 FILLER PIC X(531) VALUE DEGEN-LOPRO.
000445 01  FILLER REDEFINES S1-REC.
000445     05 S1-ROWX OCCURS 39.
000445        10 S1-COLX PIC X OCCURS 80.
000445 01  FILLER REDEFINES S1-REC.
000445     05 FILLER PIC X(179).
000445     05 S1-1-001 PIC X(4).
000445     05 FILLER PIC X(76).
000445     05 S1-S2-001 PIC X(2).
000445     05 FILLER PIC X(243).
000445     05 S1-C-001 PIC X(8).
000445     05 FILLER PIC X(9).
000445     05 S1-63-001 PIC X(6).
000445     05 FILLER PIC X(57).
000445     05 S1-D-001 PIC X(8).
000445     05 FILLER PIC X(9).
000445     05 S1-64-001 PIC X(6).
000445     05 FILLER PIC X(57).
000445     05 S1-E-001 PIC X(8).
000445     05 FILLER PIC X(9).
000445     05 S1-65-001 PIC X(6).
000445     05 FILLER PIC X(57).
000445     05 S1-F-001 PIC X(8).
000445     05 FILLER PIC X(9).
000445     05 S1-66-001 PIC X(6).
000445     05 FILLER PIC X(57).
000445     05 S1-G-001 PIC X(8).
000445     05 FILLER PIC X(9).
000445     05 S1-67-001 PIC X(6).
000445     05 FILLER PIC X(178).
000445     05 S1-68-001 PIC X(1).
000445     05 FILLER PIC X(736).
000445     05 S1-I-001 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-J-001 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-K-001 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-L-001 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-M-001 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-N-001 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-O-001 PIC X(6).
000445     05 FILLER PIC X(4).
000445     05 S1-P-001 PIC X(1).
000445     05 FILLER PIC X(5).
000445     05 S1-I-002 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-J-002 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-K-002 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-L-002 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-M-002 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-N-002 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-O-002 PIC X(6).
000445     05 FILLER PIC X(4).
000445     05 S1-P-002 PIC X(1).
000445     05 FILLER PIC X(5).
000445     05 S1-I-003 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-J-003 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-K-003 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-L-003 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-M-003 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-N-003 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-O-003 PIC X(6).
000445     05 FILLER PIC X(4).
000445     05 S1-P-003 PIC X(1).
000445     05 FILLER PIC X(5).
000445     05 S1-I-004 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-J-004 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-K-004 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-L-004 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-M-004 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-N-004 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-O-004 PIC X(6).
000445     05 FILLER PIC X(4).
000445     05 S1-P-004 PIC X(1).
000445     05 FILLER PIC X(5).
000445     05 S1-I-005 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-J-005 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-K-005 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-L-005 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-M-005 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-N-005 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-O-005 PIC X(6).
000445     05 FILLER PIC X(4).
000445     05 S1-P-005 PIC X(1).
000445     05 FILLER PIC X(5).
000445     05 S1-I-006 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-J-006 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-K-006 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-L-006 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-M-006 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-N-006 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-O-006 PIC X(6).
000445     05 FILLER PIC X(4).
000445     05 S1-P-006 PIC X(1).
000445     05 FILLER PIC X(5).
000445     05 S1-I-007 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-J-007 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-K-007 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-L-007 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-M-007 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-N-007 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-O-007 PIC X(6).
000445     05 FILLER PIC X(4).
000445     05 S1-P-007 PIC X(1).
000445     05 FILLER PIC X(5).
000445     05 S1-I-008 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-J-008 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-K-008 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-L-008 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-M-008 PIC X(6).
000445     05 FILLER PIC X(6).
000445     05 S1-N-008 PIC X(8).
000445     05 FILLER PIC X(2).
000445     05 S1-O-008 PIC X(6).
000445     05 FILLER PIC X(4).
000445     05 S1-P-008 PIC X(1).
000445     05 FILLER PIC X(405).
000445     05 S1-5-001 PIC X(78).
000445     05 FILLER PIC X(2).
000445     05 S1-7-001 PIC X(78).
000445     05 FILLER PIC X(2).
000445     05 S1-8-001 PIC X(78).
000445     05 FILLER PIC X(2).
000445     05 S1-9-001 PIC X(78).
000445 01  S2-REC.
000445     05 FILLER PIC X(2) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(56) VALUE
000445     "SY000#Z2            Subsystem Library And Volume Definit".
000445     05 FILLER PIC X(22) VALUE
000445     "ion             SY000M".
000445     05 FILLER PIC X(249) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(53) VALUE
000445     "Data-  Sub-       Runlib     Runvol           Datalib".
000445     05 FILLER PIC X(3) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(7) VALUE
000445     "Datavol".
000445     05 FILLER PIC X(18) VALUE DEGEN-LOPRO.
000445     05 FILLER PIC X(11) VALUE
000445     "set  system".
000445     05 FILLER PIC X(1499) VALUE DEGEN-LOPRO.
000445 01  FILLER REDEFINES S2-REC.
000445     05 S2-ROWX OCCURS 24.
000445        10 S2-COLX PIC X OCCURS 80.
000445 01  FILLER REDEFINES S2-REC.
000445     05 FILLER PIC X(162).
000445     05 S2-79-001 PIC X(21).
000445     05 FILLER PIC X(2).
000445     05 S2-1-001 PIC X(4).
000445     05 FILLER PIC X(1).
000445     05 S2-2-001 PIC X(2).
000445     05 FILLER PIC X(294).
000445     05 S2-7A-001 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-001 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-001 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-001 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-001 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-001 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-001 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-002 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-002 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-002 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-002 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-002 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-002 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-002 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-003 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-003 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-003 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-003 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-003 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-003 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-003 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-004 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-004 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-004 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-004 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-004 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-004 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-004 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-005 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-005 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-005 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-005 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-005 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-005 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-005 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-006 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-006 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-006 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-006 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-006 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-006 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-006 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-007 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-007 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-007 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-007 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-007 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-007 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-007 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-008 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-008 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-008 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-008 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-008 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-008 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-008 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-009 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-009 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-009 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-009 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-009 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-009 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-009 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-010 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-010 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-010 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-010 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-010 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-010 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-010 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-011 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-011 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-011 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-011 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-011 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-011 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-011 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-012 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-012 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-012 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-012 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-012 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-012 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-012 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-013 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-013 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-013 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-013 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-013 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-013 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-013 PIC X(6).
000445     05 FILLER PIC X(14).
000445     05 S2-7A-014 PIC X(1).
000445     05 FILLER PIC X(3).
000445     05 S2-A-014 PIC X(4).
000445     05 FILLER PIC X(3).
000445     05 S2-B-014 PIC X(2).
000445     05 FILLER PIC X(8).
000445     05 S2-C-014 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-D-014 PIC X(6).
000445     05 FILLER PIC X(11).
000445     05 S2-E-014 PIC X(8).
000445     05 FILLER PIC X(3).
000445     05 S2-F-014 PIC X(6).
000445     05 FILLER PIC X(90).
000445     05 S2-Y-001 PIC X(78).
000445     05 FILLER PIC X(2).
000445     05 S2-78-001 PIC X(78).
000445     05 FILLER PIC X(80).
000445 01  S1-SEQS.
000445     05 S1-1-SEQ PIC 999 VALUE 1.
000445     05 S1-7-SEQ PIC 999 VALUE 4.
000445     05 S1-8-SEQ PIC 999 VALUE 5.
000445     05 S1-9-SEQ PIC 999 VALUE 6.
000445     05 S1-C-SEQ PIC 999 VALUE 7.
000445     05 S1-63-SEQ PIC 999 VALUE 76.
000445     05 S1-64-SEQ PIC 999 VALUE 77.
000445     05 S1-65-SEQ PIC 999 VALUE 78.
000445     05 S1-66-SEQ PIC 999 VALUE 79.
000445     05 S1-67-SEQ PIC 999 VALUE 80.
000445     05 S1-68-SEQ PIC 999 VALUE 81.
000445     05 S1-S2-SEQ PIC 999 VALUE 2.
000445     05 S1-5-SEQ PIC 999 VALUE 3.
000445     05 S1-D-SEQ PIC 999 VALUE 8.
000445     05 S1-E-SEQ PIC 999 VALUE 9.
000445     05 S1-F-SEQ PIC 999 VALUE 10.
000445     05 S1-G-SEQ PIC 999 VALUE 11.
000445     05 S1-I-SEQ PIC 999 VALUE 12.
000445     05 S1-J-SEQ PIC 999 VALUE 20.
000445     05 S1-K-SEQ PIC 999 VALUE 28.
000445     05 S1-L-SEQ PIC 999 VALUE 36.
000445     05 S1-M-SEQ PIC 999 VALUE 44.
000445     05 S1-N-SEQ PIC 999 VALUE 52.
000445     05 S1-O-SEQ PIC 999 VALUE 60.
000445     05 S1-P-SEQ PIC 999 VALUE 68.
000445 01  S2-SEQS.
000445     05 S2-1-SEQ PIC 999 VALUE 1.
000445     05 S2-B-SEQ PIC 999 VALUE 17.
000445     05 S2-C-SEQ PIC 999 VALUE 31.
000445     05 S2-D-SEQ PIC 999 VALUE 45.
000445     05 S2-E-SEQ PIC 999 VALUE 59.
000445     05 S2-F-SEQ PIC 999 VALUE 73.
000445     05 S2-Y-SEQ PIC 999 VALUE 87.
000445     05 S2-78-SEQ PIC 999 VALUE 88.
000445     05 S2-79-SEQ PIC 999 VALUE 89.
000445     05 S2-7A-SEQ PIC 999 VALUE 90.
000445     05 S2-S-SEQ PIC 999 VALUE 2.
000445     05 S2-A-SEQ PIC 999 VALUE 3.
000445 01  S1-FIELD-CONTROLS-INIT.
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1003019005X00+1".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1004019003X00+2".
000445       10 FILLER PIC X VALUE S1-FIG-CON-AD.
000445       10 FILLER PIC X(15) VALUE "0036002079X00+5".
000445       10 FILLER PIC X VALUE S1-FIG-CON-8C.
000445       10 FILLER PIC X(15) VALUE "0037002079X00+7".
000445       10 FILLER PIC X VALUE S1-FIG-CON-8C.
000445       10 FILLER PIC X(15) VALUE "0038002079X00+8".
000445       10 FILLER PIC X VALUE S1-FIG-CON-8C.
000445       10 FILLER PIC X(15) VALUE "0039002079X00+9".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1007024009X00+C".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1008024009X00+D".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1009024009X00+E".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1010024009X00+F".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1011024009X00+G".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1023002009X00+I".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1024002009X00+I".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1025002009X00+I".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1026002009X00+I".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1027002009X00+I".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1028002009X00+I".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1029002009X00+I".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1030002009X00+I".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1023012009X00+J".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1024012009X00+J".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1025012009X00+J".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1026012009X00+J".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1027012009X00+J".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1028012009X00+J".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1029012009X00+J".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1030012009X00+J".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1023022007X00+K".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1024022007X00+K".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1025022007X00+K".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1026022007X00+K".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1027022007X00+K".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1028022007X00+K".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1029022007X00+K".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1030022007X00+K".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1023034009X00+L".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1024034009X00+L".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1025034009X00+L".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1026034009X00+L".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1027034009X00+L".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1028034009X00+L".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1029034009X00+L".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1030034009X00+L".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1023044007X00+M".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1024044007X00+M".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1025044007X00+M".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1026044007X00+M".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1027044007X00+M".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1028044007X00+M".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1029044007X00+M".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1030044007X00+M".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1023056009X00+N".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1024056009X00+N".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1025056009X00+N".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1026056009X00+N".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1027056009X00+N".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1028056009X00+N".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1029056009X00+N".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1030056009X00+N".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1023066007X00+O".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1024066007X00+O".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1025066007X00+O".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1026066007X00+O".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1027066007X00+O".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1028066007X00+O".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1029066007X00+O".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1030066007X00+O".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1023076002X00+P".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1024076002X00+P".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1025076002X00+P".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1026076002X00+P".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1027076002X00+P".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1028076002X00+P".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1029076002X00+P".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1030076002X00+P".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1007041007X00+c".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1008041007X00+d".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1009041007X00+e".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1010041007X00+f".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1011041007X00+g".
000445       10 FILLER PIC X VALUE S1-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1013065002X00+h".
000445 01  S1-FIELD-CONTROLS REDEFINES S1-FIELD-CONTROLS-INIT.
000445     05 S1-FIELD-CONTROL OCCURS 81.
000445        10 S1-FAC       PIC X.
000445        10 S1-OBJECT    PIC X.
000445        10 S1-COORD-ROW PIC 999.
000445        10 S1-COORD-COL PIC 999.
000445        10 S1-LENGTH    PIC 999.
000445        10 S1-SIGN      PIC X.
000445        10 S1-DECIMALS  PIC S99            SIGN IS TRAILING
000445           SEPARATE CHARACTER.
000445        10 S1-TAG       PIC X.
000445 01  S1-NFIELDS PIC S9(3) USAGE COMP VALUE 81.
000445 01  S1-NROWS PIC S9(3) USAGE COMP VALUE 39.
000445 01  S1-NCOLS PIC S9(3) USAGE COMP VALUE 80.
000445 01  S1-WARNFLAGS.
000445     05 FILLER PIC X.
000445 01  S1-WARNSAVES.
000445     05 FILLER PIC X.
000445 01  S2-FIELD-CONTROLS-INIT.
000445       10 FILLER PIC X VALUE S2-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1003025005X00+1".
000445       10 FILLER PIC X VALUE S2-FIG-CON-A1.
000445       10 FILLER PIC X(15) VALUE "1003030003X00+2".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0007010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0008010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0009010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0010010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0011010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0012010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0013010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0014010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0015010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0016010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0017010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0018010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0019010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0020010005X00+A".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0007017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0008017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0009017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0010017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0011017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0012017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0013017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0014017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0015017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0016017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0017017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0018017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0019017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0020017003X00+B".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0007027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0008027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0009027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0010027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0011027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0012027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0013027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0014027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0015027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0016027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0017027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0018027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0019027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0020027009X00+C".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0007038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0008038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0009038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0010038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0011038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0012038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0013038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0014038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0015038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0016038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0017038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0018038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0019038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0020038007X00+D".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0007055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0008055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0009055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0010055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0011055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0012055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0013055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0014055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0015055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0016055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0017055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0018055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0019055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0020055009X00+E".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0007066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0008066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0009066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0010066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0011066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0012066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0013066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0014066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0015066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0016066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0017066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0018066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0019066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8D.
000445       10 FILLER PIC X(15) VALUE "0020066007X00+F".
000445       10 FILLER PIC X VALUE S2-FIG-CON-AD.
000445       10 FILLER PIC X(15) VALUE "0022002079X00+Y".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8C.
000445       10 FILLER PIC X(15) VALUE "0023002079X00+x".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8C.
000445       10 FILLER PIC X(15) VALUE "0003002022X00+y".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0007006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0008006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0009006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0010006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0011006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0012006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0013006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0014006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0015006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0016006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0017006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0018006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0019006002X00+z".
000445       10 FILLER PIC X VALUE S2-FIG-CON-8E.
000445       10 FILLER PIC X(15) VALUE "0020006002X00+z".
000445 01  S2-FIELD-CONTROLS REDEFINES S2-FIELD-CONTROLS-INIT.
000445     05 S2-FIELD-CONTROL OCCURS 103.
000445        10 S2-FAC       PIC X.
000445        10 S2-OBJECT    PIC X.
000445        10 S2-COORD-ROW PIC 999.
000445        10 S2-COORD-COL PIC 999.
000445        10 S2-LENGTH    PIC 999.
000445        10 S2-SIGN      PIC X.
000445        10 S2-DECIMALS  PIC S99            SIGN IS TRAILING
000445           SEPARATE CHARACTER.
000445        10 S2-TAG       PIC X.
000445 01  S2-NFIELDS PIC S9(3) USAGE COMP VALUE 103.
000445 01  S2-NROWS PIC S9(3) USAGE COMP VALUE 24.
000445 01  S2-NCOLS PIC S9(3) USAGE COMP VALUE 80.
000445 01  S2-WARNFLAGS.
000445     05 FILLER PIC X.
000445 01  S2-WARNSAVES.
000445     05 FILLER PIC X.
000445 01  S1-PFK-TABLE-INIT PIC X(34)
000445     VALUE " ".
000445 01  S1-PFK-TABLE REDEFINES S1-PFK-TABLE-INIT.
000445     05 S1-PFK PIC X OCCURS 34.
000445 01  S1-MSG-FLAGS-INIT.
000445     05 S1-MSG-FLAGS-50-1 PIC X(50) VALUE
000445          "NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNYNNNNNNNNNNNNNNN".
000445     05 S1-MSG-FLAGS-50-2 PIC X(50) VALUE
000445          "NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000445 01  S1-MSG-FLAGS REDEFINES S1-MSG-FLAGS-INIT.
000445     05 S1-MSG-FLAG PIC X OCCURS 100.
000445 01  FILLER REDEFINES S1-MSG-FLAGS-INIT.
000445     05 S1-MSG-FLAGS-50 PIC X(50) OCCURS 2.
000445 01  S2-PFK-TABLE-INIT PIC X(34)
000445     VALUE " ".
000445 01  S2-PFK-TABLE REDEFINES S2-PFK-TABLE-INIT.
000445     05 S2-PFK PIC X OCCURS 34.
000445 01  S2-MSG-FLAGS-INIT.
000445     05 S2-MSG-FLAGS-50-1 PIC X(50) VALUE
000445          "NNNNNNNNNNNNNNNNNNNNYNNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000445     05 S2-MSG-FLAGS-50-2 PIC X(50) VALUE
000445          "NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN".
000445 01  S2-MSG-FLAGS REDEFINES S2-MSG-FLAGS-INIT.
000445     05 S2-MSG-FLAG PIC X OCCURS 100.
000445 01  FILLER REDEFINES S2-MSG-FLAGS-INIT.
000445     05 S2-MSG-FLAGS-50 PIC X(50) OCCURS 2.
000445 77  S1-VALIDATEFLAG PIC X VALUE "Y". % "Y" = perform edit
000445                                          %       checks
000445 77  S1-RETURNFLAG PIC X.
000445 77  S1-DUMMY     PIC X.  % Dummy variable to pad CALL
000445 77  S1-SEVERITY PIC X.
000445 77  S1-STATUS PIC X.
000445
000445 01  S1-CURRENT-FIELD.
000445     05  S1-FIELD-INDEX  BINARY.
000445     05  S1-OCCURRENCE   BINARY.
000445     05  S1-FTAG         PIC X.  % Field tag, or blank
000445 77  S1-FOUND            PIC X.
000445 01  S1-MSG-AND-FAC.
000445     05 S1-MSG-FAC PIC X VALUE DEGEN-FLPRO.
000445     05 S1-MSG           VALUE SPACES.
000445        10  S1-FILLER    PIC X(74).
000445        10  S1-MSGEND    PIC X(6).
000445 01  S1-MSG-I PIC S9(3) COMP.
000445 01  S1-MSG-LINENO PIC S9(3) COMP VALUE ZERO.
000445 01  S1-FINDROWFLAG PIC X VALUE SPACES.
000445 77  S1-CYCLE PIC S9(3) COMP.
000445 77  S1-ROW-I PIC S9(3) COMP.
000445 77  S1-COL-I PIC S9(3) COMP.
000445 77  S1-FIELD-I PIC S9(3) COMP.
000445
000445 01  S1-LINE            BINARY VALUE ZERO.
000445 01  S1-POS             BINARY VALUE 1.
000445 01  S1-SIZE            BINARY VALUE 80.
000445 77  S1-FN              PIC XX.
000445 77  S1-BEEPFLAG        PIC X         VALUE SPACE.
000445 77  S1-BEEP            PIC X         VALUE "B".
000445 01  S1-MESSAGELINE     BINARY VALUE ZERO.
000445 01  S1-MESSAGE.
000445     15 FILLER PIC X(30) VALUE "Press:   PF2 to return to firs".
000445     15 FILLER PIC X(30) VALUE "t line    ENTER for next lines".
000445     15 FILLER PIC X(20) VALUE "                    ".
000445 01  S1-ROW             BINARY VALUE ZERO.
000445 01  S1-COL             BINARY VALUE ZERO.
000445 01  S1-PF              BINARY VALUE 35.
000445 01  S1-PF-DISP         PIC 99 VALUE ZERO.
000445
000445 77  S2-VALIDATEFLAG PIC X VALUE "Y". % "Y" = perform edit
000445                                          %       checks
000445 77  S2-RETURNFLAG PIC X.
000445 77  S2-DUMMY     PIC X.  % Dummy variable to pad CALL
000445 77  S2-SEVERITY PIC X.
000445 77  S2-STATUS PIC X.
000445
000445 01  S2-CURRENT-FIELD.
000445     05  S2-FIELD-INDEX  BINARY.
000445     05  S2-OCCURRENCE   BINARY.
000445     05  S2-FTAG         PIC X.  % Field tag, or blank
000445 77  S2-FOUND            PIC X.
000445 01  S2-MSG-AND-FAC.
000445     05 S2-MSG-FAC PIC X VALUE DEGEN-FLPRO.
000445     05 S2-MSG           VALUE SPACES.
000445        10  S2-FILLER    PIC X(74).
000445        10  S2-MSGEND    PIC X(6).
000445 01  S2-MSG-I PIC S9(3) COMP.
000445 01  S2-MSG-LINENO PIC S9(3) COMP VALUE ZERO.
000445 01  S2-FINDROWFLAG PIC X VALUE SPACES.
000445 77  S2-CYCLE PIC S9(3) COMP.
000445 77  S2-ROW-I PIC S9(3) COMP.
000445 77  S2-COL-I PIC S9(3) COMP.
000445 77  S2-FIELD-I PIC S9(3) COMP.
000445
000445 01  S2-LINE            BINARY VALUE ZERO.
000445 01  S2-POS             BINARY VALUE 1.
000445 01  S2-SIZE            BINARY VALUE 80.
000445 77  S2-FN              PIC XX.
000445 77  S2-BEEPFLAG        PIC X         VALUE SPACE.
000445 77  S2-BEEP            PIC X         VALUE "B".
000445 01  S2-ROW             BINARY VALUE ZERO.
000445 01  S2-COL             BINARY VALUE ZERO.
000445 01  S2-PF              BINARY VALUE 35.
000445 01  S2-PF-DISP         PIC 99 VALUE ZERO.
000445
000445 01  DEGEN-ALPHA PIC X(16).     % alphanumeric screen
000445                                 % variable manipulator
000445 01  FILLER REDEFINES DEGEN-ALPHA.
000445     05 DEGEN-ALPHA-16 PIC X OCCURS 16.
000445 01  DEGEN-FIELD-CONTROL.       % screen variable attributes
000445     05 DEGEN-FAC PIC X.
000445     05 DEGEN-OBJECT    PIC X.
000445     05 DEGEN-COORD-ROW PIC 999.
000445     05 DEGEN-COORD-COL PIC 999.
000445     05 DEGEN-LENGTH    PIC 999.
000445     05 DEGEN-SIGN      PIC X.
000445     05 DEGEN-DECIMALS  PIC S99
000445                      SIGN IS TRAILING SEPARATE CHARACTER.
000445     05 DEGEN-TAG       PIC X.
000445 77  DEGEN-NUMERIC PIC S9(12)V9(4).      % numeric screen
000445                                         % variable manipulator
000445 77  DEGEN-I PIC S9(5) COMP VALUE ZERO.
000445 77  DEGEN-J PIC S9(5) COMP VALUE ZERO.
000445 77  DEGEN-K PIC S9(5) COMP VALUE ZERO.
000445 77  DEGEN-L PIC S9(5) COMP VALUE ZERO.
000445 77  DEGEN-F1 PIC S9(5) COMP VALUE ZERO.
000445 77  DEGEN-F2 PIC S9(5) COMP VALUE ZERO.
000445 77  DEGEN-STATUS               PIC X.
000445 77  DEGEN-RETURN-CODE PIC 9. % return code for bad entries in
000445                               % numeric screen variables - for
000445                               % meaning see following messages
000445 01  DEGEN-ERROR-MESSAGES.
000445     05 FILLER PIC X(30) VALUE "A number is required.         ".
000445     05 FILLER PIC X(30) VALUE "negative value not acceptable ".
000445     05 FILLER PIC X(30) VALUE "decimal point not acceptable  ".
000445     05 FILLER PIC X(30) VALUE "entry too large for this field".
000445 01  FILLER REDEFINES DEGEN-ERROR-MESSAGES.
000445     05 DEGEN-ERROR-MESSAGE PIC X(30) OCCURS 4.
000445 77  DEGEN-EDITFLAG PIC X. % 0 = error in last edit checked item
000445                            % 1 = no error
000445 77  DEGEN-WORKX    PIC X(79)     VALUE SPACES.
000445                     % holding variable for alpha screen variables
000445                     % when they are checked for errors.
000445 77  DEGEN-WORKN    PIC S9(12)V9(6) COMP VALUE ZERO.
000445                     % numeric analogue for DEGEN-WORKX
000445 77  DEGEN-WORK-INTEGER     PIC S9(12) COMP VALUE ZERO.
000445 77  DEGEN-LASTIMAGE PIC X(6) VALUE SPACES.
000445 01  DEGEN-STR-USERSUB-VARIABLES.
000445     05 DEGEN-STR-QUOTE-MV PIC XX VALUE "MV".
000445     05 DEGEN-STR-QUOTE-MI PIC XX VALUE "MI".
000445     05 DEGEN-STR-INPUT-LENGTH.
000445        10 FILLER                      BINARY VALUE 0.
000445        10 DEGEN-STR-INPUT-LENGTH-LOW BINARY VALUE 1.
000445     05 DEGEN-STR-INPUT-OFFSET.
000445        10 FILLER                      BINARY VALUE 0.
000445        10 DEGEN-STR-INPUT-OFFSET-LOW BINARY VALUE 0.
000445     05 DEGEN-STR-OUTPUT-OFFSET.
000445        10 FILLER                       BINARY VALUE 0.
000445        10 DEGEN-STR-OUTPUT-OFFSET-LOW BINARY VALUE 0.
000445 01  DEGEN-BACKGROUND-STRING PIC X(60).
000445 01  FILLER REDEFINES DEGEN-BACKGROUND-STRING.
000445     05 DEGEN-BACKGROUND-X PIC X OCCURS 60.
000445 77  DEGEN-BACKGROUND-LENGTH PIC 999. % Length of above
000445 77  DEGEN-BACKGROUND-I PIC S9(3) COMP.
000445 01  DEGEN-PAUSE-LENGTH.
000445     05  DEGEN-PAUSE1                  BINARY VALUE 0.
000445     05  DEGEN-PAUSE-TIME              BINARY VALUE 200.
000445 01  SCRPRT-WORKSTATION-STATUS        PIC X(01) VALUE "C".
000445 01  SCRPRT-ID                        PIC X(02) VALUE "ID".
000445 01  SCRPRT-UFB-ADDRESS               PIC X(02) VALUE SPACES.
000445 01  SCRPRT-PRINT-TYPE                PIC X(01) VALUE "P".
000445 01  SCRPRT-PRINT-FILE.
000445     05   SCRPRT-FILE-NAME.
000445          10   SCRPRT-NAME-A          PIC X(01) VALUE SPACE.
000445          10   SCRPRT-NAME-B          PIC X(03) VALUE SPACE.
000445          10   SCRPRT-NAME-C          PIC X(01) VALUE SPACE.
000445          10   SCRPRT-NAME-D          PIC X(03) VALUE SPACE.
000445     05   SCRPRT-LIB-NAME.
000445          10   SCRPRT-LIB-A           PIC X(03) VALUE SPACE.
000445          10   SCRPRT-LIB-B           PIC X(05) VALUE SPACE.
000445     05   SCRPRT-VOL-NAME             PIC X(06) VALUE SPACE.
000445 01  SCRPRT-BELL-TIME.
000445     05  FILLER                        BINARY    VALUE ZERO.
000445     05  FILLER                        BINARY    VALUE 1.
000462 01  SY000M-FILE-DATA.
000462     05  SY000M-FILE-STATUS          PIC X(02).
000462         88  SY000M-DUP-KEY          VALUE "22".
000462     05  SY000M-ERROR-FLAG           PIC X(01) VALUE SPACES.
000462         88  SY000M-FOUND                      VALUE "Y".
000462         88  SY000M-NOT-FOUND                  VALUE "N".
000462     05  SY000M-FILE-LOCATION.
000462         10  SY000M-NAME       PIC X(08) VALUE "SY000M".
000462         10  SY000M-LIBRARY    PIC X(08) VALUE SPACES.
000462         10  SY000M-VOLUME     PIC X(06) VALUE SPACES.
000462     05  SY000M-SPACE          PIC S9(5) COMP
000462                                         VALUE 100.
000462
000462     05  SY000M-AUTOLOG-FLAG   PIC X     VALUE "Y".
000462     05  SY000M-FILE-TYPE-FLAG PIC X     VALUE "C".
000462     05  SY400A-ERROR-FLAG          PIC X     VALUE SPACES.
000462         88  SY400A-FOUND                     VALUE "Y".
000462         88  SY400A-NOT-FOUND                 VALUE "N".
000462     05  SY400A-TIME-STAMP-LOG.
000462         10  SY400A-TRANSACTION-LOG PIC X     VALUE SPACES.
000462         10  SY400A-USERID-LOG      PIC X(3)  VALUE SPACES.
000462         10  SY400A-DATE-LOG        PIC 9(6)  VALUE ZERO.
000462         10  SY400A-TIME-LOG        PIC 99V99 VALUE ZERO.
000462     05  SY000M-IOCALL-FILLER          PIC X(05) VALUE SPACES.
000462 01  SY000M-RECORD.
000462     05   SY000M-KEY.
000462         10  SY000M-DATA-SET     PIC XXXX.
000462         10  SY000M-SUBSYSTEM    PIC XX.
000462     05  SY000M-RUN-PARMS.
000462         10  SY000M-RUNLIB       PIC X(8).
000462         10  SY000M-RUNVOL       PIC X(6).
000462     05  SY000M-WORK-PARMS.
000462         10  SY000M-WORKLIB      PIC X(8).
000462         10  SY000M-WORKVOL      PIC X(6).
000462     05  SY000M-CURRENT-PARMS.
000462         10  SY000M-DATALIB      PIC X(8).
000462         10  SY000M-DATAVOL      PIC X(6).
000462     05  SY000M-PREV-PARMS.
000462         10  SY000M-PREVDATALIB  PIC X(8).
000462         10  SY000M-PREVDATAVOL  PIC X(6).
000462     05  SY000M-FUTURE-PARMS.
000462         10  SY000M-FUTDATALIB   PIC X(8).
000462         10  SY000M-FUTDATAVOL   PIC X(6).
000462     05  SY000M-LOG-FLAG         PIC X.
000462     05  SY000M-ALL-MASKS.
000462         10  SY000M-MASK-TABLE OCCURS  8 TIMES.
000462             15  SY000M-MASK                 PIC X(8).
000462             15  SY000M-M-CURRENT-PARMS.
000462                 20  SY000M-M-DATALIB        PIC X(8).
000462                 20  SY000M-M-DATAVOL        PIC X(6).
000462             15  SY000M-M-PREV-PARMS.
000462                 20  SY000M-M-PREVDATALIB    PIC X(8).
000462                 20  SY000M-M-PREVDATAVOL    PIC X(6).
000462             15  SY000M-M-FUTURE-PARMS.
000462                 20  SY000M-M-FUTDATALIB     PIC X(8).
000462                 20  SY000M-M-FUTDATAVOL     PIC X(6).
000462             15  SY000M-M-LOG-FLAG           PIC X.
000462     05  SY000M-FILLER                       PIC X(15).
000045 PROCEDURE DIVISION.
000047 MAIN SECTION.
000048 MAIN-1.
000049     PERFORM INITIALIZATION.
000050     PERFORM RDMN-GENERATE.
000051*.COMMENTS
000052*$WANG_CODE
000053     IF MODIFY-ADD-FLAG = "Y"
000054         MOVE SPACES TO SERV1-INTERTASK-REQUEST
000055         MOVE 98 TO SERV1-REQUEST-CODE
000056         MOVE "XW" TO SY000-INTTASK-FUNC
000057         MOVE 23 TO SY000-INTTASK-LENGTH
000058         MOVE SY000-S1-PORT TO SY000-INTTASK-PORT
000059         CALL "MESSAGE" USING SY000-INTTASK-FUNC
000060                              SY000-INTTASK-PORT
000061                              SERV1-INTERTASK-REQUEST
000062                              SY000-INTTASK-MSG-LEN
000063                              SY000-INTTASK-RCODE.
000067     IF MODIFY-ADD-FLAG = "Y"
000068         CALL "GETRUN" USING MM-SYSTEM, LK-LIB, LK-VOL
000069         CALL "LINK" USING LK-LINK-NAME
000070                           LK-LINK-TYPE
000071                           LK-LIB
000072                           LK-VOL
000073                           LK-ARGUMENT-COUNT
000074                           GET-RECEIVER-FIELD    % MENU PARMS
000075                           LK-COMPLETION-CODE
000076                           LK-RETURN-CODE.
000077*$WANG_END
000079 MAIN-EXIT.
000080     EXIT PROGRAM.
000081 MAIN-STOP.
000082     STOP RUN.
000083 MAIN-RTN. EXIT.
000085*.COMMENTS
000085*.REPLACEON
000085*.REPLACE PORT BY YES    % YES, NO OR PORT # IS ALLOWED
000085*.REPLACE PORTINC BY YES % AUTOMATIC INCREMENTING OF PORT
000085*.REPLACE CREATEPORT BY YES % CREATE PORT LOGIC
000085*.REPLACE WAITTIME   BY 3000
000085*.COMMENTS
000086 SY000-FREE-ALL SECTION.
000086 SY000-FREE-ALL-1.
000086      FREE ALL ON ERROR MOVE RETURN-CODE TO RETURN-CODE.
000086 SY000-FREE-ALL-RETURN.  EXIT.
000086 FATAL-ERROR  SECTION.
000086 FATAL-ERROR-PARA.
000086*.COMMENTS
000086*$WANG_CODE
000086       CALL "WSCLOSE".
000086       CALL "LINK" USING STDERR-LINK-PROG
000086                         STDERR-LINK-TYPE
000086                         STDERR-LINK-LIB
000086                         STDERR-LINK-VOL
000086                         STDERR-LINK-ARG-COUNT
000086                          SYS99-BLOCK
000086                         STDERR-LINK-COMP-CODE
000086                         STDERR-LINK-RET-CODE.
000086*$WANG_ELSE
000086*      CALL "QASYS99" USING SYS99-BLOCK.
000086*$WANG_END
000086 FATAL-ERROR-STOP.
000086     STOP RUN.
000214 RDMN-GENERATE SECTION.
000214 RDMN-GENERATE-1.
000214     PERFORM RDMN-INITIALIZATION.
000214     PERFORM RDMN-FAC-INITIALIZATION.
000214     PERFORM RDMN-OPEN-FILES.
000214     MOVE "DI" TO RDMN-STATUS.
000214     PERFORM RDMN-1-OPTIONS-LOOP
000214          UNTIL RDMN-EXIT-FLAG = "E".
000214     MOVE "TE" TO RDMN-STATUS.
000214     PERFORM RDMN-CLOSE.
000214     MOVE RDMN-RETURN-CODE TO RETURN-CODE.
000214 RDMN-EXIT.
000214 RDMN-INITIALIZATION SECTION.
000214 RDMN-INITIALIZATION-1.
000214     PERFORM RDMN-SET-ALL-FIELDS-PRO VARYING RDMN-FAC-I FROM
000214          1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000214     MOVE SPACE       TO RDMN-EXIT-FLAG.
000214     MOVE RDMN-TITLE TO RDMN-S2-TITLE.
000214 RDMN-OPEN-FILES SECTION.
000214 RDMN-OPEN-FILES-1.
000214     PERFORM SY000M-OPEN.
000214     PERFORM RDMN-BLANKRECORD.
000214     MOVE SY000M-RECORD TO
000214           RDMN-FILERECSAVE.
000214     MOVE SY000M-RECORD TO
000214              RDMN-DEFAULTREC.
000214 RDMN-OPEN-EXIT.
000214 RDMN-BLANKRECORD SECTION.
000214 RDMN-BLANKRECORD-1.
000215     MOVE SPACES TO SY000M-RECORD.
000262 RDMN-BLANKRECORD-EXIT.
000262 RDMN-CLOSE SECTION.
000262 RDMN-CLOSE-1.
000262         PERFORM SY000M-CLOSE.
000262     CALL "WSCLOSE".
000262 RDMN-CLOSE-EXIT.
000262 RDMN-1-OPTIONS-LOOP SECTION.
000262 RDMN-1-OPTIONS-LOOP-1.
000262     PERFORM RDMN-SET-UP-SCREEN1.
000262     IF RDMN-SEARCH-PFKEY = ZERO
000262          PERFORM RDMN-1-GENERATE
000262     ELSE
000262         MOVE RDMN-SEARCH-PFKEY TO S1-PF
000262         MOVE ZERO TO RDMN-SEARCH-PFKEY
000262                                        .
000262     MOVE FLPRO  TO S1-MSG-FAC.
000262     MOVE SPACES TO S1-MSG RDMN-OPTS.
000262     MOVE SPACE  TO S1-BEEPFLAG.
000262     MOVE "Y"    TO S1-VALIDATEFLAG.
000262     PERFORM RDMN-SCREEN1-PF-CHOICE.
000262 RDMN-1-OPTIONS-LOOP-EXIT.
000262     EXIT.
000262 RDMN-SET-UP-SCREEN1 SECTION.
000262 RDMN-SET-UP-SCREEN1-1.
000262     MOVE "DI" TO RDMN-STATUS.
000262     MOVE SPACES TO RDMN-OPTS.
000262     MOVE "Enter key value then press" TO RDMN-OPT11.
000262     MOVE " (1) display" TO RDMN-OPT12.
000262          MOVE " (3) set defaults" TO RDMN-OPT13
000262          MOVE " " TO RDMN-PFK (3).
000262     MOVE " (5) next" TO RDMN-OPT14.
000262          MOVE " (6) search" TO RDMN-OPT21
000262          MOVE " " TO RDMN-PFK (6).
000262         MOVE " (8) delete" TO RDMN-OPT22
000262         MOVE " " TO RDMN-PFK (8).
000262         MOVE " (9) modify" TO  RDMN-OPT23
000262         MOVE " " TO RDMN-PFK (9).
000262         MOVE "(10) copy" TO RDMN-OPT24
000262         MOVE " " TO RDMN-PFK (10).
000262         MOVE "(11) add" TO RDMN-OPT25
000262         MOVE " " TO RDMN-PFK (11).
000262            MOVE "(12) set tabs" TO RDMN-OPT31
000262            MOVE " " TO RDMN-PFK (12).
000262     IF RDMN-MODE-LOCK NOT = "L"
000262          MOVE "(14) enter lockmode" TO RDMN-OPT32
000262     ELSE
000262          MOVE "(14) exit lockmode" TO RDMN-OPT32.
000262     MOVE " " TO RDMN-PFK (14).
000262     MOVE SPACES      TO RDMN-OPT33.
000262     MOVE "(16) exit" TO RDMN-OPT34.
000262     MOVE 0 TO RDMN-PROTECT-KEY-FLAG.
000262     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000262          FROM 1 BY 1  UNTIL RDMN-FAC-I > S1-NFIELDS
000262     MOVE "B" TO RDMN-PFK (33).
000262     MOVE RDMN-PFK-TABLE TO S1-PFK-TABLE.
000262     MOVE "N" TO S1-VALIDATEFLAG.
000262 RDMN-SET-UP-SCREEN1-EXIT.
000262 RDMN-SCREEN1-PF-CHOICE SECTION.
000262 RDMN-SCREEN1-PF-CHOICE-1.
000262     IF S1-PF = 1
000262          PERFORM RDMN-INDEXED-LOOKUP
000262     ELSE IF S1-PF = 3
000262          PERFORM RDMN-CREATE-DEFAULTS
000262     ELSE IF S1-PF = 5
000262          PERFORM RDMN-SEQUENTIAL-LOOKUP
000262     ELSE IF S1-PF = 6
000262          PERFORM RDMN-SEARCH-SCREEN
000262     ELSE IF S1-PF = 8
000262          PERFORM RDMN-DELETE-RECORD
000262     ELSE IF S1-PF = 9
000262          PERFORM RDMN-MODIFY-RECORD
000262     ELSE IF S1-PF = 10
000262          MOVE "Y" TO RDMN-COPYFLAG
000262          PERFORM RDMN-ADD-RECORD
000262
000262     ELSE IF S1-PF = 11
000262          MOVE "N" TO RDMN-COPYFLAG
000262          PERFORM RDMN-ADD-RECORD
000262     ELSE IF S1-PF = 12
000262          PERFORM RDMN-SET-TABS
000262     ELSE IF S1-PF = 14
000262          PERFORM RDMN-MODE-LOCK-UNLOCK
000262     ELSE IF S1-PF = 16
000262          MOVE "E" TO RDMN-EXIT-FLAG.
000262 RDMN-SCREEN1-PF-CHOICE-EXIT.
000262 RDMN-INDEXED-LOOKUP SECTION.
000262 RDMN-INDEXED-LOOKUP-1.
000262     MOVE SPACE TO RDMN-HOLDFLAG.
000262     PERFORM RDMN-START-PRIMEKEY.
000262     IF SY000M-FOUND
000262          PERFORM RDMN-READ.
000262     IF SY000M-NOT-FOUND
000262          MOVE SY000M-KEY TO
000262               RDMN-PRIMEKEY-SAVE
000262          PERFORM RDMN-BLANKRECORD
000262          MOVE RDMN-PRIMEKEY-SAVE TO
000262               SY000M-KEY
000262          MOVE "There is no record with this key value."
000262                         TO S1-MSG
000262          MOVE S1-BEEP TO S1-BEEPFLAG
000262     ELSE
000262          MOVE "Record is being displayed" TO S1-MSG
000262          MOVE LOPRO TO S1-MSG-FAC.
000262 RDMN-INDEXED-LOOKUP-EXIT.
000262 RDMN-CREATE-DEFAULTS SECTION.
000262 RDMN-CREATE-DEFAULTS-1.
000262     MOVE "CD" TO RDMN-STATUS.
000262     MOVE SY000M-RECORD TO
000262                RDMN-FILERECSAVE.
000262     MOVE RDMN-DEFAULTREC TO
000262             SY000M-RECORD.
000262     MOVE RDMN-OK TO S1-PFK-TABLE.
000262     MOVE "N" TO S1-VALIDATEFLAG.
000262     MOVE "Enter defaults to be used in add mode"
000262          TO RDMN-OPT1.
000262     MOVE "SET DEFAULTS" TO RDMN-OPT14.
000262     MOVE "(en) set defaults as shown" TO RDMN-OPT2.
000262     MOVE " (1) do not change defaults" TO RDMN-OPT3.
000262     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000262     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000262         FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000262     PERFORM RDMN-SET-MOD-FIELDS-MOD VARYING RDMN-FAC-I
000262          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000262     PERFORM RDMN-1-GENERATE.
000262     MOVE SPACES TO S1-MSG.
000262     MOVE SPACE TO S1-BEEPFLAG.
000262     IF S1-PF = 0
000262          MOVE "Defaults set as requested" TO S1-MSG
000262          MOVE SY000M-RECORD TO
000262               RDMN-DEFAULTREC
000262          MOVE SPACE TO RDMN-FILE-START-KEY
000262     ELSE
000262          MOVE RDMN-FILERECSAVE TO
000262                SY000M-RECORD
000262          MOVE "Defaults not set" TO S1-MSG.
000262     MOVE LOPRO TO S1-MSG-FAC.
000262     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000262          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000262     MOVE "Y" TO S1-VALIDATEFLAG.
000262 RDMN-CREATE-DEFAULTS-EXIT.
000262 RDMN-SEQUENTIAL-LOOKUP SECTION.
000262 RDMN-SEQUENTIAL-LOOKUP-1.
000262     MOVE SPACE TO RDMN-HOLDFLAG.
000262     IF SY000M-KEY NOT =
000262          RDMN-PRIMEKEY-SAVE
000262               MOVE SPACES TO RDMN-FILE-START-KEY.
000262     PERFORM RDMN-START-NEXTKEY.
000262     IF SY000M-FOUND
000262          PERFORM RDMN-READNEXT
000262          MOVE SY000M-KEY TO
000262               RDMN-PRIMEKEY-SAVE.
000262     IF SY000M-NOT-FOUND
000262          MOVE SPACES
000262                          TO RDMN-PRIMEKEY-SAVE
000262          MOVE "There is no record beyond this key value."
000262               TO S1-MSG
000262          MOVE S1-BEEP TO S1-BEEPFLAG
000262     ELSE
000262          MOVE "Record is being displayed" TO S1-MSG
000262          MOVE LOPRO TO S1-MSG-FAC.
000262 RDMN-SEQUENTIAL-LOOKUP-EXIT.
000262 RDMN-SEARCH-SCREEN SECTION.
000262 RDMN-SEARCH-SCREEN-1.
000262     MOVE "SE" TO RDMN-STATUS.
000262     MOVE SY000M-RECORD TO
000262          RDMN-FILERECSAVE.
000262     MOVE SPACES TO S2-MSG.
000262     MOVE 1 TO RDMN-SEARCHKEY-SAVE.
000262     MOVE "BXBB BBBBBBBBBBXBBBBBBBBBBBBBSSB "
000262          TO S2-PFK-TABLE.
000262     PERFORM RDMN-SEARCH-SCREEN-IMAGE.
000262 RDMN-SEARCH-SCREEN-LOOP.
000262     PERFORM RDMN-S2-GENERATE.
000262     MOVE SPACE TO S2-BEEPFLAG.
000262     MOVE SPACES TO S2-MSG.
000262     IF S2-PF = 16
000262          MOVE RDMN-FILERECSAVE TO
000262               SY000M-RECORD
000262          PERFORM RDMN-READ
000262          GO RDMN-SEARCH-SCREEN-EXIT
000262     ELSE IF S2-PF = 5
000262          PERFORM RDMN-SEARCH-SCREEN-IMAGE
000262          GO RDMN-SEARCH-SCREEN-LOOP
000262     ELSE IF S2-PF = 2
000262          MOVE LOW-VALUES
000262               TO SY000M-KEY
000262          PERFORM RDMN-SEARCH-SCREEN-IMAGE
000262          GO RDMN-SEARCH-SCREEN-LOOP.
000262          SUBTRACT 7 FROM S2-ROW
000262                      GIVING RDMN-S2-RECNO.
000262          ADD 1 TO RDMN-S2-RECNO.
000262          IF RDMN-S2-RECNO > ZERO
000262               AND RDMN-S2-RECNO NOT > RDMN-S2-RECLAST
000262               MOVE RDMN-S2-KEYSAVE (RDMN-S2-RECNO)
000262                    TO SY000M-KEY
000262               MOVE SPACE TO RDMN-HOLDFLAG
000262               PERFORM RDMN-START-PRIMEKEY
000262               PERFORM RDMN-READ
000262               MOVE SY000M-RECORD TO
000262                      RDMN-FILERECSAVE
000262               MOVE S2-PF TO RDMN-SEARCH-PFKEY
000262               GO RDMN-SEARCH-SCREEN-EXIT.
000262     MOVE S2-BEEP TO S2-BEEPFLAG.
000262     GO RDMN-SEARCH-SCREEN-LOOP.
000262 RDMN-SEARCH-SCREEN-EXIT.
000262 RDMN-DELETE-RECORD SECTION.
000262 RDMN-DELETE-RECORD-1.
000262     MOVE "DE" TO RDMN-STATUS.
000262     MOVE SY000M-KEY
000262          TO RDMN-PRIMEKEY-SAVE.
000262     PERFORM RDMN-START-PRIMEKEY.
000262     IF SY000M-FOUND
000262          MOVE "H" TO RDMN-HOLDFLAG
000262          PERFORM RDMN-READ.
000262     IF SY000M-NOT-FOUND
000262          MOVE "There is no record with this key value."
000262               TO S1-MSG
000262          MOVE S1-BEEP TO S1-BEEPFLAG
000262          GO RDMN-DELETE-RECORD-EXIT.
000262     MOVE "N" TO S1-VALIDATEFLAG.
000262 RDMN-MULTIPLE-DELETE-LOOP.
000262     MOVE RDMN-OK TO S1-PFK-TABLE.
000262     MOVE "(en)  delete this record" TO RDMN-OPT1.
000262     MOVE "DELETE MODE"              TO RDMN-OPT14.
000262     MOVE " (1)  do not delete"      TO RDMN-OPT2.
000262     IF RDMN-MODE-LOCK = "L"
000262          MOVE "(16)  exit multiple delete mode" TO RDMN-OPT3
000262          MOVE "X" TO S1-PFK(16).
000262     PERFORM RDMN-SET-FIELDS-FLASH VARYING RDMN-FAC-I
000262        FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000262     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000262     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000262         FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000262
000262     PERFORM RDMN-DELETE-DISABLE.
000262
000262     PERFORM RDMN-1-GENERATE.
000263        IF S1-PF = ZERO
000264            MOVE "Y" TO MODIFY-ADD-FLAG.
000271     MOVE SPACE TO S1-BEEPFLAG.
000271     IF S1-PF = 0
000271          PERFORM RDMN-DELETE
000271          IF SY000M-FOUND
000271               MOVE "Record deleted as requested" TO
000271                    S1-MSG
000271               MOVE LOPRO TO S1-MSG-FAC.
000271     IF S1-PF = 1
000271          MOVE "Record not deleted" TO S1-MSG
000271          MOVE LOPRO TO S1-MSG-FAC.
000271     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000271          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000271     IF RDMN-MODE-LOCK = "L"
000271          IF S1-PF = 16
000271               MOVE "Multiple deleted terminated" TO S1-MSG
000271               MOVE LOPRO TO S1-MSG-FAC
000271               GO TO RDMN-DELETE-RECORD-EXIT
000271          ELSE
000271               PERFORM RDMN-START-NEXTKEY
000271               IF SY000M-NOT-FOUND
000271                    MOVE "End of file encountered" TO
000271                         S1-MSG
000271                    MOVE HIPRO TO S1-MSG-FAC
000271                    MOVE S1-BEEP TO
000271                              S1-BEEPFLAG
000271               ELSE
000271                    MOVE "H" TO RDMN-HOLDFLAG
000271                    PERFORM RDMN-READNEXT
000271                    IF SY000M-NOT-FOUND
000271                         MOVE "End of file encountered"
000271                              TO S1-MSG
000271                         MOVE HIPRO TO S1-MSG-FAC
000271                         MOVE S1-BEEP TO
000271                                   S1-BEEPFLAG
000271                    ELSE
000271                         GO TO RDMN-MULTIPLE-DELETE-LOOP.
000271     MOVE "N" TO S1-VALIDATEFLAG.
000271 RDMN-DELETE-RECORD-EXIT.
000271 RDMN-DELETE-DISABLE SECTION.
000271 RDMN-DELETE-DISABLE-1.
000271     IF RDMN-UPDATE-DISABLE
000271         MOVE "Record deletion is not allowed" TO S1-MSG.
000271     IF RDMN-UPDATE-DISABLE
000271         PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000271         FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS
000271         MOVE "N" TO RDMN-UPDATE-DISABLEFLAG
000271         MOVE S1-BEEP TO S1-BEEPFLAG
000271         IF RDMN-MODE-LOCK = "L"
000271             MOVE SPACES TO RDMN-OPT11
000271             MOVE FLPRO TO S1-MSG-FAC
000271             MOVE "B" TO S1-PFK(33)
000271         ELSE
000271              IF RDMN-MODE-LOCK NOT = "L"
000271                  GO TO RDMN-DELETE-RECORD-EXIT.
000271 RDMN-DELETE-DISABLE-EXIT.
000271 RDMN-MODIFY-RECORD SECTION.
000271 RDMN-MODIFY-RECORD-1.
000271     MOVE "RW" TO RDMN-STATUS.
000271     MOVE SY000M-KEY TO
000271          RDMN-PRIMEKEY-SAVE.
000271     PERFORM RDMN-START-PRIMEKEY.
000271     IF SY000M-FOUND
000271          MOVE "H" TO RDMN-HOLDFLAG
000271          PERFORM RDMN-READ.
000271     IF SY000M-NOT-FOUND
000271          MOVE "There is no record with this key value."
000271               TO S1-MSG
000271          MOVE S1-BEEP TO S1-BEEPFLAG
000271          GO RDMN-MODIFY-RECORD-EXIT.
000271 RDMN-MULTIPLE-MODIFY-LOOP.
000271     MOVE RDMN-OK TO S1-PFK-TABLE.
000271     MOVE "(en)  modify record as shown" TO RDMN-OPT1.
000271     MOVE "MODIFY MODE"                 TO RDMN-OPT14.
000271     MOVE " (1)  do not modify"          TO RDMN-OPT2.
000271     IF RDMN-MODE-LOCK = "L"
000271          MOVE "(16)  exit multiple modify mode" TO RDMN-OPT3
000271          MOVE "X" TO S1-PFK(16).
000271     PERFORM RDMN-SET-MOD-FIELDS-MOD VARYING RDMN-FAC-I
000271          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000271     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000271     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000271          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000271     MOVE "Y" TO S1-VALIDATEFLAG.
000271     PERFORM RDMN-MODIFY-DISABLE.
000271 RDMN-ACCEPT-MODIFICATIONS.
000271
000271     PERFORM RDMN-1-GENERATE.
000272        IF S1-PF = ZERO
000273            MOVE "Y" TO MODIFY-ADD-FLAG.
000280     MOVE SPACES TO S1-MSG.
000280     MOVE SPACE TO S1-BEEPFLAG.
000280     IF S1-PF = 0
000280          MOVE SY000M-RECORD TO
000280               RDMN-FILERECSAVE
000280          PERFORM RDMN-REWRITE
000280          IF SY000M-FOUND
000280               MOVE "Record modified as requested" TO
000280                    S1-MSG
000280               MOVE LOPRO TO S1-MSG-FAC
000280          ELSE MOVE "Invalid rewrite -- duplicate key"
000280                              TO S1-MSG
000280               MOVE FLPRO TO S1-MSG-FAC
000280               MOVE S1-BEEP TO S1-BEEPFLAG
000280               MOVE "H" TO RDMN-HOLDFLAG
000280               PERFORM RDMN-START-PRIMEKEY
000280               PERFORM RDMN-READ
000280               MOVE RDMN-FILERECSAVE TO
000280                    SY000M-RECORD
000280               GO TO RDMN-ACCEPT-MODIFICATIONS.
000280     IF S1-PF = 1
000280          MOVE "Record not modified" TO S1-MSG
000280          MOVE LOPRO TO S1-MSG-FAC.
000280     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000280          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000280     IF RDMN-MODE-LOCK = "L"
000280          IF S1-PF = 16
000280               MOVE "Multiple modify terminated" TO S1-MSG
000280               MOVE LOPRO TO S1-MSG-FAC
000280               GO TO RDMN-MODIFY-RECORD-EXIT
000280          ELSE
000280               PERFORM RDMN-START-NEXTKEY
000280               IF SY000M-NOT-FOUND
000280                    MOVE "End of file encountered"
000280                         TO S1-MSG
000280                    MOVE HIPRO TO S1-MSG-FAC
000280                    MOVE S1-BEEP TO
000280                         S1-BEEPFLAG
000280               ELSE
000280                    MOVE "H" TO RDMN-HOLDFLAG
000280                    PERFORM RDMN-READNEXT
000280                    IF SY000M-NOT-FOUND
000280                         MOVE "End of file encountered"
000280                              TO S1-MSG
000280                         MOVE HIPRO TO S1-MSG-FAC
000280                         MOVE S1-BEEP TO
000280                              S1-BEEPFLAG
000280                    ELSE
000280                         GO TO RDMN-MULTIPLE-MODIFY-LOOP.
000280 RDMN-MODIFY-RECORD-EXIT.
000280
000280 RDMN-MODIFY-DISABLE SECTION.
000280 RDMN-MODIFY-DISABLE-1.
000280     IF RDMN-UPDATE-DISABLE
000280         MOVE "Record modification is not allowed" TO
000280            S1-MSG.
000280     IF RDMN-UPDATE-DISABLE
000280         PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000280         FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS
000280         MOVE "N" TO RDMN-UPDATE-DISABLEFLAG
000280         MOVE S1-BEEP TO S1-BEEPFLAG
000280         IF RDMN-MODE-LOCK = "L"
000280             MOVE SPACES TO RDMN-OPT11
000280             MOVE FLPRO TO S1-MSG-FAC
000280             MOVE "B" TO S1-PFK(33)
000280         ELSE
000280              IF RDMN-MODE-LOCK NOT = "L"
000280                  GO TO RDMN-MODIFY-RECORD-EXIT.
000280 RDMN-MODIFY-DISABLE-EXIT.
000280 RDMN-ADD-RECORD SECTION.
000280 RDMN-ADD-RECORD-1.
000280     MOVE "WR" TO RDMN-STATUS.
000280     MOVE SY000M-KEY TO
000280            RDMN-PRIMEKEY-SAVE.
000280     PERFORM RDMN-START-PRIMEKEY.
000280     IF SY000M-FOUND
000280          MOVE "There already is a record with this key value."
000280                         TO S1-MSG
000280          MOVE S1-BEEP TO S1-BEEPFLAG
000280          GO TO RDMN-ADD-RECORD-EXIT.
000280     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000280     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000280           FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000280 RDMN-MULTIPLE-ADD-LOOP.
000280     IF RDMN-COPYFLAG = "N"
000280     MOVE RDMN-DEFAULTREC TO
000280               SY000M-RECORD.
000280     MOVE RDMN-PRIMEKEY-SAVE TO
000280          SY000M-KEY.
000280     MOVE RDMN-OK TO S1-PFK-TABLE.
000280     MOVE "(en)  add record as shown" TO RDMN-OPT1.
000280     MOVE "ADD MODE"                    TO RDMN-OPT14.
000280     MOVE " (1)  do not add"          TO RDMN-OPT2.
000280     IF RDMN-MODE-LOCK = "L"
000280          MOVE "(16)  exit multiple add mode" TO RDMN-OPT3
000280          MOVE "X" TO S1-PFK(16).
000280     PERFORM RDMN-SET-MOD-FIELDS-MOD VARYING RDMN-FAC-I
000280          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000280     MOVE "Y" TO S1-VALIDATEFLAG.
000280 RDMN-ADD-RECORD-LOOP.
000280     PERFORM RDMN-1-GENERATE.
000281        IF S1-PF = ZERO
000282            MOVE "Y" TO MODIFY-ADD-FLAG.
000302     MOVE SPACES TO S1-MSG.
000302     MOVE SPACE TO S1-BEEPFLAG.
000302     IF S1-PF NOT = 0
000302          GO TO RDMN-ADD-AFTER-WRITE.
000302     PERFORM RDMN-WRITE
000302      IF SY000M-NOT-FOUND
000302           MOVE "Invalid write -- duplicate key"
000302                          TO S1-MSG
000302           MOVE FLPRO TO S1-MSG-FAC
000302           MOVE S1-BEEP TO S1-BEEPFLAG
000302           GO RDMN-ADD-RECORD-LOOP.
000302     MOVE SY000M-KEY TO
000302               RDMN-PRIMEKEY-SAVE.
000302 RDMN-ADD-AFTER-WRITE.
000302     IF S1-PF = 0
000302          MOVE "Record added as requested" TO
000302                S1-MSG
000302     ELSE
000302         MOVE "Record not added" TO S1-MSG.
000302     MOVE LOPRO TO S1-MSG-FAC.
000302     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000302          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000302     IF S1-PF = 1 OR S1-PF = 16
000302          PERFORM RDMN-BLANKRECORD.
000302 RDMN-ADD-RECORD-ENDLOOP.
000302     IF RDMN-MODE-LOCK = "L"
000302          IF S1-PF = 16
000302              MOVE "Multiple add terminated" TO S1-MSG
000302              MOVE LOPRO TO S1-MSG-FAC
000302          ELSE
000302             MOVE 0 TO RDMN-PROTECT-KEY-FLAG
000302             PERFORM RDMN-PROTECT-KEY-FIELDS VARYING
000302                  RDMN-FAC-I FROM 1 BY 1 UNTIL
000302                  RDMN-FAC-I > S1-NFIELDS
000302              GO TO RDMN-MULTIPLE-ADD-LOOP.
000302     MOVE SPACES TO RDMN-FILE-START-KEY.
000302 RDMN-ADD-RECORD-EXIT.
000302 RDMN-SET-TABS SECTION.
000302 RDMN-SET-TABS-1.
000302     MOVE "ST" TO RDMN-STATUS.
000302     MOVE
000302     "Modifiability of fields can be changed by entering"
000302          TO RDMN-OPT1.
000302     MOVE
000302     "any character in the first position of the field."
000302          TO RDMN-OPT2.
000302     MOVE
000302     "Bright fields are modifiable dim fields are not."
000302          TO RDMN-OPT3.
000302     MOVE "SET TABS"     TO RDMN-OPT14.
000302     MOVE "(en) accept"  TO RDMN-OPT25.
000302     MOVE " (1) exit"   TO RDMN-OPT34.
000302     PERFORM RDMN-PROTECT-TO-MODIFY VARYING RDMN-FAC-I
000302          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000302     MOVE 1 TO RDMN-PROTECT-KEY-FLAG.
000302     PERFORM RDMN-PROTECT-KEY-FIELDS VARYING RDMN-FAC-I
000302          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000302     MOVE "XBBBBBBBBBBBBBBBBBBBBBBBBBBBBSSBX"
000302          TO S1-PFK-TABLE.
000302     MOVE SY000M-RECORD
000302          TO RDMN-FILERECSAVE.
000302 RDMN-SET-TABS-LOOP.
000302     PERFORM RDMN-BLANKRECORD.
000302     PERFORM RDMN-1-GENERATE.
000302     MOVE SPACE TO S1-BEEPFLAG.
000302     IF S1-PF = 1
000302               MOVE "Set tabs aborted" TO S1-MSG
000302               MOVE LOPRO TO S1-MSG-FAC
000302               GO RDMN-SET-TABS-END.
000302     MOVE 1 TO RDMN-I.
000302 RDMN-CHANGE-TABS-LOOP.
000302     MOVE S1-COORD-ROW (RDMN-I) TO RDMN-ROW.
000302     ADD S1-COORD-COL (RDMN-I) 1
000302          GIVING RDMN-COLPLUS1.
000302     IF S1-OBJECT (RDMN-I) = 1
000302         IF S1-COLX (RDMN-ROW, RDMN-COLPLUS1 )
000302               NOT = SPACE
000302             IF RDMN-MOD-FLAG (RDMN-I) = 0
000302                   MOVE 1 TO RDMN-MOD-FLAG (RDMN-I)
000302                   SET DEGEN-DIM OF S1-FAC(RDMN-I)
000302                         OFF
000302             ELSE
000302                   MOVE 0 TO RDMN-MOD-FLAG (RDMN-I)
000302                   SET DEGEN-DIM OF S1-FAC(RDMN-I) ON
000302                         .
000302     ADD 1 TO RDMN-I.
000302     IF RDMN-I NOT > S1-NFIELDS
000302          GO TO RDMN-CHANGE-TABS-LOOP
000302     ELSE
000302          MOVE "Set tabs completed" TO S1-MSG
000302          MOVE LOPRO TO S1-MSG-FAC.
000302 RDMN-SET-TABS-END.
000302     PERFORM RDMN-MODIFY-TO-PROTECT VARYING RDMN-FAC-I
000302          FROM 1 BY 1 UNTIL RDMN-FAC-I > S1-NFIELDS.
000302     MOVE ZERO TO S1-LINE S1-POS.
000302     MOVE RDMN-FILERECSAVE TO
000302          SY000M-RECORD.
000302 RDMN-SET-TABS-EXIT.
000302 RDMN-MODE-LOCK-UNLOCK SECTION.
000302 RDMN-MODE-LOCK-UNLOCK-1.
000302     IF RDMN-MODE-LOCK NOT = "L"
000302          MOVE "L" TO RDMN-MODE-LOCK
000302          MOVE "Lock mode entered" TO S1-MSG
000302     ELSE
000302          MOVE SPACE TO RDMN-MODE-LOCK
000302          MOVE "Lock mode exited" TO S1-MSG.
000302     MOVE LOPRO TO S1-MSG-FAC.
000302 RDMN-MODE-LOCK-UNLOCK-EXIT.
000312 RDMN-SEARCH-SCREEN-IMAGE SECTION.
000312 RDMN-SEARCH-SCREEN-IMAGE-1.
000312     MOVE LOW-VALUES TO RDMN-S2-TABLE.
000312     MOVE ZERO TO RDMN-S2-RECLAST.
000312     MOVE 1 TO RDMN-S2-RECNO.
000312     MOVE SPACE TO RDMN-HOLDFLAG.
000312     IF  SY000M-KEY = RDMN-SEARCHKEY-SAVE
000312     AND SY000M-KEY NOT = LOW-VALUES
000312     AND SY000M-FOUND
000312          MOVE "Y" TO RDMN-SCROLL-FROM-BOTTOM-FLAG
000312     ELSE
000312          PERFORM RDMN-START-SEARCHKEY
000312          IF SY000M-NOT-FOUND
000312               MOVE "This key value is greater than any on file"
000312                    TO S2-MSG
000312               MOVE S2-BEEP TO S2-BEEPFLAG
000312               GO RDMN-SEARCH-SCREEN-IMAGE-EXIT.
000312 RDMN-SEARCH-SCREEN-IMAGE-LOOP.
000312     IF RDMN-SCROLL-FROM-BOTTOM-FLAG = "Y"
000312          MOVE "N" TO RDMN-SCROLL-FROM-BOTTOM-FLAG
000312          MOVE RDMN-SEARCH-REC-SAVE
000312               TO SY000M-RECORD
000312     ELSE
000312          PERFORM RDMN-READNEXT.
000312     IF SY000M-NOT-FOUND
000312          SUBTRACT 1 FROM RDMN-S2-RECNO
000312          GIVING RDMN-S2-RECLAST
000312          MOVE LOW-VALUES
000312               TO RDMN-SEARCHKEY-SAVE
000312          GO TO RDMN-SEARCH-SCREEN-IMAGE-EXIT.
000312     MOVE SY000M-KEY TO
000312          RDMN-S2-KEYSAVE (RDMN-S2-RECNO).
000312     MOVE SY000M-KEY TO
000312          RDMN-SEARCHKEY-SAVE.
000312     MOVE SY000M-RECORD
000312           TO RDMN-SEARCH-REC-SAVE.
000313     MOVE SY000M-DATA-SET  TO RDMN-SEARCHFIELD-01 (RDMN-S2-RECNO).
000314     MOVE SY000M-SUBSYSTEM TO RDMN-SEARCHFIELD-02 (RDMN-S2-RECNO).
000315     MOVE SY000M-RUNLIB    TO RDMN-SEARCHFIELD-03 (RDMN-S2-RECNO).
000316     MOVE SY000M-RUNVOL    TO RDMN-SEARCHFIELD-04 (RDMN-S2-RECNO).
000317     MOVE SY000M-DATALIB   TO RDMN-SEARCHFIELD-05 (RDMN-S2-RECNO).
000318     MOVE SY000M-DATAVOL   TO RDMN-SEARCHFIELD-06 (RDMN-S2-RECNO).
000445     MOVE SOLID TO RDMN-S2-LINEBOX
000445          (RDMN-S2-RECNO).
000445     ADD 1 TO RDMN-S2-RECNO.
000445     IF RDMN-S2-RECNO NOT > 14
000445          GO RDMN-SEARCH-SCREEN-IMAGE-LOOP.
000445     MOVE 14 TO RDMN-S2-RECLAST.
000445 RDMN-SEARCH-SCREEN-IMAGE-EXIT.
000445 RDMN-1-GENERATE SECTION.
000445 RDMN-1-GENERATE-1.
000445     PERFORM S1-GENERATE.
000445 RDMN-1-GENERATE-EXIT.
000445 RDMN-S2-GENERATE SECTION.
000445 RDMN-S2-GENERATE-1.
000445     PERFORM S2-GENERATE.
000445 RDMN-S2-GENERATE-EXIT.
000445 RDMN-START-PRIMEKEY SECTION.
000445 RDMN-START-PRIMEKEY-01.
000445     MOVE "SY000M-KEY" TO
000445              RDMN-FILE-START-KEY.
000445     PERFORM SY000M-START-EQUAL.
000445 RDMN-START-PRIMEKEY-EXIT.
000445 RDMN-START-SEARCHKEY SECTION.
000445 RDMN-START-SEARCHKEY-01.
000445     MOVE "SY000M-KEY"
000445          TO RDMN-FILE-START-KEY.
000445     MOVE SY000M-KEY TO
000445          RDMN-PRIMEKEY-SAVE.
000445          PERFORM SY000M-START-NOT-LESS-THAN.
000445 RDMN-START-SEARCHKEY-EXIT.
000445 RDMN-START-NEXTKEY SECTION.
000445 RDMN-START-NEXTKEY-01.
000445     IF RDMN-FILE-START-KEY = "SY000M-KEY"
000445          IF SY000M-FOUND
000445               GO TO RDMN-START-NEXTKEY-EXIT.
000445     IF  RDMN-FILE-START-KEY = "SY000M-KEY"
000445     AND SY000M-FOUND
000445          MOVE SY000M-KEY
000445               TO RDMN-PRIMEKEY-SAVE
000445     ELSE
000445          MOVE SPACES
000445               TO RDMN-PRIMEKEY-SAVE.
000445     MOVE "SY000M-KEY"
000445           TO RDMN-FILE-START-KEY.
000445          PERFORM SY000M-START-GREATER-THAN.
000445 RDMN-START-NEXTKEY-EXIT.
000445 RDMN-READ SECTION.
000445 RDMN-READ-01.
000445     MOVE "SY000M-KEY"
000445          TO RDMN-FILE-START-KEY.
000445     IF RDMN-HOLDFLAG = "H"
000445          PERFORM SY000M-READ-WITH-HOLD
000445     ELSE
000445          PERFORM SY000M-READ.
000445 RDMN-READ-EXIT.
000445 RDMN-READNEXT SECTION.
000445 RDMN-READNEXT-01.
000445     IF SY000M-FOUND
000445     AND RDMN-SKIP-READNEXT-FLAG = SPACE
000445     IF RDMN-HOLDFLAG = "H"
000445          PERFORM SY000M-READ-NEXT-WITH-HOLD
000445     ELSE
000445          PERFORM SY000M-READ-NEXT.
000445     MOVE SPACE TO RDMN-SKIP-READNEXT-FLAG.
000445 RDMN-READNEXT-EXIT.
000445 RDMN-WRITE SECTION.
000445 RDMN-WRITE-01.
000445     MOVE SY000M-RECORD TO
000445            RDMN-FILERECSAVE.
000445     PERFORM SY000M-WRITE.
000445     PERFORM SY000-FREE-ALL.
000445     MOVE RDMN-FILERECSAVE TO
000445              SY000M-RECORD.
000445 RDMN-WRITE-EXIT.
000445 RDMN-REWRITE SECTION.
000445 RDMN-REWRITE-01.
000445     PERFORM SY000M-REWRITE.
000445     PERFORM SY000-FREE-ALL.
000445 RDMN-REWRITE-EXIT.
000445 RDMN-DELETE SECTION.
000445 RDMN-DELETE-01.
000445     MOVE SY000M-RECORD
000445          TO RDMN-FILERECSAVE.
000445     PERFORM SY000M-DELETE.
000445     PERFORM SY000-FREE-ALL.
000445 RDMN-DELETE-EXIT.
000445 S1-BACKGROUND SECTION.
000445 S1-BACKGROUND-01.
000445 S2-BACKGROUND SECTION.
000445 S2-BACKGROUND-01.
000445 S1-SOURCE-TO-IMAGE SECTION.
000445 S1-SOURCE-TO-IMAGE-01.
000445     MOVE SY000M-DATA-SET TO S1-1-001.
000445     MOVE SY000M-SUBSYSTEM TO S1-S2-001.
000445     MOVE " " TO S1-5-001.
000445     MOVE RDMN-OPT1 TO S1-7-001.
000445     MOVE RDMN-OPT2 TO S1-8-001.
000445     MOVE RDMN-OPT3 TO S1-9-001.
000445     MOVE SY000M-RUNLIB TO S1-C-001.
000445     MOVE SY000M-WORKLIB TO S1-D-001.
000445     MOVE SY000M-DATALIB TO S1-E-001.
000445     MOVE SY000M-PREVDATALIB TO S1-F-001.
000445     MOVE SY000M-FUTDATALIB TO S1-G-001.
000445     MOVE SY000M-MASK (1) TO S1-I-001.
000445     MOVE SY000M-MASK (2) TO S1-I-002.
000445     MOVE SY000M-MASK (3) TO S1-I-003.
000445     MOVE SY000M-MASK (4) TO S1-I-004.
000445     MOVE SY000M-MASK (5) TO S1-I-005.
000445     MOVE SY000M-MASK (6) TO S1-I-006.
000445     MOVE SY000M-MASK (7) TO S1-I-007.
000445     MOVE SY000M-MASK (8) TO S1-I-008.
000445     MOVE SY000M-M-DATALIB (1) TO S1-J-001.
000445     MOVE SY000M-M-DATALIB (2) TO S1-J-002.
000445     MOVE SY000M-M-DATALIB (3) TO S1-J-003.
000445     MOVE SY000M-M-DATALIB (4) TO S1-J-004.
000445     MOVE SY000M-M-DATALIB (5) TO S1-J-005.
000445     MOVE SY000M-M-DATALIB (6) TO S1-J-006.
000445     MOVE SY000M-M-DATALIB (7) TO S1-J-007.
000445     MOVE SY000M-M-DATALIB (8) TO S1-J-008.
000445     MOVE SY000M-M-DATAVOL (1) TO S1-K-001.
000445     MOVE SY000M-M-DATAVOL (2) TO S1-K-002.
000445     MOVE SY000M-M-DATAVOL (3) TO S1-K-003.
000445     MOVE SY000M-M-DATAVOL (4) TO S1-K-004.
000445     MOVE SY000M-M-DATAVOL (5) TO S1-K-005.
000445     MOVE SY000M-M-DATAVOL (6) TO S1-K-006.
000445     MOVE SY000M-M-DATAVOL (7) TO S1-K-007.
000445     MOVE SY000M-M-DATAVOL (8) TO S1-K-008.
000445     MOVE SY000M-M-PREVDATALIB (1) TO S1-L-001.
000445     MOVE SY000M-M-PREVDATALIB (2) TO S1-L-002.
000445     MOVE SY000M-M-PREVDATALIB (3) TO S1-L-003.
000445     MOVE SY000M-M-PREVDATALIB (4) TO S1-L-004.
000445     MOVE SY000M-M-PREVDATALIB (5) TO S1-L-005.
000445     MOVE SY000M-M-PREVDATALIB (6) TO S1-L-006.
000445     MOVE SY000M-M-PREVDATALIB (7) TO S1-L-007.
000445     MOVE SY000M-M-PREVDATALIB (8) TO S1-L-008.
000445     MOVE SY000M-M-PREVDATAVOL (1) TO S1-M-001.
000445     MOVE SY000M-M-PREVDATAVOL (2) TO S1-M-002.
000445     MOVE SY000M-M-PREVDATAVOL (3) TO S1-M-003.
000445     MOVE SY000M-M-PREVDATAVOL (4) TO S1-M-004.
000445     MOVE SY000M-M-PREVDATAVOL (5) TO S1-M-005.
000445     MOVE SY000M-M-PREVDATAVOL (6) TO S1-M-006.
000445     MOVE SY000M-M-PREVDATAVOL (7) TO S1-M-007.
000445     MOVE SY000M-M-PREVDATAVOL (8) TO S1-M-008.
000445     MOVE SY000M-M-FUTDATALIB (1) TO S1-N-001.
000445     MOVE SY000M-M-FUTDATALIB (2) TO S1-N-002.
000445     MOVE SY000M-M-FUTDATALIB (3) TO S1-N-003.
000445     MOVE SY000M-M-FUTDATALIB (4) TO S1-N-004.
000445     MOVE SY000M-M-FUTDATALIB (5) TO S1-N-005.
000445     MOVE SY000M-M-FUTDATALIB (6) TO S1-N-006.
000445     MOVE SY000M-M-FUTDATALIB (7) TO S1-N-007.
000445     MOVE SY000M-M-FUTDATALIB (8) TO S1-N-008.
000445     MOVE SY000M-M-FUTDATAVOL (1) TO S1-O-001.
000445     MOVE SY000M-M-FUTDATAVOL (2) TO S1-O-002.
000445     MOVE SY000M-M-FUTDATAVOL (3) TO S1-O-003.
000445     MOVE SY000M-M-FUTDATAVOL (4) TO S1-O-004.
000445     MOVE SY000M-M-FUTDATAVOL (5) TO S1-O-005.
000445     MOVE SY000M-M-FUTDATAVOL (6) TO S1-O-006.
000445     MOVE SY000M-M-FUTDATAVOL (7) TO S1-O-007.
000445     MOVE SY000M-M-FUTDATAVOL (8) TO S1-O-008.
000445     MOVE SY000M-M-LOG-FLAG (1) TO S1-P-001.
000445     MOVE SY000M-M-LOG-FLAG (2) TO S1-P-002.
000445     MOVE SY000M-M-LOG-FLAG (3) TO S1-P-003.
000445     MOVE SY000M-M-LOG-FLAG (4) TO S1-P-004.
000445     MOVE SY000M-M-LOG-FLAG (5) TO S1-P-005.
000445     MOVE SY000M-M-LOG-FLAG (6) TO S1-P-006.
000445     MOVE SY000M-M-LOG-FLAG (7) TO S1-P-007.
000445     MOVE SY000M-M-LOG-FLAG (8) TO S1-P-008.
000445     MOVE SY000M-RUNVOL TO S1-63-001.
000445     MOVE SY000M-WORKVOL TO S1-64-001.
000445     MOVE SY000M-DATAVOL TO S1-65-001.
000445     MOVE SY000M-PREVDATAVOL TO S1-66-001.
000445     MOVE SY000M-FUTDATAVOL TO S1-67-001.
000445     MOVE SY000M-LOG-FLAG TO S1-68-001.
000445     PERFORM S1-SET-PSEUDOBLANKS.
000445 S1-SET-PSEUDOBLANKS SECTION.
000445 S1-SET-PSEUDOBLANKS-01.
000445 S1-RESET-PSEUDOBLANKS SECTION.
000445 S1-RESET-PSEUDOBLANKS-01.
000445 S2-SOURCE-TO-IMAGE SECTION.
000445 S2-SOURCE-TO-IMAGE-01.
000445     MOVE SY000M-DATA-SET TO S2-1-001.
000445     MOVE SY000M-SUBSYSTEM TO S2-2-001.
000445     MOVE RDMN-SEARCHFIELD-01 (1) TO S2-A-001.
000445     MOVE RDMN-SEARCHFIELD-01 (2) TO S2-A-002.
000445     MOVE RDMN-SEARCHFIELD-01 (3) TO S2-A-003.
000445     MOVE RDMN-SEARCHFIELD-01 (4) TO S2-A-004.
000445     MOVE RDMN-SEARCHFIELD-01 (5) TO S2-A-005.
000445     MOVE RDMN-SEARCHFIELD-01 (6) TO S2-A-006.
000445     MOVE RDMN-SEARCHFIELD-01 (7) TO S2-A-007.
000445     MOVE RDMN-SEARCHFIELD-01 (8) TO S2-A-008.
000445     MOVE RDMN-SEARCHFIELD-01 (9) TO S2-A-009.
000445     MOVE RDMN-SEARCHFIELD-01 (10) TO S2-A-010.
000445     MOVE RDMN-SEARCHFIELD-01 (11) TO S2-A-011.
000445     MOVE RDMN-SEARCHFIELD-01 (12) TO S2-A-012.
000445     MOVE RDMN-SEARCHFIELD-01 (13) TO S2-A-013.
000445     MOVE RDMN-SEARCHFIELD-01 (14) TO S2-A-014.
000445     MOVE RDMN-SEARCHFIELD-02 (1) TO S2-B-001.
000445     MOVE RDMN-SEARCHFIELD-02 (2) TO S2-B-002.
000445     MOVE RDMN-SEARCHFIELD-02 (3) TO S2-B-003.
000445     MOVE RDMN-SEARCHFIELD-02 (4) TO S2-B-004.
000445     MOVE RDMN-SEARCHFIELD-02 (5) TO S2-B-005.
000445     MOVE RDMN-SEARCHFIELD-02 (6) TO S2-B-006.
000445     MOVE RDMN-SEARCHFIELD-02 (7) TO S2-B-007.
000445     MOVE RDMN-SEARCHFIELD-02 (8) TO S2-B-008.
000445     MOVE RDMN-SEARCHFIELD-02 (9) TO S2-B-009.
000445     MOVE RDMN-SEARCHFIELD-02 (10) TO S2-B-010.
000445     MOVE RDMN-SEARCHFIELD-02 (11) TO S2-B-011.
000445     MOVE RDMN-SEARCHFIELD-02 (12) TO S2-B-012.
000445     MOVE RDMN-SEARCHFIELD-02 (13) TO S2-B-013.
000445     MOVE RDMN-SEARCHFIELD-02 (14) TO S2-B-014.
000445     MOVE RDMN-SEARCHFIELD-03 (1) TO S2-C-001.
000445     MOVE RDMN-SEARCHFIELD-03 (2) TO S2-C-002.
000445     MOVE RDMN-SEARCHFIELD-03 (3) TO S2-C-003.
000445     MOVE RDMN-SEARCHFIELD-03 (4) TO S2-C-004.
000445     MOVE RDMN-SEARCHFIELD-03 (5) TO S2-C-005.
000445     MOVE RDMN-SEARCHFIELD-03 (6) TO S2-C-006.
000445     MOVE RDMN-SEARCHFIELD-03 (7) TO S2-C-007.
000445     MOVE RDMN-SEARCHFIELD-03 (8) TO S2-C-008.
000445     MOVE RDMN-SEARCHFIELD-03 (9) TO S2-C-009.
000445     MOVE RDMN-SEARCHFIELD-03 (10) TO S2-C-010.
000445     MOVE RDMN-SEARCHFIELD-03 (11) TO S2-C-011.
000445     MOVE RDMN-SEARCHFIELD-03 (12) TO S2-C-012.
000445     MOVE RDMN-SEARCHFIELD-03 (13) TO S2-C-013.
000445     MOVE RDMN-SEARCHFIELD-03 (14) TO S2-C-014.
000445     MOVE RDMN-SEARCHFIELD-04 (1) TO S2-D-001.
000445     MOVE RDMN-SEARCHFIELD-04 (2) TO S2-D-002.
000445     MOVE RDMN-SEARCHFIELD-04 (3) TO S2-D-003.
000445     MOVE RDMN-SEARCHFIELD-04 (4) TO S2-D-004.
000445     MOVE RDMN-SEARCHFIELD-04 (5) TO S2-D-005.
000445     MOVE RDMN-SEARCHFIELD-04 (6) TO S2-D-006.
000445     MOVE RDMN-SEARCHFIELD-04 (7) TO S2-D-007.
000445     MOVE RDMN-SEARCHFIELD-04 (8) TO S2-D-008.
000445     MOVE RDMN-SEARCHFIELD-04 (9) TO S2-D-009.
000445     MOVE RDMN-SEARCHFIELD-04 (10) TO S2-D-010.
000445     MOVE RDMN-SEARCHFIELD-04 (11) TO S2-D-011.
000445     MOVE RDMN-SEARCHFIELD-04 (12) TO S2-D-012.
000445     MOVE RDMN-SEARCHFIELD-04 (13) TO S2-D-013.
000445     MOVE RDMN-SEARCHFIELD-04 (14) TO S2-D-014.
000445     MOVE RDMN-SEARCHFIELD-05 (1) TO S2-E-001.
000445     MOVE RDMN-SEARCHFIELD-05 (2) TO S2-E-002.
000445     MOVE RDMN-SEARCHFIELD-05 (3) TO S2-E-003.
000445     MOVE RDMN-SEARCHFIELD-05 (4) TO S2-E-004.
000445     MOVE RDMN-SEARCHFIELD-05 (5) TO S2-E-005.
000445     MOVE RDMN-SEARCHFIELD-05 (6) TO S2-E-006.
000445     MOVE RDMN-SEARCHFIELD-05 (7) TO S2-E-007.
000445     MOVE RDMN-SEARCHFIELD-05 (8) TO S2-E-008.
000445     MOVE RDMN-SEARCHFIELD-05 (9) TO S2-E-009.
000445     MOVE RDMN-SEARCHFIELD-05 (10) TO S2-E-010.
000445     MOVE RDMN-SEARCHFIELD-05 (11) TO S2-E-011.
000445     MOVE RDMN-SEARCHFIELD-05 (12) TO S2-E-012.
000445     MOVE RDMN-SEARCHFIELD-05 (13) TO S2-E-013.
000445     MOVE RDMN-SEARCHFIELD-05 (14) TO S2-E-014.
000445     MOVE RDMN-SEARCHFIELD-06 (1) TO S2-F-001.
000445     MOVE RDMN-SEARCHFIELD-06 (2) TO S2-F-002.
000445     MOVE RDMN-SEARCHFIELD-06 (3) TO S2-F-003.
000445     MOVE RDMN-SEARCHFIELD-06 (4) TO S2-F-004.
000445     MOVE RDMN-SEARCHFIELD-06 (5) TO S2-F-005.
000445     MOVE RDMN-SEARCHFIELD-06 (6) TO S2-F-006.
000445     MOVE RDMN-SEARCHFIELD-06 (7) TO S2-F-007.
000445     MOVE RDMN-SEARCHFIELD-06 (8) TO S2-F-008.
000445     MOVE RDMN-SEARCHFIELD-06 (9) TO S2-F-009.
000445     MOVE RDMN-SEARCHFIELD-06 (10) TO S2-F-010.
000445     MOVE RDMN-SEARCHFIELD-06 (11) TO S2-F-011.
000445     MOVE RDMN-SEARCHFIELD-06 (12) TO S2-F-012.
000445     MOVE RDMN-SEARCHFIELD-06 (13) TO S2-F-013.
000445     MOVE RDMN-SEARCHFIELD-06 (14) TO S2-F-014.
000445     MOVE SPACES TO S2-Y-001.
000445     MOVE RDMN-S2-OPT1 TO S2-78-001.
000445     MOVE RDMN-S2-OPT2 TO S2-79-001.
000445     MOVE RDMN-S2-LINEBOX (1) TO S2-7A-001.
000445     MOVE RDMN-S2-LINEBOX (2) TO S2-7A-002.
000445     MOVE RDMN-S2-LINEBOX (3) TO S2-7A-003.
000445     MOVE RDMN-S2-LINEBOX (4) TO S2-7A-004.
000445     MOVE RDMN-S2-LINEBOX (5) TO S2-7A-005.
000445     MOVE RDMN-S2-LINEBOX (6) TO S2-7A-006.
000445     MOVE RDMN-S2-LINEBOX (7) TO S2-7A-007.
000445     MOVE RDMN-S2-LINEBOX (8) TO S2-7A-008.
000445     MOVE RDMN-S2-LINEBOX (9) TO S2-7A-009.
000445     MOVE RDMN-S2-LINEBOX (10) TO S2-7A-010.
000445     MOVE RDMN-S2-LINEBOX (11) TO S2-7A-011.
000445     MOVE RDMN-S2-LINEBOX (12) TO S2-7A-012.
000445     MOVE RDMN-S2-LINEBOX (13) TO S2-7A-013.
000445     MOVE RDMN-S2-LINEBOX (14) TO S2-7A-014.
000445     PERFORM S2-SET-PSEUDOBLANKS.
000445 S2-SET-PSEUDOBLANKS SECTION.
000445 S2-SET-PSEUDOBLANKS-01.
000445 S2-RESET-PSEUDOBLANKS SECTION.
000445 S2-RESET-PSEUDOBLANKS-01.
000445 S1-IMAGE-TO-OBJECT SECTION.
000445 S1-IMAGE-TO-OBJECT-01.
000445     MOVE S1-OBJECT (68) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-P-001 TO SY000M-M-LOG-FLAG (1).
000445     MOVE S1-OBJECT (69) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-P-002 TO SY000M-M-LOG-FLAG (2).
000445     MOVE S1-OBJECT (70) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-P-003 TO SY000M-M-LOG-FLAG (3).
000445     MOVE S1-OBJECT (71) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-P-004 TO SY000M-M-LOG-FLAG (4).
000445     MOVE S1-OBJECT (72) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-P-005 TO SY000M-M-LOG-FLAG (5).
000445     MOVE S1-OBJECT (73) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-P-006 TO SY000M-M-LOG-FLAG (6).
000445     MOVE S1-OBJECT (74) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-P-007 TO SY000M-M-LOG-FLAG (7).
000445     MOVE S1-OBJECT (75) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-P-008 TO SY000M-M-LOG-FLAG (8).
000445     MOVE S1-OBJECT (76) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-63-001 TO SY000M-RUNVOL.
000445     MOVE S1-OBJECT (77) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-64-001 TO SY000M-WORKVOL.
000445     MOVE S1-OBJECT (78) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-65-001 TO SY000M-DATAVOL.
000445     MOVE S1-OBJECT (79) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-66-001 TO SY000M-PREVDATAVOL.
000445     MOVE S1-OBJECT (80) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-67-001 TO SY000M-FUTDATAVOL.
000445     MOVE S1-OBJECT (81) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-68-001 TO SY000M-LOG-FLAG.
000445     MOVE S1-OBJECT (1) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-1-001 TO SY000M-DATA-SET.
000445     MOVE S1-OBJECT (2) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-S2-001 TO SY000M-SUBSYSTEM.
000445     MOVE S1-OBJECT (7) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-C-001 TO SY000M-RUNLIB.
000445     MOVE S1-OBJECT (8) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-D-001 TO SY000M-WORKLIB.
000445     MOVE S1-OBJECT (9) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-E-001 TO SY000M-DATALIB.
000445     MOVE S1-OBJECT (10) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-F-001 TO SY000M-PREVDATALIB.
000445     MOVE S1-OBJECT (11) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-G-001 TO SY000M-FUTDATALIB.
000445     MOVE S1-OBJECT (12) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-I-001 TO SY000M-MASK (1).
000445     MOVE S1-OBJECT (13) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-I-002 TO SY000M-MASK (2).
000445     MOVE S1-OBJECT (14) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-I-003 TO SY000M-MASK (3).
000445     MOVE S1-OBJECT (15) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-I-004 TO SY000M-MASK (4).
000445     MOVE S1-OBJECT (16) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-I-005 TO SY000M-MASK (5).
000445     MOVE S1-OBJECT (17) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-I-006 TO SY000M-MASK (6).
000445     MOVE S1-OBJECT (18) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-I-007 TO SY000M-MASK (7).
000445     MOVE S1-OBJECT (19) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-I-008 TO SY000M-MASK (8).
000445     MOVE S1-OBJECT (20) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-J-001 TO SY000M-M-DATALIB (1).
000445     MOVE S1-OBJECT (21) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-J-002 TO SY000M-M-DATALIB (2).
000445     MOVE S1-OBJECT (22) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-J-003 TO SY000M-M-DATALIB (3).
000445     MOVE S1-OBJECT (23) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-J-004 TO SY000M-M-DATALIB (4).
000445     MOVE S1-OBJECT (24) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-J-005 TO SY000M-M-DATALIB (5).
000445     MOVE S1-OBJECT (25) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-J-006 TO SY000M-M-DATALIB (6).
000445     MOVE S1-OBJECT (26) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-J-007 TO SY000M-M-DATALIB (7).
000445     MOVE S1-OBJECT (27) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-J-008 TO SY000M-M-DATALIB (8).
000445     MOVE S1-OBJECT (28) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-K-001 TO SY000M-M-DATAVOL (1).
000445     MOVE S1-OBJECT (29) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-K-002 TO SY000M-M-DATAVOL (2).
000445     MOVE S1-OBJECT (30) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-K-003 TO SY000M-M-DATAVOL (3).
000445     MOVE S1-OBJECT (31) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-K-004 TO SY000M-M-DATAVOL (4).
000445     MOVE S1-OBJECT (32) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-K-005 TO SY000M-M-DATAVOL (5).
000445     MOVE S1-OBJECT (33) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-K-006 TO SY000M-M-DATAVOL (6).
000445     MOVE S1-OBJECT (34) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-K-007 TO SY000M-M-DATAVOL (7).
000445     MOVE S1-OBJECT (35) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-K-008 TO SY000M-M-DATAVOL (8).
000445     MOVE S1-OBJECT (36) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-L-001 TO SY000M-M-PREVDATALIB (1).
000445     MOVE S1-OBJECT (37) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-L-002 TO SY000M-M-PREVDATALIB (2).
000445     MOVE S1-OBJECT (38) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-L-003 TO SY000M-M-PREVDATALIB (3).
000445     MOVE S1-OBJECT (39) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-L-004 TO SY000M-M-PREVDATALIB (4).
000445     MOVE S1-OBJECT (40) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-L-005 TO SY000M-M-PREVDATALIB (5).
000445     MOVE S1-OBJECT (41) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-L-006 TO SY000M-M-PREVDATALIB (6).
000445     MOVE S1-OBJECT (42) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-L-007 TO SY000M-M-PREVDATALIB (7).
000445     MOVE S1-OBJECT (43) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-L-008 TO SY000M-M-PREVDATALIB (8).
000445     MOVE S1-OBJECT (44) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-M-001 TO SY000M-M-PREVDATAVOL (1).
000445     MOVE S1-OBJECT (45) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-M-002 TO SY000M-M-PREVDATAVOL (2).
000445     MOVE S1-OBJECT (46) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-M-003 TO SY000M-M-PREVDATAVOL (3).
000445     MOVE S1-OBJECT (47) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-M-004 TO SY000M-M-PREVDATAVOL (4).
000445     MOVE S1-OBJECT (48) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-M-005 TO SY000M-M-PREVDATAVOL (5).
000445     MOVE S1-OBJECT (49) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-M-006 TO SY000M-M-PREVDATAVOL (6).
000445     MOVE S1-OBJECT (50) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-M-007 TO SY000M-M-PREVDATAVOL (7).
000445     MOVE S1-OBJECT (51) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-M-008 TO SY000M-M-PREVDATAVOL (8).
000445     MOVE S1-OBJECT (52) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-N-001 TO SY000M-M-FUTDATALIB (1).
000445     MOVE S1-OBJECT (53) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-N-002 TO SY000M-M-FUTDATALIB (2).
000445     MOVE S1-OBJECT (54) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-N-003 TO SY000M-M-FUTDATALIB (3).
000445     MOVE S1-OBJECT (55) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-N-004 TO SY000M-M-FUTDATALIB (4).
000445     MOVE S1-OBJECT (56) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-N-005 TO SY000M-M-FUTDATALIB (5).
000445     MOVE S1-OBJECT (57) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-N-006 TO SY000M-M-FUTDATALIB (6).
000445     MOVE S1-OBJECT (58) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-N-007 TO SY000M-M-FUTDATALIB (7).
000445     MOVE S1-OBJECT (59) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-N-008 TO SY000M-M-FUTDATALIB (8).
000445     MOVE S1-OBJECT (60) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-O-001 TO SY000M-M-FUTDATAVOL (1).
000445     MOVE S1-OBJECT (61) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-O-002 TO SY000M-M-FUTDATAVOL (2).
000445     MOVE S1-OBJECT (62) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-O-003 TO SY000M-M-FUTDATAVOL (3).
000445     MOVE S1-OBJECT (63) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-O-004 TO SY000M-M-FUTDATAVOL (4).
000445     MOVE S1-OBJECT (64) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-O-005 TO SY000M-M-FUTDATAVOL (5).
000445     MOVE S1-OBJECT (65) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-O-006 TO SY000M-M-FUTDATAVOL (6).
000445     MOVE S1-OBJECT (66) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-O-007 TO SY000M-M-FUTDATAVOL (7).
000445     MOVE S1-OBJECT (67) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S1-O-008 TO SY000M-M-FUTDATAVOL (8).
000445 S2-IMAGE-TO-OBJECT SECTION.
000445 S2-IMAGE-TO-OBJECT-01.
000445     MOVE S2-OBJECT (1) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S2-1-001 TO SY000M-DATA-SET.
000445     MOVE S2-OBJECT (2) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "1"
000445       MOVE S2-2-001 TO SY000M-SUBSYSTEM.
000445 S1-VALIDATE SECTION.
000445 S1-VALIDATE-01.
000445     PERFORM S1-P-VALIDATE
000445        VARYING DEGEN-I FROM 1 BY 1
000445        UNTIL DEGEN-I > 8
000445        OR S1-VALIDATEFLAG NOT = "Y".
000445     IF S1-VALIDATEFLAG = "Y"
000445      PERFORM S1-68-VALIDATE.
000445     PERFORM S1-I-VALIDATE
000445        VARYING DEGEN-I FROM 1 BY 1
000445        UNTIL DEGEN-I > 8
000445        OR S1-VALIDATEFLAG NOT = "Y".
000445     PERFORM S1-J-VALIDATE
000445        VARYING DEGEN-I FROM 1 BY 1
000445        UNTIL DEGEN-I > 8
000445        OR S1-VALIDATEFLAG NOT = "Y".
000445     PERFORM S1-K-VALIDATE
000445        VARYING DEGEN-I FROM 1 BY 1
000445        UNTIL DEGEN-I > 8
000445        OR S1-VALIDATEFLAG NOT = "Y".
000445     PERFORM S1-L-VALIDATE
000445        VARYING DEGEN-I FROM 1 BY 1
000445        UNTIL DEGEN-I > 8
000445        OR S1-VALIDATEFLAG NOT = "Y".
000445     PERFORM S1-M-VALIDATE
000445        VARYING DEGEN-I FROM 1 BY 1
000445        UNTIL DEGEN-I > 8
000445        OR S1-VALIDATEFLAG NOT = "Y".
000445     PERFORM S1-N-VALIDATE
000445        VARYING DEGEN-I FROM 1 BY 1
000445        UNTIL DEGEN-I > 8
000445        OR S1-VALIDATEFLAG NOT = "Y".
000445     PERFORM S1-O-VALIDATE
000445        VARYING DEGEN-I FROM 1 BY 1
000445        UNTIL DEGEN-I > 8
000445        OR S1-VALIDATEFLAG NOT = "Y".
000445 S2-VALIDATE SECTION.
000445 S2-VALIDATE-01.
000445 S1-P-VALIDATE SECTION.
000445 S1-P-VALIDATE-01.
000445     ADD DEGEN-I 67 GIVING DEGEN-J.
000445     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-P-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000445     IF SY000M-M-LOG-FLAG (DEGEN-I) NOT = SPACES AND
000445           SY000M-MASK(DEGEN-I) = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Log flag not allowed without a mask" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445     IF SY000M-M-LOG-FLAG (DEGEN-I) NOT = "Y" AND NOT = "N" AND
000445           NOT = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "log flag must be Y(es) or N(o)" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445     IF SY000M-M-LOG-FLAG (DEGEN-I) = SPACES AND
000445           SY000M-MASK(DEGEN-I) NOT = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Log flag must be Y(es) or N(o)" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-P-VALIDATE-EXIT.
000445 S1-68-VALIDATE SECTION.
000445 S1-68-VALIDATE-01.
000445     MOVE S1-OBJECT (81) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-68-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (81) TO DEGEN-FIELD-CONTROL.
000445     IF SY000M-LOG-FLAG NOT = "Y" AND NOT = "N"
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Specify Y for logging or N for no logging" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-68-VALIDATE-EXIT.
000445 S1-I-VALIDATE SECTION.
000445 S1-I-VALIDATE-01.
000445     ADD DEGEN-I 11 GIVING DEGEN-J.
000445     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-I-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000445     MOVE SY000M-MASK (DEGEN-I) TO DEGEN-WORKX
000445     MOVE 1 TO DEGEN-EDITFLAG
000445     IF SY000M-MASK (DEGEN-I) NOT = SPACES      PERFORM
000445           V-000-VALIDATE-MASK
000445      MOVE DEGEN-WORKX TO SY000M-MASK (DEGEN-I)
000445      IF DEGEN-EDITFLAG = ZERO
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "mask must be terminated by a /" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-I-VALIDATE-EXIT.
000445 S1-J-VALIDATE SECTION.
000445 S1-J-VALIDATE-01.
000445     ADD DEGEN-I 19 GIVING DEGEN-J.
000445     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-J-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000445     IF SY000M-M-DATALIB (DEGEN-I) NOT = SPACES AND
000445           SY000M-MASK(DEGEN-I) = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Library/volume not allowed without a mask" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-J-VALIDATE-EXIT.
000445 S1-K-VALIDATE SECTION.
000445 S1-K-VALIDATE-01.
000445     ADD DEGEN-I 27 GIVING DEGEN-J.
000445     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-K-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000445     IF SY000M-M-DATAVOL (DEGEN-I) NOT = SPACES AND
000445           SY000M-MASK(DEGEN-I) = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Library/volume not allowed without a mask" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-K-VALIDATE-EXIT.
000445 S1-L-VALIDATE SECTION.
000445 S1-L-VALIDATE-01.
000445     ADD DEGEN-I 35 GIVING DEGEN-J.
000445     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-L-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000445     IF SY000M-M-PREVDATALIB (DEGEN-I) NOT = SPACES AND
000445           SY000M-MASK(DEGEN-I) = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Library/volume not allowed without a mask" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-L-VALIDATE-EXIT.
000445 S1-M-VALIDATE SECTION.
000445 S1-M-VALIDATE-01.
000445     ADD DEGEN-I 43 GIVING DEGEN-J.
000445     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-M-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000445     IF SY000M-M-PREVDATAVOL (DEGEN-I) NOT = SPACES AND
000445           SY000M-MASK(DEGEN-I) = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Library/volume not allowed without a mask" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-M-VALIDATE-EXIT.
000445 S1-N-VALIDATE SECTION.
000445 S1-N-VALIDATE-01.
000445     ADD DEGEN-I 51 GIVING DEGEN-J.
000445     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-N-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000445     IF SY000M-M-FUTDATALIB (DEGEN-I) NOT = SPACES AND
000445           SY000M-MASK(DEGEN-I) = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Library/volume not allowed without a mask" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-N-VALIDATE-EXIT.
000445 S1-O-VALIDATE SECTION.
000445 S1-O-VALIDATE-01.
000445     ADD DEGEN-I 59 GIVING DEGEN-J.
000445     MOVE S1-OBJECT (DEGEN-J) TO DEGEN-OBJECT.
000445     IF DEGEN-OBJECT = "0"
000445      GO S1-O-VALIDATE-EXIT.
000445     MOVE S1-FIELD-CONTROL (DEGEN-J) TO DEGEN-FIELD-CONTROL.
000445     IF SY000M-M-FUTDATAVOL (DEGEN-I) NOT = SPACES AND
000445           SY000M-MASK(DEGEN-I) = SPACES
000445      MOVE "P" TO S1-SEVERITY
000445      MOVE "Library/volume not allowed without a mask" TO S1-MSG
000445       PERFORM S1-MARKERROR.
000445 S1-O-VALIDATE-EXIT.
000445 S1-DISACCT-SM SECTION.
000445 S1-DISACCT-SM-01.
000445     MOVE "AM" TO S1-FN.
000445     CALL "WSFNM" USING S1-FN S1-REC S1-LINE
000445                        S1-POS S1-BEEPFLAG.
000445     MOVE SPACE TO S1-BEEPFLAG.
000445 S1-PARMS-SM SECTION.
000445 S1-PARMS-SM-01.
000445     MOVE "OM" TO S1-FN.
000445     CALL "WSFNM" USING S1-FN S1-SCREENLINES
000445                S1-SFIRST S1-SLAST
000445                S1-MESSAGE S1-MESSAGELINE
000445                    .
000445 S1-MSG-DISPLAY SECTION.
000445 S1-MSG-DISPLAY-1.
000445     PERFORM S1-DISPLAY-MSG.
000445     MOVE 80 TO S1-POS.
000445     MOVE 1 TO S1-LINE.
000445     MOVE "DS" TO S1-FN.
000445     CALL "WSFNS" USING S1-FN S1-REC S1-LINE
000445                        S1-POS S1-BEEPFLAG.
000445     MOVE "DI" TO S1-FN.
000445     CALL "WSFNS" USING S1-FN S1-REC S1-LINE
000445                        S1-POS S1-BEEPFLAG.
000445     CALL "PAUSE" USING DEGEN-PAUSE-LENGTH.
000445     PERFORM S1-ERASE-MSGS.
000445 S1-MSG-DISPLAY-RETURN.  EXIT.
000445 S1-PFACCT-M SECTION.
000445 S1-PFACCT-M-01.
000445     MOVE "PM" TO S1-FN.
000445     CALL "WSFNM" USING S1-FN S1-PF
000445                        S1-ROW S1-COL
000445                            .
000445 S2-DISACCT-SM SECTION.
000445 S2-DISACCT-SM-01.
000445     MOVE "DS" TO S2-FN.
000445     CALL "WSFNS" USING S2-FN S2-REC S2-LINE
000445                        S2-POS S2-BEEPFLAG.
000445     MOVE "AS" TO S2-FN.
000445     CALL "WSFNS" USING S2-FN S2-REC S2-LINE
000445                        S2-POS S2-BEEPFLAG.
000445     MOVE SPACE TO S2-BEEPFLAG.
000445 S2-MSG-DISPLAY SECTION.
000445 S2-MSG-DISPLAY-1.
000445     PERFORM S2-DISPLAY-MSG.
000445     MOVE 80 TO S2-POS.
000445     MOVE 1 TO S2-LINE.
000445     MOVE "DS" TO S2-FN.
000445     CALL "WSFNS" USING S2-FN S2-REC S2-LINE
000445                        S2-POS S2-BEEPFLAG.
000445     MOVE "DI" TO S2-FN.
000445     CALL "WSFNS" USING S2-FN S2-REC S2-LINE
000445                        S2-POS S2-BEEPFLAG.
000445     CALL "PAUSE" USING DEGEN-PAUSE-LENGTH.
000445     PERFORM S2-ERASE-MSGS.
000445 S2-MSG-DISPLAY-RETURN.  EXIT.
000445 S2-PFACCT-M SECTION.
000445 S2-PFACCT-M-01.
000445     MOVE "PF" TO S2-FN.
000445     CALL "WSFNS" USING S2-FN S2-PF
000445                        S2-ROW S2-COL
000445                         .
000445                                  % value 010000.
000445                                 % anything else otherwise.
000445                                  % buggy ON ERROR code.
000445                                  % replace this by ","
000445 DEGEN-CONVERT SECTION.
000445 DEGEN-CONVERT-START.
000445     MOVE 0 TO DEGEN-RETURN-CODE.
000445     INSPECT DEGEN-ALPHA REPLACING ALL LOW-VALUES BY SPACE.
000445     PERFORM DEGEN-CHECK-IF-NUMERIC.
000445     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000445        PERFORM DEGEN-CHECK-IF-NEGATIVE.
000445     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000445        PERFORM DEGEN-CHECK-DECIMALS.
000445     IF DEGEN-RETURN-CODE = 0 AND DEGEN-NUMERIC NOT = 0
000445        PERFORM DEGEN-CHECK-SIZE.
000445     IF DEGEN-RETURN-CODE NOT = ZERO
000445          MOVE "N" TO DEGEN-STATUS.
000445 DEGEN-CHECK-IF-NUMERIC SECTION.
000445 DEGEN-CHECK-IF-NUMERIC-01.
000445     MOVE ZERO TO DEGEN-RETURN-CODE.
000445     MOVE -9876543210.1234                     TO DEGEN-NUMERIC.
000445     MOVE WITH CONVERSION DEGEN-ALPHA TO DEGEN-NUMERIC.
000445     IF DEGEN-NUMERIC = -9876543210.1234
000445                   MOVE 1 TO DEGEN-RETURN-CODE.
000445 DEGEN-CHECK-IF-NEGATIVE SECTION.
000445 DEGEN-CHECK-IF-NEGATIVE-01.
000445     MOVE ZERO TO DEGEN-RETURN-CODE.
000445     IF (DEGEN-SIGN = "N") AND (DEGEN-NUMERIC < ZERO)
000445          MOVE 2 TO DEGEN-RETURN-CODE.
000445 DEGEN-CHECK-DECIMALS SECTION.
000445 DEGEN-CHECK-DECIMALS-01.
000445     IF DEGEN-DECIMALS = ZERO
000445         % Store length of variable without FAC
000445         SUBTRACT 1 FROM DEGEN-LENGTH GIVING DEGEN-L
000445         PERFORM DEGEN-DUMMY VARYING DEGEN-J FROM 1 BY 1
000445            UNTIL DEGEN-ALPHA-16(DEGEN-J) = "."
000445            OR DEGEN-J NOT < DEGEN-L
000445         IF DEGEN-ALPHA-16(DEGEN-J) = "."
000445            MOVE 3 TO DEGEN-RETURN-CODE.
000445 DEGEN-CHECK-SIZE SECTION.
000445 DEGEN-CHECK-SIZE-01.
000445     IF (DEGEN-SIGN = "N") AND (DEGEN-DECIMALS = ZERO)
000445          GO DEGEN-CHECK-SIZE-EXIT.
000445     SUBTRACT 1 FROM DEGEN-LENGTH GIVING DEGEN-L.
000445     MOVE DEGEN-L TO DEGEN-I.
000445     IF DEGEN-SIGN = "Y"
000445          SUBTRACT 1 FROM DEGEN-I.
000445     IF DEGEN-DECIMALS NOT = ZERO
000445          SUBTRACT 1 FROM DEGEN-I   % for decimal point
000445          SUBTRACT DEGEN-DECIMALS FROM DEGEN-I.
000445     PERFORM DEGEN-DUMMY VARYING DEGEN-J FROM 1 BY 1 UNTIL
000445        (DEGEN-ALPHA-16(DEGEN-J) NOT < "1"
000445                 AND NOT > "9" OR = ".")
000445        OR (DEGEN-J = DEGEN-L).
000445     IF DEGEN-ALPHA-16(DEGEN-J) = "."
000445        GO TO DEGEN-CHECK-SIZE-EXIT.
000445     ADD 1, DEGEN-J GIVING DEGEN-K.
000445     PERFORM DEGEN-DUMMY VARYING DEGEN-K FROM DEGEN-K BY 1
000445        UNTIL (DEGEN-ALPHA-16(DEGEN-K) < "0" OR  > "9")
000445           OR DEGEN-K = DEGEN-L
000445           OR DEGEN-K = 16.
000445     IF DEGEN-ALPHA-16(DEGEN-K) < "0" OR > "9"
000445        SUBTRACT 1 FROM DEGEN-K.
000445     SUBTRACT -1 DEGEN-J FROM DEGEN-K GIVING DEGEN-K
000445     IF DEGEN-K > DEGEN-I
000445        MOVE 4 TO DEGEN-RETURN-CODE.
000445 DEGEN-CHECK-SIZE-EXIT.
000445 DEGEN-DUMMY SECTION.  % This dummy section does nothing
000445 DEGEN-DUMMY-START.
000445     EXIT.
000445 Z-100-PRINT-SCREEN SECTION.
000445 Z-100-PRINT-SCREEN-01.
000445     CALL "WSCLOSE".
000445     MOVE "#"          TO SCRPRT-NAME-A.
000445     CALL "EXTRACT" USING SCRPRT-ID
000445                          SCRPRT-NAME-B.
000445     MOVE "0"          TO SCRPRT-NAME-C.
000445     MOVE SPACE        TO SCRPRT-NAME-D.
000445     CALL "SCREEN"  USING SCRPRT-WORKSTATION-STATUS
000445                          SCRPRT-UFB-ADDRESS
000445                          SCRPRT-PRINT-TYPE
000445                          SCRPRT-PRINT-FILE.
000445     CALL "BELL"    USING SCRPRT-BELL-TIME.
000445 Z-100-EXIT.  EXIT.
000445
000462 SY000M-OPEN SECTION.
000462 SY000M-OPEN-RETURN.  EXIT.
000462 SY000M-OPEN-INPUT SECTION.
000462 SY000M-OPEN-INPUT-01.
000462      MOVE STDERR-IN  TO SYS99-FUNCTION.
000462      PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-OPEN-INPUT-RTN. EXIT.
000462 SY000M-OPEN-OUTPUT SECTION.
000462 SY000M-OPEN-OUTPUT-01.
000462      MOVE STDERR-OU  TO SYS99-FUNCTION.
000462      PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-OPENOUTPUT-RETURN.  EXIT.
000462 SY000M-OPEN-IO SECTION.
000462 SY000M-OPEN-IO-1.
000462      MOVE STDERR-IO TO SYS99-FUNCTION.
000462      PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-OPENIO-RETURN.  EXIT.
000462 SY000M-OPEN-SPECIAL-INPUT SECTION.
000462 SY000M-OPEN-SPECIAL-INPUT-1.
000462      MOVE STDERR-SP TO SYS99-FUNCTION.
000462      PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-OPEN-SP-IN-RTN. EXIT.
000462 SY000M-FILE-LIB-VOL SECTION.
000462 SY000M-FILE-LIB-VOL-1.
000462      MOVE STDERR-FLV TO SYS99-FUNCTION.
000462      PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-FILE-LIB-VOL-RTN. EXIT.
000462 SY000M-CLOSE SECTION.
000462 SY000M-CLOSE-1.
000462      MOVE STDERR-CL TO SYS99-FUNCTION.
000462      PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-CLOSE-RETURN.  EXIT.
000462 SY000M-READ SECTION.
000462 SY000M-READ-1.
000462     MOVE STDERR-RK TO SYS99-FUNCTION.
000462     MOVE ZERO  TO SYS99-KEY-NO.
000462         PERFORM SY000M-IOMODULE-CALL
000462         .
000462 SY000M-READ-RETURN.  EXIT.
000462 SY000M-READ-WITH-HOLD SECTION.
000462 SY000M-READ-WITH-HOLD-1.
000462     MOVE STDERR-RKH TO SYS99-FUNCTION.
000462     MOVE ZERO  TO SYS99-KEY-NO.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-READWITHHOLD-RETURN.  EXIT.
000462 SY000M-DELETE SECTION.
000462 SY000M-DELETE-1.
000462     MOVE STDERR-DL TO SYS99-FUNCTION.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-DELETE-RETURN.  EXIT.
000462 SY000M-REWRITE SECTION.
000462 SY000M-REWRITE-01.
000462     MOVE STDERR-RW TO SYS99-FUNCTION.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-REWRITE-RETURN.  EXIT.
000462 SY000M-WRITE SECTION.
000462 SY000M-WRITE-01.
000462     MOVE STDERR-WR  TO SYS99-FUNCTION.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-WRITE-RETURN.  EXIT.
000462 SY000M-START-NOT-LESS-THAN SECTION.
000462 SY000M-START-NOT-LESS-THAN-1.
000462     MOVE STDERR-SNL TO SYS99-FUNCTION.
000462     MOVE ZERO  TO SYS99-KEY-NO.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-STARTNOTLESSTHAN-RETURN.  EXIT.
000462 SY000M-START-EQUAL SECTION.
000462 SY000M-START-EQUAL-1.
000462     MOVE STDERR-SEQ TO SYS99-FUNCTION.
000462     MOVE ZERO  TO SYS99-KEY-NO.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-STARTEQUAL-RETURN.  EXIT.
000462 SY000M-START-GREATER-THAN SECTION.
000462 SY000M-START-GREATER-THAN-1.
000462     MOVE STDERR-STG TO SYS99-FUNCTION.
000462     MOVE ZERO  TO SYS99-KEY-NO.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-STARTGREATERTHAN-RETURN.  EXIT.
000462 SY000M-READ-NEXT SECTION.
000462 SY000M-READ-NEXT-01.
000462     MOVE STDERR-RN TO SYS99-FUNCTION.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-READNEXT-RETURN.  EXIT.
000462 SY000M-READ-NEXT-WITH-HOLD SECTION.
000462 SY000M-READ-NEXT-WITH-HOLD-1.
000462     MOVE STDERR-RNH TO SYS99-FUNCTION.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY000M-READNEXTWITHHOLD-RETURN.  EXIT.
000462 SY400A-OPEN-INPUT SECTION.
000462 SY400A-OPEN-INPUT-1.
000462      MOVE STDERR-GIN TO SYS99-FUNCTION.
000462      PERFORM SY000M-IOMODULE-CALL.
000462 SY400A-OPEN-INPUT-RTN. EXIT.
000462 SY400A-CLOSE SECTION.
000462 SY400A-CLOSE-01.
000462      MOVE STDERR-GC TO SYS99-FUNCTION.
000462      PERFORM SY000M-IOMODULE-CALL.
000462 SY400A-CLOSE-RTN. EXIT.
000462 SY400A-READ-NEXT SECTION.
000462 SY400A-READ-NEXT-01.
000462     MOVE STDERR-GRN TO SYS99-FUNCTION.
000462     PERFORM SY000M-IOMODULE-CALL.
000462 SY400A-READ-NEXT-RTN. EXIT.
000462 SY000M-IOMODULE-CALL SECTION.
000462 SY000M-IOMODULE-CALL-1.
000462      MOVE SYS99-FUNCTION TO STDERR-SAVE-FUNCTION.
000462      CALL "QASY000M" USING  SY000M-FILE-DATA
000462                                  SY000M-RECORD
000462                                  SY000-RECEIVE-PORT
000462                                  SY000-S1-PORT
000462                                  SY000-DATASET
000462                                  SY000-DEADLOCK-FLAG
000462                                  SYS99-BLOCK.
000462      IF SYS99-FUNCTION = STDERR-FE
000462          MOVE STDERR-SAVE-FUNCTION TO SYS99-FUNCTION
000462          PERFORM SY000M-FATAL-ERROR
000462      ELSE
000462      IF SY000-DEADLOCK-FLAG = STDERR-Y
000462          MOVE "FILE IN DEADLOCK" TO SYS99-MESSAGE1
000462          PERFORM SY000M-FATAL-ERROR.
000462 SY000M-IOMODULECALL-RETURN.  EXIT.
000462 SY000M-FATAL-ERROR SECTION.
000462 SY000M-FATAL-ERROR-PARA.
000462     IF SYS99-FILE        = SPACES
000462        MOVE "SY000M"                TO SYS99-FILE.
000462     IF SYS99-LIBRARY     = SPACES
000462        MOVE SY000M-LIBRARY          TO SYS99-LIBRARY.
000462     IF SYS99-VOLUME      = SPACES
000462        MOVE SY000M-VOLUME           TO SYS99-VOLUME.
000462     IF SYS99-STATUS      = SPACES
000462        MOVE SY000M-FILE-STATUS      TO SYS99-STATUS.
000462     IF SYS99-RECORD      = SPACES
000462        MOVE SY000M-RECORD        TO SYS99-RECORD.
000462     IF SYS99-KEY         = SPACES
000462        MOVE SY000M-KEY           TO SYS99-KEY.
000462     PERFORM FATAL-ERROR.
000462 SY000M-FATALERROR-RETURN.  EXIT.
000085 INITIALIZATION SECTION.
000085 INITIALIZATION-01.
000085     IF GET-RECEIVER-FIELD = SPACES
000085         CALL "GETPARM" USING GET-FUNC-TYPE
000085                          GET-FORM-TYPE
000085                          GET-PRNAME
000085                          GET-PFKEY-REC
000085                          GET-MESS-ID
000085                          GET-MESS-SOURCE
000085                          GET-MESS-TEXT
000085                          GET-MESS-TEXT-LENGTH
000085                          GET-KEYWORD-TYPE
000085                          GET-KEYWORD
000085                          GET-RECEIVER-FIELD
000085                          GET-MESSAGE-LENGTH
000085                          GET-ROW-OF-FIELD
000085                          GET-COL-OF-FIELD
000085                          GET-DATA-TYPE.
000085*$WANG_CODE
000085     MOVE "CR" TO SY000-INTTASK-FUNC.
000085     CALL "EXTRACT" USING SY000-KEYWORD
000085                          SY000-EXTRACT-PORT.
000085     MOVE SY000-BIN-PORT TO SY000-RECEIVE-PORT-RED.
000085 SY000-CREATE-PORT-RETRY.
000085     MOVE SY000-RECEIVE-PORT TO SY000-INTTASK-PORT.
000085     CALL "MESSAGE" USING SY000-INTTASK-FUNC,
000085                          SY000-INTTASK-PORT,
000085                          SY000-INTTASK-RCODE.
000085     IF SY000-INTTASK-ECODE = 4
000085         ADD 1 TO SY000-RECEIVE-PORT-RED
000085         GO TO SY000-CREATE-PORT-RETRY.
000085     MOVE SY000-INTTASK-PORT TO SY000-RECEIVE-PORT.
000085*$WANG_END
000086     MOVE "SY000" TO SYS99-PROGRAM.
000086     MOVE ZERO     TO SY000-TRANSACTION-NO.
000445 RDMN-FAC-INITIALIZATION-2.
000445     PERFORM RDMN-FAC-INITIALIZATION.
000445 DEGEN-INITIALIZATION-01.
000462     MOVE SPACES TO SY000M-FILLER.
000445 CLOSEFILES SECTION.
000445 DEGEN-CLOSEFILES-01.
000445     CALL "WSCLOSE".
000445 RDMN-FAC-INITIALIZATION SECTION.
000445 RDMN-FAC-INITIALIZATION-1.
000445     IF S1-NFIELDS > 99
000445         DISPLAY "ERROR: The number of fields on the maintenance s
000445-            "creen ",
000445             "is larger than the frame parameter SCREEN1FIELDS. ",
000445             "This parameter must be adjusted."
000445         STOP RUN.
000445 RDMN-FAC-INITIALIZATION-EXIT.
000445 RDMN-SET-ALL-FIELDS-PRO SECTION.
000445 RDMN-SET-ALL-FIELDS-PRO-01.
000445     MOVE S1-FAC (RDMN-FAC-I)
000445          TO RDMN-FACS-SAVE (RDMN-FAC-I).
000445     IF S1-OBJECT (RDMN-FAC-I) = 1
000445        IF DEGEN-PROTECTED OF S1-FAC (RDMN-FAC-I) OFF
000445           SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I)
000445                 ON
000445           SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) ON
000445           SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I)
000445                 OFF
000445           SET RDMN-NUMERIC OF S1-FAC(RDMN-FAC-I)
000445                 OFF
000445           MOVE 1 TO RDMN-MOD-FLAG (RDMN-FAC-I).
000445 RDMN-SET-ALL-FIELDS-PRO-EXIT.
000445 RDMN-PROTECT-TO-MODIFY SECTION.
000445 RDMN-PROTECT-TO-MODIFY-01.
000445     PERFORM RDMN-FIND-KEY-FIELD.
000445     IF RDMN-KEY-FLAG = 1
000445          GO TO RDMN-PROTECT-TO-MODIFY-EXIT.
000445     IF S1-OBJECT (RDMN-FAC-I) = 0
000445          GO TO RDMN-PROTECT-TO-MODIFY-EXIT.
000445     SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I) OFF .
000445     SET RDMN-UNDERSCORE OF S1-FAC(RDMN-FAC-I) ON .
000445     IF RDMN-MOD-FLAG (RDMN-FAC-I) = 1
000445          SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) OFF
000445     ELSE
000445          SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) ON .
000445     SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I) OFF .
000445     SET RDMN-NUMERIC OF S1-FAC(RDMN-FAC-I) OFF .
000445 RDMN-PROTECT-TO-MODIFY-EXIT.
000445 RDMN-MODIFY-TO-PROTECT SECTION.
000445 RDMN-MODIFY-TO-PROTECT-01.
000445     PERFORM RDMN-FIND-KEY-FIELD.
000445     IF RDMN-KEY-FLAG = 1
000445          GO TO RDMN-MODIFY-TO-PROTECT-EXIT.
000445     IF S1-OBJECT (RDMN-FAC-I) = 0
000445          GO TO RDMN-MODIFY-TO-PROTECT-EXIT.
000445     MOVE RDMN-FACS-SAVE (RDMN-FAC-I)
000445          TO S1-FAC (RDMN-FAC-I).
000445          SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I)
000445                ON .
000445          SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) ON.
000445          SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I)
000445                OFF.
000445          SET RDMN-NUMERIC OF S1-FAC(RDMN-FAC-I) OFF.
000445          IF RDMN-MOD-FLAG (RDMN-FAC-I) = 0
000445              SET RDMN-UNDERSCORE OF
000445                    S1-FAC(RDMN-FAC-I) OFF .
000445 RDMN-MODIFY-TO-PROTECT-EXIT.
000445 RDMN-SET-MOD-FIELDS-MOD SECTION.
000445 RDMN-SET-MOD-FIELDS-MOD-01.
000445     PERFORM RDMN-FIND-KEY-FIELD.
000445     IF RDMN-KEY-FLAG = 1
000445          GO TO RDMN-SET-MOD-FIELDS-MOD-EXIT.
000445     IF S1-OBJECT (RDMN-FAC-I) = 0
000445          GO TO RDMN-SET-MOD-FIELDS-MOD-EXIT.
000445     IF RDMN-MOD-FLAG (RDMN-FAC-I) = 1
000445         MOVE RDMN-FACS-SAVE (RDMN-FAC-I) TO
000445                 S1-FAC (RDMN-FAC-I).
000445 RDMN-SET-MOD-FIELDS-MOD-EXIT.
000445 RDMN-PROTECT-KEY-FIELDS SECTION.
000445 RDMN-PROTECT-KEY-FIELDS-01.
000445     PERFORM RDMN-FIND-KEY-FIELD.
000445     IF RDMN-KEY-FLAG = 0
000445          GO TO RDMN-PROTECT-KEY-FIELDS-EXIT.
000445     IF S1-OBJECT (RDMN-FAC-I) = 0
000445          GO TO RDMN-PROTECT-KEY-FIELDS-EXIT.
000445     MOVE RDMN-FACS-SAVE (RDMN-FAC-I) TO
000445            S1-FAC (RDMN-FAC-I).
000445     IF RDMN-PROTECT-KEY-FLAG = 1
000445          SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) ON
000445          SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I)
000445                OFF
000445          SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I)
000445                ON
000445          SET RDMN-NUMERIC OF S1-FAC(RDMN-FAC-I) OFF
000445       ELSE
000445         IF RDMN-MOD-FLAG (RDMN-FAC-I) = 1
000445            SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) OFF
000445            SET DEGEN-PROTECTED OF S1-FAC(RDMN-FAC-I)
000445                  OFF .
000445 RDMN-PROTECT-KEY-FIELDS-EXIT.
000445 RDMN-SET-FIELDS-FLASH SECTION.
000445 RDMN-SET-FIELDS-FLASH-01.
000445     PERFORM RDMN-FIND-KEY-FIELD.
000445     IF RDMN-KEY-FLAG = 1
000445          GO TO RDMN-SET-FIELDS-FLASH-EXIT.
000445     IF S1-OBJECT (RDMN-FAC-I) = 0
000445          GO TO RDMN-SET-FIELDS-FLASH-EXIT.
000445     SET DEGEN-DIM OF S1-FAC(RDMN-FAC-I) OFF
000445     SET DEGEN-FLASHING OF S1-FAC(RDMN-FAC-I) ON .
000445 RDMN-SET-FIELDS-FLASH-EXIT.
000445 RDMN-FIND-KEY-FIELD SECTION.
000445 RDMN-FIND-KEY-FIELD-01.
000445     MOVE 1 TO RDMN-KEY-FLAG.
000445     IF S1-1-SEQ NOT = RDMN-FAC-I
000445     IF S1-1-SEQ NOT = RDMN-FAC-I
000445          MOVE 0 TO RDMN-KEY-FLAG.
000445 RDMN-FIND-KEY-FIELD-EXIT.
000445 S1-GENERATE SECTION.
000445 S1-GENERATE-01.
000445     PERFORM S1-INITIALIZE.
000445 S1-GENERATE-1. % for compatibility with older versions
000445     PERFORM S1-DISPLAY.
000445     PERFORM S1-LOCATE-FIELD
000445     PERFORM S1-PF-INTERPRET.
000445     IF S1-RETURNFLAG = "B" OR S1-RETURNFLAG = "H"
000445        GO TO S1-GENERATE-1
000445     ELSE IF S1-RETURNFLAG = "X"
000445        GO TO S1-GENERATE-EXIT.
000445     ADD 1 TO S1-CYCLE.
000445     IF S1-CYCLE > 1
000445        PERFORM S1-SETFACS
000445           VARYING S1-FIELD-I FROM 1 BY 1
000445           UNTIL S1-FIELD-I > S1-NFIELDS.
000445     MOVE SPACE TO DEGEN-STATUS S1-STATUS.
000445     PERFORM S1-IMAGE-TO-OBJECT.
000445     IF DEGEN-STATUS NOT = SPACE
000445        GO TO S1-GENERATE-1.
000445     PERFORM S1-VALIDATE.
000445     IF S1-STATUS NOT = SPACE
000445        GO TO S1-GENERATE-1.
000445 S1-GENERATE-EXIT.
000445     MOVE ZERO TO S1-LINE.
000445 S1-INITIALIZE SECTION.
000445 S1-INITIALIZE-01.
000445          MOVE "1" TO DEGEN-LASTIMAGE.
000445     PERFORM S1-SOURCE-TO-IMAGE.
000445     MOVE SPACES TO S1-WARNFLAGS.
000445     MOVE ZERO TO S1-CYCLE.
000445     PERFORM S1-SETFACS VARYING S1-FIELD-I FROM 1
000445          BY 1 UNTIL S1-FIELD-I > S1-NFIELDS.
000445     PERFORM S1-DISPLAY-MSG.
000445 S1-DISPLAY SECTION.
000445 S1-DISPLAY-01.
000445     PERFORM S1-PARMS-SM.
000445     IF S1-LINE = -1
000445        MOVE S1-ROW TO S1-LINE.
000445     IF S1-POS = -1
000445        MOVE S1-COL TO S1-POS.
000445     PERFORM S1-DISACCT-SM.
000445     MOVE -1 TO S1-LINE
000445                S1-POS.
000445     PERFORM S1-PFACCT-M.
000445     PERFORM S1-ERASE-MSGS.
000445     IF S1-PF = 15
000445               MOVE DEGEN-LOPRO TO S1-MSG-FAC
000445               MOVE "Screen printed" TO S1-MSG
000445               PERFORM S1-DISPLAY-MSG
000445               PERFORM Z-100-PRINT-SCREEN
000445               GO TO S1-DISPLAY-01.
000445     MOVE DEGEN-FLPRO TO S1-MSG-FAC.
000445     MOVE FLPRO TO S1-MSG-FAC.
000445 S1-LOCATE-FIELD SECTION.
000445 S1-LOCATE-FIELD-01.
000445     MOVE SPACE TO S1-FTAG, S1-FOUND.
000445     MOVE ZERO TO S1-OCCURRENCE.
000445     PERFORM S1-CHECK-FIELD
000445       VARYING S1-FIELD-INDEX FROM 1 BY 1
000445       UNTIL S1-FIELD-INDEX > S1-NFIELDS OR
000445             S1-FOUND NOT = SPACE.
000445     IF S1-FOUND = SPACE
000445        MOVE SPACE TO S1-FTAG
000445        MOVE ZERO TO S1-FIELD-INDEX, S1-OCCURRENCE
000445     ELSE
000445        SUBTRACT 1 FROM S1-FIELD-INDEX.
000445 S1-CHECK-FIELD SECTION.
000445 S1-CHECK-FIELD-01.
000445     IF S1-TAG (S1-FIELD-INDEX) = S1-FTAG
000445        ADD 1 TO S1-OCCURRENCE
000445     ELSE
000445        MOVE S1-TAG (S1-FIELD-INDEX) TO S1-FTAG
000445        MOVE 1 TO S1-OCCURRENCE.
000445     IF S1-ROW = S1-COORD-ROW (S1-FIELD-INDEX)
000445        IF S1-COL NOT < S1-COORD-COL (S1-FIELD-INDEX)
000445           IF S1-COL < S1-COORD-COL (S1-FIELD-INDEX)
000445              +  S1-LENGTH (S1-FIELD-INDEX)
000445              MOVE "Y" TO S1-FOUND.
000445 S1-PF-INTERPRET SECTION.
000445 S1-PF-INTERPRET-01.
000445     IF S1-PF = ZERO
000445          MOVE S1-PFK (33) TO S1-RETURNFLAG
000445     ELSE IF S1-PF > 32
000445          MOVE S1-PF TO S1-PF-DISP
000445          DISPLAY "INVALID VALUE IN PF KEY:", S1-PF-DISP
000445          MOVE "B" TO S1-RETURNFLAG
000445     ELSE
000445          MOVE S1-PFK (S1-PF) TO S1-RETURNFLAG.
000445     IF S1-RETURNFLAG = "B"
000445          MOVE S1-BEEP TO S1-BEEPFLAG
000445          MOVE "Invalid program function key" TO S1-MSG
000445          PERFORM S1-DISPLAY-MSG
000445     .
000445 S1-SETFACS SECTION.
000445 S1-SETFACS-01.
000445     MOVE S1-COORD-ROW (S1-FIELD-I) TO S1-ROW-I.
000445     MOVE S1-COORD-COL (S1-FIELD-I) TO S1-COL-I.
000445     MOVE S1-FAC (S1-FIELD-I) TO
000445          S1-COLX (S1-ROW-I, S1-COL-I).
000445 S1-MARKERROR SECTION.
000445 S1-MARKERROR-01.
000445     MOVE S1-BEEP TO S1-BEEPFLAG.
000445     MOVE S1-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL)
000445          TO DEGEN-FAC.
000445     SET DEGEN-FLASHING OF DEGEN-FAC ON.
000445     SET DEGEN-DIM OF DEGEN-FAC OFF.
000445     MOVE DEGEN-FAC TO
000445          S1-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL).
000445     IF S1-STATUS = SPACE
000445          IF DEGEN-STATUS NOT = SPACE OR (S1-SEVERITY
000445               = "W" OR "P")
000445             IF S1-LINE = -1
000445                MOVE DEGEN-COORD-ROW TO S1-LINE.
000445     IF S1-STATUS = SPACE
000445          IF DEGEN-STATUS NOT = SPACE OR (S1-SEVERITY
000445               = "W" OR "P")
000445             MOVE "E" TO S1-STATUS
000445             IF S1-POS = -1
000445                ADD 1 DEGEN-COORD-COL GIVING S1-POS.
000445     IF DEGEN-STATUS NOT = SPACE
000445          MOVE DEGEN-ERROR-MESSAGE (DEGEN-RETURN-CODE)
000445               TO S1-MSG.
000445     PERFORM S1-DISPLAY-MSG.
000445 S1-DISPLAY-MSG SECTION.
000445 S1-DISPLAY-MSG-01.
000445     IF S1-MSGEND = SPACES
000445          STRING DEGEN-HIPRO, SY000-DATASET
000445          DELIMITED BY SIZE INTO S1-MSGEND.
000445     IF S1-MSG NOT = SPACES
000445         MOVE SPACES TO S1-FINDROWFLAG
000445         IF S1-MSG-LINENO NOT > 039 AND
000445            S1-MSG-LINENO > ZERO
000445            PERFORM S1-SETMSG
000445         ELSE
000445             IF S1-MSG-LINENO = ZERO
000445                 MOVE 039 TO S1-MSG-I
000445                 PERFORM S1-FINDROW
000445                     UNTIL S1-MSG-LINENO NOT = ZERO
000445                 IF S1-MSG-LINENO NOT > 039
000445                     PERFORM S1-SETMSG
000445                 ELSE
000445                     MOVE "F" TO S1-FINDROWFLAG
000445             ELSE
000445                 MOVE "F" TO S1-FINDROWFLAG.
000445 S1-FINDROW SECTION.
000445 S1-FINDROW-01.
000445     IF S1-MSG-FLAG (S1-MSG-I) = "Y"
000445         MOVE S1-MSG-I TO S1-MSG-LINENO
000445     ELSE
000445         IF S1-MSG-I > 1
000445             SUBTRACT 1 FROM S1-MSG-I
000445         ELSE
000445             MOVE 999 TO S1-MSG-LINENO.
000445 S1-SETMSG SECTION.
000445 S1-SETMSG-01.
000445     IF S1-MSG-FLAG (S1-MSG-LINENO) = "Y"
000445         MOVE "M" TO S1-MSG-FLAG (S1-MSG-LINENO)
000445         MOVE S1-MSG-AND-FAC TO
000445         S1-ROWX(S1-MSG-LINENO)
000445         MOVE "S" TO S1-FINDROWFLAG
000445     ELSE
000445         MOVE "F" TO S1-FINDROWFLAG.
000445 S1-DISPLAY-BACKGROUND SECTION.
000445 S1-DISPLAY-BACKGROUND-01.
000445     COMPUTE DEGEN-STR-OUTPUT-OFFSET-LOW =
000445         S1-NCOLS * (S1-ROW-I - 1) + S1-COL-I - 1.
000445     CALL "STRING" USING DEGEN-STR-QUOTE-MI,
000445         DEGEN-BACKGROUND-STRING,
000445         DEGEN-STR-INPUT-OFFSET,
000445         DEGEN-STR-INPUT-LENGTH,
000445         S1-REC,
000445         DEGEN-STR-OUTPUT-OFFSET.
000445 S1-ERASE-MSGS SECTION.
000445 S1-ERASE-MSGS-01.
000445     MOVE SPACES TO S1-MSG.
000445     IF S1-MSG-LINENO = ZERO
000445         MOVE 039 TO S1-MSG-I
000445         PERFORM S1-FINDROW
000445             UNTIL S1-MSG-LINENO  NOT = ZERO.
000445     IF S1-MSG-LINENO NOT > 039
000445         MOVE "Y" TO S1-MSG-FLAG (S1-MSG-LINENO)
000445         MOVE DEGEN-LOPRO TO S1-ROWX(S1-MSG-LINENO).
000445 S2-GENERATE SECTION.
000445 S2-GENERATE-01.
000445     PERFORM S2-INITIALIZE.
000445 S2-GENERATE-1. % for compatibility with older versions
000445     PERFORM S2-DISPLAY.
000445     PERFORM S2-LOCATE-FIELD
000445     PERFORM S2-PF-INTERPRET.
000445     IF S2-RETURNFLAG = "B" OR S2-RETURNFLAG = "H"
000445        GO TO S2-GENERATE-1
000445     ELSE IF S2-RETURNFLAG = "X"
000445        GO TO S2-GENERATE-EXIT.
000445     ADD 1 TO S2-CYCLE.
000445     IF S2-CYCLE > 1
000445        PERFORM S2-SETFACS
000445           VARYING S2-FIELD-I FROM 1 BY 1
000445           UNTIL S2-FIELD-I > S2-NFIELDS.
000445     MOVE SPACE TO DEGEN-STATUS S2-STATUS.
000445     PERFORM S2-IMAGE-TO-OBJECT.
000445     IF DEGEN-STATUS NOT = SPACE
000445        GO TO S2-GENERATE-1.
000445     PERFORM S2-VALIDATE.
000445     IF S2-STATUS NOT = SPACE
000445        GO TO S2-GENERATE-1.
000445 S2-GENERATE-EXIT.
000445     MOVE ZERO TO S2-LINE.
000445 S2-INITIALIZE SECTION.
000445 S2-INITIALIZE-01.
000445          MOVE "2" TO DEGEN-LASTIMAGE.
000445     PERFORM S2-SOURCE-TO-IMAGE.
000445     MOVE SPACES TO S2-WARNFLAGS.
000445     MOVE ZERO TO S2-CYCLE.
000445     PERFORM S2-SETFACS VARYING S2-FIELD-I FROM 1
000445          BY 1 UNTIL S2-FIELD-I > S2-NFIELDS.
000445     PERFORM S2-DISPLAY-MSG.
000445 S2-DISPLAY SECTION.
000445 S2-DISPLAY-01.
000445     IF S2-LINE = -1
000445        MOVE S2-ROW TO S2-LINE.
000445     IF S2-POS = -1
000445        MOVE S2-COL TO S2-POS.
000445     PERFORM S2-DISACCT-SM.
000445     MOVE -1 TO S2-LINE
000445                S2-POS.
000445     PERFORM S2-PFACCT-M.
000445     PERFORM S2-ERASE-MSGS.
000445     IF S2-PF = 15
000445               MOVE DEGEN-LOPRO TO S2-MSG-FAC
000445               MOVE "Screen printed" TO S2-MSG
000445               PERFORM S2-DISPLAY-MSG
000445               PERFORM Z-100-PRINT-SCREEN
000445               GO TO S2-DISPLAY-01.
000445     MOVE DEGEN-FLPRO TO S2-MSG-FAC.
000445 S2-LOCATE-FIELD SECTION.
000445 S2-LOCATE-FIELD-01.
000445     MOVE SPACE TO S2-FTAG, S2-FOUND.
000445     MOVE ZERO TO S2-OCCURRENCE.
000445     PERFORM S2-CHECK-FIELD
000445       VARYING S2-FIELD-INDEX FROM 1 BY 1
000445       UNTIL S2-FIELD-INDEX > S2-NFIELDS OR
000445             S2-FOUND NOT = SPACE.
000445     IF S2-FOUND = SPACE
000445        MOVE SPACE TO S2-FTAG
000445        MOVE ZERO TO S2-FIELD-INDEX, S2-OCCURRENCE
000445     ELSE
000445        SUBTRACT 1 FROM S2-FIELD-INDEX.
000445 S2-CHECK-FIELD SECTION.
000445 S2-CHECK-FIELD-01.
000445     IF S2-TAG (S2-FIELD-INDEX) = S2-FTAG
000445        ADD 1 TO S2-OCCURRENCE
000445     ELSE
000445        MOVE S2-TAG (S2-FIELD-INDEX) TO S2-FTAG
000445        MOVE 1 TO S2-OCCURRENCE.
000445     IF S2-ROW = S2-COORD-ROW (S2-FIELD-INDEX)
000445        IF S2-COL NOT < S2-COORD-COL (S2-FIELD-INDEX)
000445           IF S2-COL < S2-COORD-COL (S2-FIELD-INDEX)
000445              +  S2-LENGTH (S2-FIELD-INDEX)
000445              MOVE "Y" TO S2-FOUND.
000445 S2-PF-INTERPRET SECTION.
000445 S2-PF-INTERPRET-01.
000445     IF S2-PF = ZERO
000445          MOVE S2-PFK (33) TO S2-RETURNFLAG
000445     ELSE IF S2-PF > 32
000445          MOVE S2-PF TO S2-PF-DISP
000445          DISPLAY "INVALID VALUE IN PF KEY:", S2-PF-DISP
000445          MOVE "B" TO S2-RETURNFLAG
000445     ELSE
000445          MOVE S2-PFK (S2-PF) TO S2-RETURNFLAG.
000445     IF S2-RETURNFLAG = "B"
000445          MOVE S2-BEEP TO S2-BEEPFLAG
000445          MOVE "Invalid program function key" TO S2-MSG
000445          PERFORM S2-DISPLAY-MSG
000445     .
000445 S2-SETFACS SECTION.
000445 S2-SETFACS-01.
000445     MOVE S2-COORD-ROW (S2-FIELD-I) TO S2-ROW-I.
000445     MOVE S2-COORD-COL (S2-FIELD-I) TO S2-COL-I.
000445     MOVE S2-FAC (S2-FIELD-I) TO
000445          S2-COLX (S2-ROW-I, S2-COL-I).
000445 S2-MARKERROR SECTION.
000445 S2-MARKERROR-01.
000445     MOVE S2-BEEP TO S2-BEEPFLAG.
000445     MOVE S2-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL)
000445          TO DEGEN-FAC.
000445     SET DEGEN-FLASHING OF DEGEN-FAC ON.
000445     SET DEGEN-DIM OF DEGEN-FAC OFF.
000445     MOVE DEGEN-FAC TO
000445          S2-COLX (DEGEN-COORD-ROW, DEGEN-COORD-COL).
000445     IF S2-STATUS = SPACE
000445          IF DEGEN-STATUS NOT = SPACE OR (S2-SEVERITY
000445               = "W" OR "P")
000445             IF S2-LINE = -1
000445                MOVE DEGEN-COORD-ROW TO S2-LINE.
000445     IF S2-STATUS = SPACE
000445          IF DEGEN-STATUS NOT = SPACE OR (S2-SEVERITY
000445               = "W" OR "P")
000445             MOVE "E" TO S2-STATUS
000445             IF S2-POS = -1
000445                ADD 1 DEGEN-COORD-COL GIVING S2-POS.
000445     IF DEGEN-STATUS NOT = SPACE
000445          MOVE DEGEN-ERROR-MESSAGE (DEGEN-RETURN-CODE)
000445               TO S2-MSG.
000445     PERFORM S2-DISPLAY-MSG.
000445 S2-DISPLAY-MSG SECTION.
000445 S2-DISPLAY-MSG-01.
000445     IF S2-MSGEND = SPACES
000445          STRING DEGEN-HIPRO, SY000-DATASET
000445          DELIMITED BY SIZE INTO S2-MSGEND.
000445     IF S2-MSG NOT = SPACES
000445         MOVE SPACES TO S2-FINDROWFLAG
000445         IF S2-MSG-LINENO NOT > 024 AND
000445            S2-MSG-LINENO > ZERO
000445            PERFORM S2-SETMSG
000445         ELSE
000445             IF S2-MSG-LINENO = ZERO
000445                 MOVE 024 TO S2-MSG-I
000445                 PERFORM S2-FINDROW
000445                     UNTIL S2-MSG-LINENO NOT = ZERO
000445                 IF S2-MSG-LINENO NOT > 024
000445                     PERFORM S2-SETMSG
000445                 ELSE
000445                     MOVE "F" TO S2-FINDROWFLAG
000445             ELSE
000445                 MOVE "F" TO S2-FINDROWFLAG.
000445 S2-FINDROW SECTION.
000445 S2-FINDROW-01.
000445     IF S2-MSG-FLAG (S2-MSG-I) = "Y"
000445         MOVE S2-MSG-I TO S2-MSG-LINENO
000445     ELSE
000445         IF S2-MSG-I > 1
000445             SUBTRACT 1 FROM S2-MSG-I
000445         ELSE
000445             MOVE 999 TO S2-MSG-LINENO.
000445 S2-SETMSG SECTION.
000445 S2-SETMSG-01.
000445     IF S2-MSG-FLAG (S2-MSG-LINENO) = "Y"
000445         MOVE "M" TO S2-MSG-FLAG (S2-MSG-LINENO)
000445         MOVE S2-MSG-AND-FAC TO
000445         S2-ROWX(S2-MSG-LINENO)
000445         MOVE "S" TO S2-FINDROWFLAG
000445     ELSE
000445         MOVE "F" TO S2-FINDROWFLAG.
000445 S2-DISPLAY-BACKGROUND SECTION.
000445 S2-DISPLAY-BACKGROUND-01.
000445     COMPUTE DEGEN-STR-OUTPUT-OFFSET-LOW =
000445         S2-NCOLS * (S2-ROW-I - 1) + S2-COL-I - 1.
000445     CALL "STRING" USING DEGEN-STR-QUOTE-MI,
000445         DEGEN-BACKGROUND-STRING,
000445         DEGEN-STR-INPUT-OFFSET,
000445         DEGEN-STR-INPUT-LENGTH,
000445         S2-REC,
000445         DEGEN-STR-OUTPUT-OFFSET.
000445 S2-ERASE-MSGS SECTION.
000445 S2-ERASE-MSGS-01.
000445     MOVE SPACES TO S2-MSG.
000445     IF S2-MSG-LINENO = ZERO
000445         MOVE 024 TO S2-MSG-I
000445         PERFORM S2-FINDROW
000445             UNTIL S2-MSG-LINENO  NOT = ZERO.
000445     IF S2-MSG-LINENO NOT > 024
000445         MOVE "Y" TO S2-MSG-FLAG (S2-MSG-LINENO)
000445         MOVE DEGEN-LOPRO TO S2-ROWX(S2-MSG-LINENO).
000450 V-000-VALIDATE-MASK SECTION.
000450 V-000-VALIDATE-MASK-1.
000451     MOVE ZERO TO WS-TALLY.
000452     INSPECT SY000M-MASK(DEGEN-I) TALLYING WS-TALLY FOR ALL
000453             " " BEFORE INITIAL "/".
000454     IF WS-TALLY > ZERO
000455         MOVE ZERO TO DEGEN-EDITFLAG
000456         MOVE S1-BEEP TO S1-BEEPFLAG.
000457 V-000-RETURN.  EXIT.
